#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=T\u00e1to adresa URL je neplatn\u00e1 a ned\u00e1 sa na\u010d\u00edta\u0165.
fileNotFound=Pale Moon nedok\u00e1\u017ee n\u00e1js\u0165 s\u00fabor %S.
dnsNotFound=Pale Moon nedok\u00e1\u017ee n\u00e1js\u0165 server %S.
protocolNotFound=Pale Moon nevie spracova\u0165 t\u00fato adresu, preto\u017ee protokol (%S) nie je asociovan\u00fd so \u017eiadnym programom.
connectionFailure=Pale Moon nedok\u00e1\u017ee vytvori\u0165 pripojenie k serveru %S.
netInterrupt=Pripojenie k %S bolo po\u010das na\u010d\u00edtavania str\u00e1nky preru\u0161en\u00e9.
netTimeout=Server %S m\u00e1 pr\u00edli\u0161 dlh\u00fa odozvu.
redirectLoop=Pale Moon zistil, \u017ee server smeruje po\u017eiadavku tejto str\u00e1nky sp\u00f4sobom, ktor\u00fdm sa presmerovanie nikdy neukon\u010d\u00ed.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Ak chcete zobrazi\u0165 t\u00fato str\u00e1nku, inform\u00e1cie predt\u00fdm odoslan\u00e9 aplik\u00e1ciou %S musia by\u0165 odoslan\u00e9 znova. Ak znova odo\u0161lete \u00fadaje, ka\u017ed\u00e1 akcia vykonan\u00e1 vo formul\u00e1ri (ako vyh\u013ead\u00e1vanie alebo online objedn\u00e1vka) bude zopakovan\u00e1.
resendButton.label=Znova odosla\u0165
unknownSocketType=Pale Moon nedok\u00e1\u017ee komunikova\u0165 so serverom.
netReset=Pri na\u010d\u00edtan\u00ed str\u00e1nky do\u0161lo k v\u00fdpadku pripojenia k serveru.
notCached=Tento dokument u\u017e viac nie je dostupn\u00fd.
netOffline=Pale Moon je pr\u00e1ve v re\u017eime offline a ned\u00e1 sa pomocou neho prehliada\u0165 web.
isprinting=S\u00fabor sa po\u010das tla\u010de alebo zobrazenia Uk\u00e1\u017eky pred tla\u010dou ned\u00e1 zmeni\u0165.
deniedPortAccess=T\u00e1to adresa pou\u017e\u00edva sie\u0165ov\u00fd port, ktor\u00fd je norm\u00e1lne pou\u017e\u00edvan\u00fd na in\u00e9 \u00fa\u010dely ako prehliadanie webu. Pale Moon zru\u0161il z d\u00f4vodu ochrany t\u00fato po\u017eiadavku.
proxyResolveFailure=Pale Moon je nakonfigurovan\u00fd na pou\u017e\u00edvanie servera proxy, ktor\u00fd sa ned\u00e1 n\u00e1js\u0165.
proxyConnectFailure=Pale Moon je nakonfigurovan\u00fd na pou\u017e\u00edvanie servera proxy, ktor\u00fd odmieta pripojenia.
contentEncodingError=Str\u00e1nka nem\u00f4\u017ee by\u0165 zobrazen\u00e1, preto\u017ee pou\u017e\u00edva neplatn\u00fa alebo nepodporovan\u00fa formu kompresie.
unsafeContentType=Str\u00e1nka nem\u00f4\u017ee by\u0165 zobrazen\u00e1, preto\u017ee sa nach\u00e1dza v arch\u00edvnom s\u00fabore, ktor\u00e9ho otvorenie nemus\u00ed by\u0165 bezpe\u010dn\u00e9. Obr\u00e1\u0165te sa na vlastn\u00edkov str\u00e1nky a informujte ich o tomto probl\u00e9me.
externalProtocolTitle=Po\u017eiadavka extern\u00e9ho protokolu
externalProtocolPrompt=Na spracovanie odkazov typu %1$S\: je potrebn\u00e1 extern\u00e1 aplik\u00e1cia.\n\n\nPo\u017eadovan\u00fd odkaz\:\n\n%2$S\n\nAplik\u00e1cia\: %3$S\n\n\nAk ste t\u00fato po\u017eiadavku neo\u010dak\u00e1vali, m\u00f4\u017ee to by\u0165 pokus o zneu\u017eitie aplik\u00e1cie. V pr\u00edpade pochybnost\u00ed t\u00fdkaj\u00facich sa \u0161kodlivosti tejto po\u017eiadavky ju zru\u0161te.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Nezn\u00e1ma aplik\u00e1cia>
externalProtocolChkMsg=Zapam\u00e4ta\u0165 si nastavenie pre v\u0161etky odkazy rovnak\u00e9ho typu.
externalProtocolLaunchBtn=Spusti\u0165 aplik\u00e1ciu
malwareBlocked=Str\u00e1nka %S bola ozna\u010den\u00e1 ako podvodn\u00e1 a na z\u00e1klade nastaven\u00ed zabezpe\u010denia bola zablokovan\u00e1.
phishingBlocked=Webov\u00e1 str\u00e1nka %S je nahl\u00e1sen\u00e1 ako podozriv\u00e1 str\u00e1nka pok\u00fa\u0161aj\u00faca sa podvodn\u00fdm sp\u00f4sobom vyl\u00e1ka\u0165 od pou\u017e\u00edvate\u013eov osobn\u00e9 alebo finan\u010dn\u00e9 \u00fadaje.
cspFrameAncestorBlocked=T\u00e1to str\u00e1nka obsahuje z\u00e1sady ochrany obsahu, ktor\u00e9 nepovo\u013euj\u00fa tento sp\u00f4sob jej vlo\u017eenia do objektu.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=T\u00e1to str\u00e1nka nemohla by\u0165 zobrazen\u00e1 kv\u00f4li chybe pri prenose \u00fadajov.
remoteXUL=T\u00e1to str\u00e1nka pou\u017e\u00edva nepodporovan\u00fa technol\u00f3giu, ktor\u00e1 nie je v predvolenom nastaven\u00ed Pale Moonu zapnut\u00e1.

