#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL-ul nu este valid \u0219i nu poate fi \u00eenc\u0103rcat.
fileNotFound=Pale Moon nu g\u0103se\u0219te fi\u0219ierul de la %S.
dnsNotFound=Pale Moon nu g\u0103se\u0219te serverul %S.
protocolNotFound=Pale Moon nu \u0219tie cum s\u0103 deschid\u0103 aceast\u0103 adres\u0103, deoarece protocolul (%S) nu este asociat cu niciun program.
connectionFailure=Pale Moon nu poate stabili o conexiune cu serverul %S.
netInterrupt=Conexiunea cu %S s-a \u00eentrerupt \u00een timp ce se \u00eenc\u0103rca pagina.
netTimeout=Serverul de la %S nu r\u0103spunde suficient de rapid.
redirectLoop=Pale Moon a detectat c\u0103 serverul redirec\u021bioneaz\u0103 cererea pentru aceast\u0103 adres\u0103 \u00eentr-un a\u0219a mod \u00eenc\u00e2t nu se va termina niciodat\u0103.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Pentru a afi\u0219a aceast\u0103 pagin\u0103, %S trebuie s\u0103 trimit\u0103 informa\u021bii care vor repeta orice ac\u021biune care s-a f\u0103cut anterior (cum ar fi o c\u0103utare sau o confirmare a unei comenzi).
resendButton.label=Retrimite
unknownSocketType=Pale Moon nu \u0219tie cum s\u0103 comunice cu serverul.
netReset=Conexiunea cu serverul a fost reini\u021bializat\u0103 \u00een timp ce se \u00eenc\u0103rca pagina.
notCached=Acest document nu mai este disponibil.
netOffline=Pale Moon se afl\u0103 acum \u00een modul offline \u0219i nu poate naviga pe web.
isprinting=Documentul nu poate fi modificat \u00een timp ce este tip\u0103rit sau previzualizat pentru a fi tip\u0103rit.
deniedPortAccess=Aceast\u0103 adres\u0103 folose\u0219te un port de re\u021bea care \u00een mod normal este utilizat \u00een alte scopuri dec\u00e2t pentru navigarea pe web. Pentru protec\u021bia dumneavoastr\u0103, Pale Moon a oprit aceast\u0103 cerere.
proxyResolveFailure=Pale Moon este configurat s\u0103 foloseasc\u0103 un server proxy care nu poate fi g\u0103sit.
proxyConnectFailure=Pale Moon este configurat s\u0103 foloseasc\u0103 un server proxy care refuz\u0103 conexiuni.
contentEncodingError=Pagina pe care \u00eencerca\u021bi s\u0103 o vizualiza\u021bi nu poate fi ar\u0103tat\u0103 deoarece folose\u0219te o form\u0103 de compresie invalid\u0103 sau nesuportat\u0103. V\u0103 rug\u0103m contacta\u021bi proprietarii saitului pentru a-i informa despre aceast\u0103 problem\u0103.
unsafeContentType=Pagina pe care \u00eencerca\u021bi s\u0103 pentru c\u0103 se afl\u0103 \u00eentr-un tip de fi\u0219ier care v-ar putea compromite siguran\u021ba. V\u0103 rug\u0103m s\u0103 contacta\u021bi proprietarii saitului pentru a-i informa despre aceast\u0103 problem\u0103.
externalProtocolTitle=Cerere protocol extern
externalProtocolPrompt=Trebuie lansat\u0103 o aplica\u021bie extern\u0103 pentru a manipula leg\u0103turi %1$S\:.\n\n\nLeg\u0103tur\u0103 cerut\u0103\:\n\n%2$S\n\nAplica\u021bie\: %3$S\n\n\nDac\u0103 nu v\u0103 a\u0219tepta\u021bi la aceast\u0103 cerere, aceasta poate fi o \u00eencercare de exploatare a unui defect \u00een cel\u0103lalt program. Renun\u021ba\u021bi la aceast\u0103 cerere dac\u0103 nu sunte\u021bi sigur(\u0103) c\u0103 nu este r\u0103u-inten\u021bionat\u0103.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Necunoscut>
externalProtocolChkMsg=Re\u021bine decizia mea pentru toate leg\u0103turile de acest tip.
externalProtocolLaunchBtn=Lanseaz\u0103 aplica\u021bia
malwareBlocked=Saitul %S a fost raportat ca fiind un sait de atac \u0219i a fost blocat conform preferin\u021belor dumneavoastr\u0103 legate de securitate.
phishingBlocked=Saitul %S a fost raportat ca fiind un sait fals menit s\u0103 p\u0103c\u0103leasc\u0103 utilizatorii s\u0103 dea informa\u021bii personale sau financiare.
cspFrameAncestorBlocked=Aceast\u0103 pagin\u0103 are o politic\u0103 de securitate asupra con\u021binutului care \u00eempiedic\u0103 integrarea \u00een acest fel.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Pagina care \u00eencerca\u021bi s\u0103 o vede\u021bi nu poate fi afi\u0219at\u0103 deoarece a fost detectat\u0103 o eroare legat\u0103 de transmiterea datelor.
remoteXUL=Aceast\u0103 pagin\u0103 folose\u0219te o tehnologie nesuportat\u0103 care nu mai este disponibil\u0103 implicit \u00een Pale Moon.

