#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=\uc548\uc804\ud558\uac8c \ud1b5\uc2e0 \ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc0c1\ub300\ubc29\uc774 \ub192\uc740 \ub4f1\uae09\uc758 \uc554\ud638\ud654\ub97c \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_US_ONLY_SERVER=\uc548\uc804\ud558\uac8c \ud1b5\uc2e0 \ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc0c1\ub300\ubc29\uc774 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\ub294 \ub192\uc740 \ub4f1\uae09\uc758 \uc554\ud638\ud654\ub97c \uc694\uccad\ud569\ub2c8\ub2e4.
SSL_ERROR_NO_CYPHER_OVERLAP=\uc0c1\ub300\ubc29\uacfc \uc548\uc804\ud558\uac8c \ud1b5\uc2e0 \ud560 \uc218 \uc5c6\uc74c\: \uc77c\ubc18 \uc554\ud638\ud654 \uc54c\uace0\ub9ac\ub4ec\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NO_CERTIFICATE=\uc778\uc99d\uc5d0 \ud544\uc694\ud55c \uc778\uc99d\uc11c \ub610\ub294 \ud0a4\ub97c \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_CERTIFICATE=\uc0c1\ub300\ubc29\uacfc \uc548\uc804\ud558\uac8c \ud1b5\uc2e0 \ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4\: \uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c\uac00 \uac70\uc808\ub410\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNUSED_5=\uc54c \uc218 \uc5c6\ub294 SSL \uc624\ub958 \ucf54\ub4dc\uc785\ub2c8\ub2e4.
SSL_ERROR_BAD_CLIENT=\uc11c\ubc84\uac00 \ud074\ub77c\uc774\uc5b8\ud2b8\ub85c\ubd80\ud130 \uc190\uc0c1\ub41c \ub370\uc774\ud130\ub97c \uc5bb\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_SERVER=\ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \uc11c\ubc84\ub85c\ubd80\ud130 \uc190\uc0c1\ub41c \ub370\uc774\ud130\ub97c \uc5bb\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=\uc9c0\uc6d0 \ud558\uc9c0 \uc54a\ub294 \uc778\uc99d\uc11c \ud615\uc2dd\uc785\ub2c8\ub2e4.
SSL_ERROR_UNSUPPORTED_VERSION=\uc0c1\ub300\ubc29\uc774 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\ub294 \ubcf4\uc548 \ud504\ub85c\ud1a0\ucf5c \ubc84\uc804\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4.
SSL_ERROR_UNUSED_10=\uc54c \uc218 \uc5c6\ub294 SSL \uc624\ub958 \ucf54\ub4dc\uc785\ub2c8\ub2e4.
SSL_ERROR_WRONG_CERTIFICATE=\ud074\ub77c\uc774\uc5b8\ud2b8 \uc778\uc99d \uc2e4\ud328\: \ud0a4 \uc800\uc7a5\uc18c\uc5d0 \uc788\ub294 \uac1c\uc778\ud0a4\uac00 \uc778\uc99d\uc11c \uc800\uc7a5\uc18c\uc5d0 \uc788\ub294 \uacf5\uac1c\ud0a4\uc640 \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_CERT_DOMAIN=\uc0c1\ub300\ubc29\uacfc \uc548\uc804\ud558\uac8c \ud1b5\uc2e0 \ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4\: \uc694\uccad\ub41c \ub3c4\uba54\uc778 \uc774\ub984\uc774 \uc11c\ubc84 \uc778\uc99d\uc11c\uc640 \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_POST_WARNING=\uc54c \uc218 \uc5c6\ub294 SSL \uc624\ub958 \ucf54\ub4dc\uc785\ub2c8\ub2e4.
SSL_ERROR_SSL2_DISABLED=\uc0c1\ub300\ubc29\uc774 \uc774 \ucef4\ud4e8\ud130\uc5d0\uc11c \uc0ac\uc6a9\ud558\uc9c0 \uc54a\ub294 SSL \ubc84\uc804 2\ub9cc \uc9c0\uc6d0\ud569\ub2c8\ub2e4.
SSL_ERROR_BAD_MAC_READ=SSL\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uba54\uc2dc\uc9c0 \uc778\uc99d \ucf54\ub4dc\uac00 \ub4e4\uc5b4 \uc788\ub294 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_MAC_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uba54\uc2dc\uc9c0 \uc778\uc99d \ucf54\ub4dc\ub97c \ubcf4\uace0\ud569\ub2c8\ub2e4.
SSL_ERROR_BAD_CERT_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \uc0ac\uc6a9\uc790 \uc778\uc99d\uc11c\ub97c \uac80\uc99d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_REVOKED_CERT_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ud3d0\uae30\ub41c \uc778\uc99d\uc11c\ub97c \uac70\uc808\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_EXPIRED_CERT_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c\ub9cc\ub8cc\ub41c \uc778\uc99d\uc11c\ub97c \uac70\uc808\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SSL_DISABLED=\uc5f0\uacb0 \ud560 \uc218 \uc5c6\uc74c\: SSL\uc744 \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_FORTEZZA_PQG=\uc5f0\uacb0 \ud560 \uc218 \uc5c6\uc74c\: SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ub2e4\ub978 FORTEZZA \ub3c4\uba54\uc778\uc5d0 \uc18d\ud574\uc788\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=\uc54c \uc218 \uc5c6\ub294 SSL \ud1b5\ud569 \uc554\ud638\ud654 \uc194\ub8e8\uc158 \ud328\ud0a4\uc9c0\ub97c \uc694\uccad \ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NO_CIPHERS_SUPPORTED=\uc774 \ud504\ub85c\uadf8\ub7a8\uc5d0\ub294 \uc0ac\uc6a9 \uac00\ub2a5\ud55c \ud1b5\ud569 \uc554\ud638\ud654 \uc194\ub8e8\uc158 \ud328\ud0a4\uc9c0\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_BLOCK_PADDING=SSL\uc774 \uc190\uc0c1\ub41c \ube14\ub7ed \ud328\ub529\uc774 \ub4e4\uc5b4\uc788\ub294 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL\uc774 \ud5c8\uc6a9 \uac00\ub2a5\ud55c \ucd5c\ub300 \uae38\uc774\ub97c \ub118\uc740 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL\uc774 \ud5c8\uc6a9 \uac00\ub2a5\ud55c \ucd5c\ub300 \uae38\uc774\ub97c \ub118\uc740 \ub808\ucf54\ub4dc \ubcf4\ub0b4\uae30\ub97c \uc2dc\ub3c4\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 Hello \uc694\uccad \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \ud074\ub77c\uc774\uc5b8\ud2b8 Hello \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc11c\ubc84 Hello \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc778\uc99d\uc11c \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc11c\ubc84 \ud0a4 \uad50\ud658 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc778\uc99d\uc11c \uc694\uccad \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc11c\ubc84 Hello \uc644\ub8cc \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc778\uc99d\uc11c \uac80\uc99d \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \ud074\ub77c\uc774\uc5b8\ud2b8 \ud0a4\uad50\ud658 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc644\ub8cc \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uc554\ud638\uae30 \uba85\uc138 \ubcc0\uacbd \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_ALERT=SSL\uc774 \ube44\uc815\uc0c1\uc801\uc778 \uacbd\uace0 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL\uc774 \ube44 \uc815\uc0c1\uc801\uc778 \uad50\ud658 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL\uc774 \ube44 \uc815\uc0c1\uc801\uc778 \ud504\ub85c\uadf8\ub7a8 \ub370\uc774\ud130 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 Hello \uc694\uccad \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \ud074\ub77c\uc774\uc5b8\ud2b8 Hello \uc694\uccad \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc11c\ubc84 Hello \uc694\uccad \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc778\uc99d\uc11c \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc11c\ubc84 \ud0a4 \uad50\ud658 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \ud074\ub77c\uc774\uc5b8\ud2b8 \uc694\uccad \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc11c\ubc84 Hello \uc644\ub8cc \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc778\uc99d\uc11c \ud655\uc778 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \ud074\ub77c\uc774\uc5b8\ud2b8 \ud0a4 \uad50\ud658 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc644\ub8cc \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uc554\ud638\uae30 \uba85\uc138 \ubcc0\uacbd \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uacbd\uace0 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \uad50\ud658 \ub370\uc774\ud130 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL\uc774 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294 \ud504\ub85c\uadf8\ub7a8 \ub370\uc774\ud130 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL\uc774 \uc54c \uc218 \uc5c6\ub294 \ucf58\ud150\uce20 \uc720\ud615\uc774 \ub4e4\uc5b4\uc788\ub294 \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL\uc774 \uc54c \uc218 \uc5c6\ub294 \uc720\ud615\uc758 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL\uc774 \uc54c \uc218 \uc5c6\ub294 \uacbd\uace0 \ub0b4\uc6a9\uc774 \ub4e4\uc5b4\uc788\ub294 \uacbd\uace0 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_CLOSE_NOTIFY_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \uc774 \uc5f0\uacb0\uc744 \ub2eb\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ubc1b\uc544\uac04 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ucc98\ub9ac\ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ubc1b\uc544\uac04 SSL \ub808\ucf54\ub4dc\uc758 \uc555\ucd95 \ud574\uc81c\ub97c \ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ubc1b\uc544\ub4e4\uc77c \uc218 \uc788\ub294 \ubcf4\uc548 \ub9e4\uac1c\ubcc0\uc218 \uc9d1\ud569\uc744 \ud611\uc0c1\ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ubc1b\uc544\ub4e4\uc77c \uc218 \uc5c6\ub294 \ucf58\ud150\uce20\uc5d0 \ub300\ud55c \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \uac70\uc808\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ubc1b\uc544\uac04 \uc778\uc99d\uc11c \uc720\ud615\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=SSL \uc0c1\ub300 \uce21\uc5d0\uc11c \ubc1b\uc544\uac04 \uc778\uc99d\uc11c\uc5d0 \ub300\ud574 \uba87 \uac00\uc9c0 \uc9c0\uc815\ub418\uc9c0 \uc54a\uc740 \ubb38\uc81c\ub97c \uac00\uc9c0\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL\uc774 \ub09c\uc218 \uc0dd\uc131\uae30 \uace0\uc7a5\uc5d0 \uc9c1\uba74\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SIGN_HASHES_FAILURE=\ubcf8\uc778\uc758 \uc778\uc99d\uc11c\ub97c \uac80\uc99d\ud558\ub294\ub370 \ud544\uc694\ud55c \ub514\uc9c0\ud138 \uc11c\uba85 \ub370\uc774\ud130\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL\uc740 \uc0c1\ub300\ubc29 \uc778\uc99d\uc11c\uc5d0\uc11c \uacf5\uac1c\ud0a4\ub97c \uaebc\ub0bc \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=SSL \uc11c\ubc84 \ud0a4 \uad50\ud658\uc744 \uc704\ud55c \uad50\ud658 \ub3c4\uc911\uc5d0 \uc9c0\uc815\ub418\uc9c0 \uc54a\uc740 \ubb38\uc81c\uc810\uc774 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=SSL \ud074\ub77c\uc774\uc5b8\ud2b8 \ud0a4 \uad50\ud658\uc744 \uc704\ud55c \uad50\ud658 \ub3c4\uc911\uc5d0 \uc9c0\uc815\ub418\uc9c0 \uc54a\uc740 \ubb38\uc81c\uc810\uc774 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_ENCRYPTION_FAILURE=\uc120\ud0dd\ud55c \ud1b5\ud569 \uc554\ud638\ud654 \uc194\ub8e8\uc158 \ud328\ud0a4\uc9c0\ub85c \ub2e4\ub7c9 \ub370\uc774\ud130 \uc554\ud638\ud654\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_DECRYPTION_FAILURE=\uc120\ud0dd\ud55c \ud1b5\ud569 \uc554\ud638\ud654 \uc194\ub8e8\uc158 \ud328\ud0a4\uc9c0\ub85c \ub2e4\ub7c9 \ub370\uc774\ud130 \ubcf5\ud638\ud654\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SOCKET_WRITE_FAILURE=\uae30\ubc18 \uc18c\ucf13\uc5d0 \uc554\ud638\ud654\ud55c \ub370\uc774\ud130 \uc4f0\uae30 \uc2dc\ub3c4\uac00 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_MD5_DIGEST_FAILURE=MD5 \uc694\uc57d \ud568\uc218\uac00 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SHA_DIGEST_FAILURE=SHA-1 \uc694\uc57d \ud568\uc218\uac00 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_MAC_COMPUTATION_FAILURE=MAC \uc5f0\uc0b0\uc774 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=\ub300\uce6d\ud0a4 \ub0b4\uc6a9 \uc0dd\uc131\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=\ud074\ub77c\uc774\uc5b8\ud2b8 \ud0a4 \uad50\ud658 \uba54\uc2dc\uc9c0\uc5d0\uc11c \ub300\uce6d\ud0a4\ub97c \uaebc\ub0b4\ub294\ub370 \uc2e4\ud328 \ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=SSL \uc11c\ubc84\uac00 \uc218\ucd9c\uc6a9 \ud1b5\ud569 \uc554\ud638\ud654 \uc194\ub8e8\uc158 \ud328\ud0a4\uc9c0\uc5d0 \uad6d\ub0b4\uc6a9 \uacf5\uac1c\ud0a4\ub97c \uc0ac\uc6a9\ud558\ub824\ub2e4 \uc2e4\ud328 \ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_IV_PARAM_FAILURE=PKCS \#11 \ucf54\ub4dc\uac00 IV\ub97c \ub9e4\uac1c\ubcc0\uc218\ub85c \ubc88\uc5ed\ud558\ub294\ub370 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=\uc120\ud0dd\ud55c \ud1b5\ud569 \uc554\ud638\ud654 \uc194\ub8e8\uc158 \ud328\ud0a4\uc9c0 \ucd08\uae30\ud654\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=\ud074\ub77c\uc774\uc5b8\ud2b8\uac00 SSL \uc138\uc158\uc5d0 \uc0ac\uc6a9\ud560 \ud0a4 \uc0dd\uc131\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=\uc11c\ubc84\uc5d0 \uc2dc\ub3c4\ud55c \ud0a4 \uad50\ud658 \uc54c\uace0\ub9ac\ub4ec\uc5d0 \uc801\ud569\ud55c \ud0a4\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=PKCS \#11 \ud1a0\ud070\uc774 \uc791\uc5c5\uc774 \uc9c4\ud589\ub418\ub294 \ub3d9\uc548 \uc0bd\uc785\ub418\uac70\ub098 \uc81c\uac70\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=\uc694\uccad\ub41c \uc791\uc5c5\uc744 \uc218\ud589\ud558\uae30\uc704\ud55c PKCS \#11 \ud1a0\ud070\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NO_COMPRESSION_OVERLAP=\uc0c1\ub300\ubc29\uacfc \uc548\uc804\ud558\uac8c \ud1b5\uc2e0 \ud560 \uc218 \uc5c6\uc74c\: \uc77c\ubc18 \uc555\ucd95 \uc54c\uace0\ub9ac\ub4ec\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=\ud604\uc7ac \uad50\ud658\uac00 \ub05d\ub0a0 \ub54c\uae4c\uc9c0 \ub2e4\ub978 SSL \uad50\ud658 \uc694\uccad\uc744 \ucd08\uae30\ud654 \ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=\uc0c1\ub300\ubc29\uc73c\ub85c \ubd80\ud130 \uc798\ubabb\ub41c \uad50\ud658 \ud574\uc26c \uac12\uc744 \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_CERT_KEA_MISMATCH=\uc120\ud0dd\ud55c \ud0a4 \uad50\ud658 \uc54c\uace0\ub9ac\ub4ec\uc5d0 \uc81c\uacf5\ud55c \uc778\uc99d\uc11c\ub97c \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=SSL \ud074\ub77c\uc774\uc5b8\ud2b8 \uc778\uc99d\uc6a9\uc73c\ub85c \uc2e0\ub8b0\ub41c \uc778\uc99d \uae30\uad00\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SESSION_NOT_FOUND=\ud074\ub77c\uc774\uc5b8\ud2b8\uc758 SSL \uc138\uc158 ID\uac00 \uc11c\ubc84 \uce21 \uc138\uc158 \uce90\uc2dc\uc5d0\uc11c \ubc1c\uacac \ub418\uc9c0\uc54a\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_DECRYPTION_FAILED_ALERT=\uc0c1\ub300\ubc29\uc774 \ubc1b\uc544\uac04 SSL \ub808\ucf54\ub4dc \ubcf5\ud638\ud654\ub97c \ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RECORD_OVERFLOW_ALERT=\uc0c1\ub300\ubc29\uc774 \ub354\ub294 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 SSL \ub808\ucf54\ub4dc\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNKNOWN_CA_ALERT=\uc0c1\ub300\ubc29\uc774 \uc0ac\uc6a9\uc790 \uc778\uc99d\uc11c\ub97c \ubc1c\uae09\ud55c \uc778\uc99d \uae30\uad00 (CA)\ub97c \uc778\uc2dd\ud558\uc9c0 \ubabb\ud574 \uc2e0\ub8b0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_ACCESS_DENIED_ALERT=\uc0c1\ub300\ubc29\uc774 \uc720\ud6a8\ud55c \uc778\uc99d\uc11c\ub97c \ubc1b\uc558\uc9c0\ub9cc \uc811\uadfc\uc774 \uac70\uc808\ub410\uc2b5\ub2c8\ub2e4.
SSL_ERROR_DECODE_ERROR_ALERT=\uc0c1\ub300\ubc29\uc774 SSL \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubcf5\ud638\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SSL_ERROR_DECRYPT_ERROR_ALERT=\uc0c1\ub300\ubc29\uc774 \uc11c\uba85 \uac80\uc99d \ub610\ub294 \ud0a4 \uad50\ud658 \uc2e4\ud328\ub97c \ubcf4\uace0\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=\uc0c1\ub300\ubc29\uc774 \uc218\ucd9c \uaddc\uc57d\uc5d0 \ub530\ub974\uc9c0 \uc54a\ub294 \ud611\uc0c1\uc744 \ubcf4\uace0\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_PROTOCOL_VERSION_ALERT=\uc0c1\ub300\ubc29\uc774 \ud638\ud658\ub418\uc9c0 \uc54a\uac70\ub098 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \ud504\ub85c\ud1a0\ucf5c \ubc84\uc804\uc744 \ubcf4\uace0\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=\uc11c\ubc84\uac00 \ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \uc9c0\uc6d0\ud558\ub294 \uc554\ud638\uae30\ubcf4\ub2e4 \ub354 \ubcf4\uc548\uc131\uc774 \ub192\uc740 \uc554\ud638\uae30\ub97c \uc694\uad6c\ud569\ub2c8\ub2e4.
SSL_ERROR_INTERNAL_ERROR_ALERT=\uc0c1\ub300\ubc29\uc774 \ub0b4\ubd80 \uc624\ub958\uc5d0 \uc9c1\uba74\ud588\ub2e4\uace0 \ubcf4\uace0\ud569\ub2c8\ub2e4.
SSL_ERROR_USER_CANCELED_ALERT=\uc0c1\ub300\ubc29 \uc0ac\uc6a9\uc790\uac00 \uad50\ud658\ub97c \ucde8\uc18c\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NO_RENEGOTIATION_ALERT=\uc0c1\ub300\ubc29\uc774 SSL \ubcf4\uc548 \ub9e4\uac1c\ubcc0\uc218\uc758 \uc7ac\ud611\uc0c1\uc744 \ud5c8\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=SSL \uc11c\ubc84 \uce90\uc2dc\uac00 \uc124\uc815 \ub418\uc9c0\uc54a\uc544\uc11c \uc774 \uc18c\ucf13\uc5d0 \ub300\ud574\uc11c\ub9cc\uc740 \uc0ac\uc6a9\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=SSL \uc0c1\ub300 \uce21\uc774 \uc694\uccad\ud55c TLS Hello \ud655\uc7a5\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=SSL \uc0c1\ub300 \uce21\uc774 \uc81c\uacf5\ud55c URL\uc5d0\uc11c \uc778\uc99d\uc11c\ub97c \uc5bb\uc744 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=SSL \uc0c1\ub300 \uce21\uc774 \uc694\uccad\ud55c DNS \uc774\ub984\uc5d0 \ub300\ud55c \uc778\uc99d\uc11c\ub97c \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=SSL \uc0c1\ub300 \uce21\uc774 \ud574\ub2f9 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c OCSP \uc751\ub2f5\uc744 \ubc1b\uc9c0 \ubabb\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=SSL \uc0c1\ub300 \uce21\uc774 \uc190\uc0c1\ub41c \uc778\uc99d\uc11c \ud574\uc26c \uac12\uc744 \ubcf4\uace0\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL\uc5d0\uc11c \uc54c \uc218 \uc5c6\ub294 \uc0c8 \uc138\uc158  \uc554\ud638 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL\uc5d0\uc11c \ubcc0\uc870\ub41c \uc0c8 \uc138\uc158 \uc554\ud638 \uad50\ud658 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL\uc5d0\uc11c \uc555\ucd95\ub418\uc5c8\uc73c\ub098 \uc555\ucd95\uc744 \ud480 \uc218 \uc5c6\ub294 \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=\ub370\uc774\ud130 \uc7ac\uad50\ud658\uc740 \ud604\uc7ac SSL \uc18c\ucf13\uc5d0\uc11c \ud5c8\uac00\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_UNSAFE_NEGOTIATION=\uc0c1\ub300\ubc29\uc774 \ucde8\uc57d\uc810\uc774 \ub9ce\uc740 \uc608\uc804 \ubc29\uc2dd\uc73c\ub85c \uba54\uc2dc\uc9c0 \uad50\ud658\uc744 \uc694\uccad\ud588\uc2b5\ub2c8\ub2e4.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL\uc5d0\uc11c \uc54c \uc218 \uc5c6\ub294 \uc555\ucd95 \uc815\ubcf4\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL\uc5d0\uc11c \uc11c\ubc84\ud0a4 \uba54\uc2dc\uc9c0 \uad50\ud658 \ub3c4\uc911 \uc57d\ud55c Diffie-Hellman\ud0a4\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 NPN \ud655\uc7a5 \ub370\uc774\ud130\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=SSL\uae30\ub2a5\uc740 SSL 2.0 \uc5f0\uacb0\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=SSL \uae30\ub2a5\uc740 \uc11c\ubc84\ub97c \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=SSL \uae30\ub2a5\uc740 \ud074\ub77c\uc774\uc5b8\ud2b8\ub97c \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=\ubcf4\uc548 \ud5c8\uac00\ub97c \ub0b4\uc8fc\ub294 \ub3d9\uc548 I/O \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_LIBRARY_FAILURE=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac \uace0\uc7a5\uc785\ub2c8\ub2e4.
SEC_ERROR_BAD_DATA=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc190\uc0c1\ub41c \ub370\uc774\ud130\ub97c \ubc1b\uc558\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OUTPUT_LEN=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \ucd9c\ub825 \uae38\uc774 \uc624\ub958\uc785\ub2c8\ub2e4.
SEC_ERROR_INPUT_LEN=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\uac00 \uc785\ub825 \uae38\uc774 \uc624\ub958\uc5d0 \uc9c1\uba74\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_INVALID_ARGS=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc778\uc218\uc785\ub2c8\ub2e4.
SEC_ERROR_INVALID_ALGORITHM=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc54c\uace0\ub9ac\ub4ec\uc785\ub2c8\ub2e4.
SEC_ERROR_INVALID_AVA=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 AVA\uc785\ub2c8\ub2e4.
SEC_ERROR_INVALID_TIME=\uc801\uc808\ud558\uc9c0 \uc54a\uc740 \ud615\uc2dd\uc758 \uc2dc\uac04 \ubb38\uc790\uc5f4\uc785\ub2c8\ub2e4.
SEC_ERROR_BAD_DER=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc801\uc808\ud558\uc9c0 \uc54a\uc740 \ud615\uc2dd\uc758 DER-\uc778\ucf54\ub529 \uba54\uc2dc\uc9c0\uc785\ub2c8\ub2e4.
SEC_ERROR_BAD_SIGNATURE=\uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc11c\uba85\uc744 \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_EXPIRED_CERTIFICATE=\uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c\uac00 \ub9cc\ub8cc \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_REVOKED_CERTIFICATE=\uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c\uac00 \ud3d0\uae30 \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_ISSUER=\uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c \ubc1c\uae09\uc790\uac00 \uc778\uc2dd\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_KEY=\uc0c1\ub300\ubc29\uc758 \uacf5\uac1c\ud0a4\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_PASSWORD=\uc785\ub825\ud55c \ubcf4\uc548 \uc554\ud638\uac00 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_RETRY_PASSWORD=\uc785\ub825\ud55c \uc0c8 \uc554\ud638\uac00 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \ub2e4\uc2dc \uc785\ub825\ud558\uc2ed\uc2dc\uc624.
SEC_ERROR_NO_NODELOCK=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \ub178\ub4dc\uc7a0\uae40\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_DATABASE=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc190\uc0c1\ub41c \uc800\uc7a5\uc18c\uc785\ub2c8\ub2e4.
SEC_ERROR_NO_MEMORY=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uba54\ubaa8\ub9ac \ud560\ub2f9 \uc2e4\ud328\uc785\ub2c8\ub2e4.
SEC_ERROR_UNTRUSTED_ISSUER=\uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c \ubc1c\uae09\uc790\uac00 \uc0ac\uc6a9\uc790\uc5d0 \uc758\ud574 \uc2e0\ub8b0 \ub418\uc9c0 \uc54a\uc74c\uc73c\ub85c \ud45c\uc2dc \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNTRUSTED_CERT=\uc0c1\ub300\ubc29\uc758 \uc778\uc99d\uc11c\uac00 \uc0ac\uc6a9\uc790\uc5d0 \uc758\ud574 \uc2e0\ub8b0 \ub418\uc9c0 \uc54a\uc74c\uc73c\ub85c \ud45c\uc2dc \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_DUPLICATE_CERT=\uc778\uc99d\uc11c\uac00 \uc774\ubbf8 \uc800\uc7a5\uc18c\uc5d0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_DUPLICATE_CERT_NAME=\ub2e4\uc6b4\ub85c\ub4dc\ud55c \uc778\uc99d\uc11c\uc758 \uc774\ub984\uc774 \uc800\uc7a5\uc18c\uc5d0 \uc788\ub294 \uac83\uacfc \uc911\ubcf5\ub429\ub2c8\ub2e4.
SEC_ERROR_ADDING_CERT=\uc800\uc7a5\uc18c\uc5d0 \uc778\uc99d\uc11c\ub97c \ucd94\uac00\ud558\ub294\ub370 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_FILING_KEY=\uc774 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \ud0a4\ub97c \ub2e4\uc2dc \uc815\ub9ac\ud558\ub294\ub370 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_NO_KEY=\uc774 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \uac1c\uc778\ud0a4\uac00 \ud0a4 \uc800\uc7a5\uc18c\uc5d0\uc11c \ubc1c\uacac\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_VALID=\uc774 \uc778\uc99d\uc11c\ub294 \uc720\ud6a8\ud569\ub2c8\ub2e4.
SEC_ERROR_CERT_NOT_VALID=\uc774 \uc778\uc99d\uc11c\ub294 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_NO_RESPONSE=\uc778\uc99d\uc11c \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc751\ub2f5 \uc5c6\uc74c
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=\uc778\uc99d\uc11c \ubc1c\uae09\uc790\uc758 \uc778\uc99d\uc11c\uac00 \ub9cc\ub8cc\ub410\uc2b5\ub2c8\ub2e4. \uc2dc\uc2a4\ud15c \ub0a0\uc9dc\uc640 \uc2dc\uac04\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
SEC_ERROR_CRL_EXPIRED=\uc778\uc99d\uc11c \ubc1c\uae09\uc790\uc5d0 \ub300\ud55c CRL\uc774 \ub9cc\ub8cc\ub410\uc2b5\ub2c8\ub2e4. \ud574\ub2f9 CRL\uc744 \uc5c5\ub370\uc774\ud2b8\ud558\uac70\ub098 \uc2dc\uc2a4\ud15c \ub0a0\uc9dc\uc640 \uc2dc\uac04\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
SEC_ERROR_CRL_BAD_SIGNATURE=\uc778\uc99d\uc11c \ubc1c\uae09\uc790\uc5d0 \ub300\ud55c CRL\uc774 \uc720\ud6a8\ud558\uc9c0\uc54a\uc740 \uc11c\uba85\uc744 \uac00\uc9c0\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_INVALID=\uc0c8\ub85c\uc6b4 CRL\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ud615\uc2dd\uc73c\ub85c \ub418\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_EXTENSION_VALUE_INVALID=\uc778\uc99d\uc11c \ud655\uc7a5 \uac12\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_EXTENSION_NOT_FOUND=\uc778\uc99d\uc11c \ud655\uc7a5\uc774 \ubc1c\uacac\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CA_CERT_INVALID=\ubc1c\uae09\uc790 \uc778\uc99d\uc11c\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=\uc778\uc99d\uc11c \uacbd\ub85c \uae38\uc774 \uc81c\uc57d\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_USAGES_INVALID=\uc778\uc99d\uc11c \uc6a9\ub3c4 \ud544\ub4dc\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_INTERNAL_ONLY=**\ub0b4\ubd80 \uc804\uc6a9 \ubaa8\ub4c8**
SEC_ERROR_INVALID_KEY=\ud0a4\uac00 \uc694\uccad\ud55c \uc791\uc5c5\uc744 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=\uc778\uc99d\uc11c\uac00 \uc54c \uc218 \uc5c6\ub294 \uacb0\uc815\uc801 \ud655\uc7a5\uc744 \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OLD_CRL=\uc0c8 CRL\uc774 \ud604\uc7ac CRL\ubcf4\ub2e4 \ucd5c\uc2e0\uc774 \uc544\ub2d9\ub2c8\ub2e4.
SEC_ERROR_NO_EMAIL_CERT=\uc554\ud638\ud654\ub418\uac70\ub098 \uc11c\uba85\ub418\uc9c0 \uc54a\uc74c\: \uc804\uc790 \uba54\uc77c \uc778\uc99d\uc11c\ub97c \uc544\uc9c1 \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=\uc554\ud638\ud654\ub418\uc9c0 \uc54a\uc74c\: \uac01\uac01\uc758 \ubc1b\ub294 \uc0ac\ub78c\uc5d0 \ub300\ud55c \uc778\uc99d\uc11c\ub97c \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_NOT_A_RECIPIENT=\ubcf5\ud638\ud654\ud560 \uc218 \uc5c6\uc74c\: \uc0ac\uc6a9\uc790\uac00 \ubc1b\ub294 \uc0ac\ub78c\uc774 \uc544\ub2c8\uac70\ub098 \uc77c\uce58\ud558\ub294 \uc778\uc99d\uc11c\uc640 \uac1c\uc778\ud0a4\ub97c \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=\ubcf5\ud638\ud654\ud560 \uc218 \uc5c6\uc74c\: \ud0a4 \uc554\ud638\ud654 \uc54c\uace0\ub9ac\ub4ec\uc774 \uc0ac\uc6a9\uc790 \uc778\uc99d\uc11c\uc640 \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS7_BAD_SIGNATURE=\uc11c\uba85 \uac80\uc99d \uc2e4\ud328\: \ubc1c\uacac\ub41c \uc11c\uba85\uc790\uac00 \uc5c6\uac70\ub098, \uc11c\uba85\uc790\uac00 \ub108\ubb34 \ub9ce\uac70\ub098, \ubd80\uc801\ud569\ud558\uac70\ub098 \ud6fc\uc190\ub41c \ub370\uc774\ud130\uc785\ub2c8\ub2e4.
SEC_ERROR_UNSUPPORTED_KEYALG=\uc9c0\uc6d0\ud558\uc9c0 \uc54a\uac70\ub098 \uc54c \uc218 \uc5c6\ub294 \ud0a4 \uc54c\uace0\ub9ac\ub4ec\uc785\ub2c8\ub2e4.
SEC_ERROR_DECRYPTION_DISALLOWED=\ubcf5\ud638\ud654\ud560 \uc218 \uc5c6\uc74c\: \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc740 \uc54c\uace0\ub9ac\ub4ec \ub610\ub294 \ud0a4 \ud06c\uae30\ub97c \uc0ac\uc6a9\ud558\uc5ec \uc554\ud638\ud654 \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
XP_SEC_FORTEZZA_BAD_CARD=Fortezza \uce74\ub4dc\uac00 \uc62c\ubc14\ub974\uac8c \ucd08\uae30\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.  \uc7a5\uce58\ub85c\ubd80\ud130 \uc81c\uac70\ud55c \ub2e4\uc74c \ubc1c\uae09\uc790\uc5d0\uac8c \ub3c4\uc6c0\uc744 \uc694\uccad\ud558\uc2ed\uc2dc\uc624.
XP_SEC_FORTEZZA_NO_CARD=\ubc1c\uacac\ub41c Fortezza \uce74\ub4dc \uc5c6\uc74c
XP_SEC_FORTEZZA_NONE_SELECTED=\uc120\ud0dd\ud55c Fortezza \uce74\ub4dc \uc5c6\uc74c
XP_SEC_FORTEZZA_MORE_INFO=\ub2e4\uc74c\uc5d0 \ub300\ud55c \uc815\ubcf4\ub97c \ub354 \uc5bb\uc73c\ub824\uba74 \uc2e0\uc0c1 \uc815\ubcf4\ub97c \uc120\ud0dd
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=\uc2e0\uc0c1 \uc815\ubcf4\uac00 \ubc1c\uacac\ub418\uc9c0 \uc54a\uc74c
XP_SEC_FORTEZZA_NO_MORE_INFO=\ud574\ub2f9 \uc2e0\uc0c1 \uc815\ubcf4\uac00 \ub354\ub294 \uc5c6\uc74c
XP_SEC_FORTEZZA_BAD_PIN=\uc720\ud6a8\ud558\uc9c0\uc54a\uc740 PIN
XP_SEC_FORTEZZA_PERSON_ERROR=Fortezza \uc2e0\uc0c1 \uc815\ubcf4\ub97c \ucd08\uae30\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_NO_KRL=\uc774 \uc0ac\uc774\ud2b8\uc758 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c KRL\uc774 \ubc1c\uacac\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_KRL_EXPIRED=\uc774 \uc0ac\uc774\ud2b8\uc758 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c KRL\uc774 \ub9cc\ub8cc\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_KRL_BAD_SIGNATURE=\uc774 \uc0ac\uc774\ud2b8\uc758 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c KRL\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \uc11c\uba85\uc744 \uac00\uc9c0\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_REVOKED_KEY=\uc774 \uc0ac\uc774\ud2b8\uc758 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \ud0a4\uac00 \ud3d0\uae30\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_KRL_INVALID=\uc0c8 KRL\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ud615\uc2dd\uc785\ub2c8\ub2e4.
SEC_ERROR_NEED_RANDOM=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \ub09c\uc218 \ub370\uc774\ud130\uac00 \ud544\uc694\ud569\ub2c8\ub2e4.
SEC_ERROR_NO_MODULE=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc694\uccad\ub41c \uc791\uc5c5\uc744 \uc218\ud589\ud560 \uc218 \uc788\ub294 \ubcf4\uc548 \ubaa8\ub4c8\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_NO_TOKEN=\ubcf4\uc548 \uce74\ub4dc\ub098 \ud1a0\ud070\uc774 \uc874\uc7ac\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ucd08\uae30\ud654\uac00 \ud544\uc694\ud558\uac70\ub098, \uc81c\uac70\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_READ_ONLY=\ubcf4\uc548 \ub77c\uc774\ube0c\ub7ec\ub9ac\: \uc77d\uae30 \uc804\uc6a9 \uc800\uc7a5\uc18c\uc785\ub2c8\ub2e4.
SEC_ERROR_NO_SLOT_SELECTED=\uc2ac\ub86f \ub610\ub294 \ud1a0\ud070\uc774 \uc120\ud0dd\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_NICKNAME_COLLISION=\uac19\uc740 \ubcc4\uba85\uc758 \uc778\uc99d\uc11c\uac00 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
SEC_ERROR_KEY_NICKNAME_COLLISION=\uac19\uc740 \ubcc4\uba85\uc758 \ud0a4\uac00 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
SEC_ERROR_SAFE_NOT_CREATED=\uc548\uc804 \uac1d\uccb4\ub97c \uc0dd\uc131\ud558\ub294 \ub3d9\uc548 \uc624\ub958
SEC_ERROR_BAGGAGE_NOT_CREATED=\uc218\ud654\ubb3c \uac1d\uccb4\ub97c \uc0dd\uc131\ud558\ub294 \ub3d9\uc548 \uc624\ub958
XP_JAVA_REMOVE_PRINCIPAL_ERROR=\ub300\ud45c\ub97c \uc81c\uac70\ud560 \uc218 \uc5c6\uc74c
XP_JAVA_DELETE_PRIVILEGE_ERROR=\ud2b9\ubcc4 \uad8c\ud55c\uc744 \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc74c
XP_JAVA_CERT_NOT_EXISTS_ERROR=\uc774 \ub300\ud45c\ub294 \uc778\uc99d\uc11c\ub97c \uac00\uc9c0\uace0 \uc788\uc9c0 \uc54a\uc74c
SEC_ERROR_BAD_EXPORT_ALGORITHM=\uc694\uad6c\ub418\ub294 \uc54c\uace0\ub9ac\ub4ec\uc774 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_EXPORTING_CERTIFICATES=\uc778\uc99d\uc11c\ub97c \ub0b4\ubcf4\ub0b4\ub824\ud558\ub294 \ub3d9\uc548 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_IMPORTING_CERTIFICATES=\uc778\uc99d\uc11c\ub97c \uac00\uc838\uc624\ub824\ud558\ub294 \ub3d9\uc548 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_DECODING_PFX=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ubcf5\ud638\ud654 \uc624\ub958\uc785\ub2c8\ub2e4.  \ud30c\uc77c\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_INVALID_MAC=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 MAC\uc785\ub2c8\ub2e4.  \ud2c0\ub9b0 \uc554\ud638 \ub610\ub294 \ud6fc\uc190\ub41c \ud30c\uc77c\uc785\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  MAC \uc54c\uace0\ub9ac\ub4ec\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc554\ud638 \ubb34\uacb0\uc131\uacfc \uc0ac\uc801 \uae30\ubc00 \ubaa8\ub4dc\ub9cc \uc9c0\uc6d0\ub429\ub2c8\ub2e4.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ud30c\uc77c \uad6c\uc870\uac00 \ud6fc\uc190\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc554\ud638\ud654 \uc54c\uace0\ub9ac\ub4ec\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ud30c\uc77c \ubc84\uc804\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ud2c0\ub9b0 \uc0ac\uc801 \uae30\ubc00 \uc554\ud638\uc785\ub2c8\ub2e4.
SEC_ERROR_PKCS12_CERT_COLLISION=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uac19\uc740 \ubcc4\uba85\uc774 \uc800\uc7a5\uc18c\uc5d0 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
SEC_ERROR_USER_CANCELLED=\uc0ac\uc6a9\uc790\uac00 \ucde8\uc18c\ub97c \ub20c\ub838\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_DUPLICATE_DATA=\uac00\uc838\uc624\uc9c0 \uc54a\uc74c, \uc800\uc7a5\uc18c\uc5d0 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
SEC_ERROR_MESSAGE_SEND_ABORTED=\uba54\uc2dc\uc9c0\ub97c \ubcf4\ub0b4\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
SEC_ERROR_INADEQUATE_KEY_USAGE=\uc778\uc99d\uc11c \ud0a4 \uc6a9\ub3c4\uac00 \uc2dc\ub3c4\ub41c \uc791\uc5c5\uc5d0 \uc801\ud569\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_INADEQUATE_CERT_TYPE=\ud574\ub2f9 \uc778\uc99d\uc11c \uc720\ud615\uc744 \ud504\ub85c\uadf8\ub7a8\uc774 \ubc1b\uc544\ub4e4\uc77c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_ADDR_MISMATCH=\uc11c\uba85 \uc778\uc99d\uc11c\uc5d0 \ub4e4\uc5b4\uc788\ub294 \uc8fc\uc18c\uac00 \uba54\uc2dc\uc9c0 \ud574\ub354\uc758 \uc8fc\uc18c\uc640 \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uac1c\uc778\ud0a4\ub97c \uac00\uc838\uc624\ub294 \ub3d9\uc548 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc778\uc99d\uc11c \uccb4\uc778\uc744 \uac00\uc838\uc624\ub294 \ub3d9\uc548 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=\ub0b4\ubcf4\ub0bc \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ubcc4\uba85\uc73c\ub85c \uc778\uc99d\uc11c \ub610\ub294 \ud0a4\ub97c \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=\ub0b4\ubcf4\ub0bc \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uac1c\uc778\ud0a4\ub294 \uc9c0\uc815\ud558\uac70\ub098 \ub0b4\ubcf4\ub0bc \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=\ub0b4\ubcf4\ub0bc \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ub0b4\ubcf4\ub0b4\uae30 \ud30c\uc77c\uc744 \uc4f8 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_UNABLE_TO_READ=\uac00\uc838\uc62c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uac00\uc838\uc624\uae30 \ud30c\uc77c\uc744 \uc77d\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=\ub0b4\ubcf4\ub0bc \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ud0a4 \uc800\uc7a5\uc18c\uac00 \ud6fc\uc190\ub418\uac70\ub098 \uc0ad\uc81c\ub410\uc2b5\ub2c8\ub2e4.
SEC_ERROR_KEYGEN_FAIL=\uacf5\uac1c/\uac1c\uc778\ud0a4 \uc30d\uc744 \uc0dd\uc131\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_INVALID_PASSWORD=\uc785\ub825\ud55c \uc554\ud638\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.  \ub2e4\ub978 \uac83\uc744 \uace8\ub77c\ubcf4\uc2ed\uc2dc\uc624.
SEC_ERROR_RETRY_OLD_PASSWORD=\uc785\ub825\ud55c \uc774\uc804 \uc554\ud638\uac00 \ud2c0\ub838\uc2b5\ub2c8\ub2e4.  \ub2e4\uc2dc \uc785\ub825\ud574\uc8fc\uc2ed\uc2dc\uc624.
SEC_ERROR_BAD_NICKNAME=\uc778\uc99d\uc11c \ubcc4\uba85\uc774 \uc774\ubbf8 \uc0ac\uc6a9 \uc911\uc785\ub2c8\ub2e4.
SEC_ERROR_NOT_FORTEZZA_ISSUER=\uc0c1\ub300\ubc29 FORTEZZA \uccb4\uc778\uc774 FORTEZZA \uc778\uc99d\uc11c\uac00 \uc544\ub2cc \uac83\uc744 \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=\uc911\uc694\ud55c \ud0a4\ub294 \ud544\uc694\ub85c\ud558\ub294 \uc2ac\ub86f\uc73c\ub85c \uc774\ub3d9\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_JS_INVALID_MODULE_NAME=\uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ubaa8\ub4c8 \uc774\ub984\uc785\ub2c8\ub2e4.
SEC_ERROR_JS_INVALID_DLL=\uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ubaa8\ub4c8 \uacbd\ub85c/\ud30c\uc77c\uc774\ub984
SEC_ERROR_JS_ADD_MOD_FAILURE=\ubaa8\ub4c8\uc744 \ucd94\uac00\ud560 \uc218 \uc5c6\uc74c
SEC_ERROR_JS_DEL_MOD_FAILURE=\ubaa8\ub4c8\uc744 \uc0ad\uc81c\ud560 \uc218 \uc5c6\uc74c
SEC_ERROR_OLD_KRL=\uc0c8 KRL\uc774 \ud604\uc7ac \uac83\ubcf4\ub2e4 \ucd5c\uc2e0\uc774 \uc544\ub2d9\ub2c8\ub2e4.
SEC_ERROR_CKL_CONFLICT=\uc0c8 CKL\uc740 \ud604\uc7ac CKL\uacfc\ub294 \ub2e4\ub978 \ubc1c\uae09\uc790\ub97c \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.  \ud604\uc7ac CKL\uc744 \uc0ad\uc81c\ud558\uc2ed\uc2dc\uc624.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=\uc774 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \uc778\uc99d \uae30\uad00\uc740 \uc774 \uc774\ub984\uc73c\ub85c \uc778\uc99d\uc11c \ubc1c\uae09\uc744 \ud5c8\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_KRL_NOT_YET_VALID=\uc774 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \ud0a4 \ud3d0\uae30 \ubaa9\ub85d\uc740 \uc544\uc9c1 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_NOT_YET_VALID=\uc774 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \uc778\uc99d\uc11c \ud3d0\uae30 \ubaa9\ub85d\uc774 \uc544\uc9c1 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_CERT=\uc694\uccad\ub41c \uc778\uc99d\uc11c\uac00 \ubc1c\uacac\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_SIGNER=\uc11c\uba85\uc790\uc758 \uc778\uc99d\uc11c\uac00 \ubc1c\uacac\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=\uc778\uc99d\uc11c \uc0c1\ud0dc \uc11c\ubc84\uc758 \uc704\uce58\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ud615\uc2dd\uc73c\ub85c \ub418\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=OCSP \uc751\ub2f5\uc774 \uc644\uc804\ud788 \ubcf5\ud638\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4. \uc54c \uc218 \uc5c6\ub294 \uc720\ud615\uc785\ub2c8\ub2e4.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=OCSP \uc11c\ubc84\uac00 \ucc98\ub9ac\ud560 \uc218 \uc5c6\ub294/\uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 HTTP \ub370\uc774\ud130\ub97c \ubc18\ud658\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_MALFORMED_REQUEST=OCSP \uc11c\ubc84\uac00 \ud6fc\uc190\ub418\uac70\ub098 \uc801\uc808\ud558\uc9c0 \uc54a\uac8c \ud615\uc2dd\ud654\ub41c \uc694\uccad\uc744 \ubc1c\uacac\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_SERVER_ERROR=OCSP \uc11c\ubc84\uac00 \ub0b4\ubd80 \uc624\ub958\uc5d0 \uc9c1\uba74\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_TRY_SERVER_LATER=OCSP \uc11c\ubc84\uac00 \ub098\uc911\uc5d0 \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uae30\ub97c \uad8c\ud569\ub2c8\ub2e4.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=OCSP \uc11c\ubc84\uac00 \uc774 \uc694\uccad\uc5d0 \ub300\ud55c \uc11c\uba85\uc744 \uc694\uad6c\ud569\ub2c8\ub2e4.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=OCSP \uc11c\ubc84\uac00 \uc774 \uc694\uccad\uc744 \ud5c8\uac00\ub97c \ubc1b\uc9c0 \uc54a\uc740 \uac83\uc73c\ub85c \uac04\uc8fc\ud558\uace0 \uac70\uc808\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=OCSP \uc11c\ubc84\uac00 \uc778\uc2dd\ud560 \uc218 \uc5c6\ub294 \uc0c1\ud0dc\ub97c \ubc18\ud658\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_UNKNOWN_CERT=OCSP \uc11c\ubc84\uac00 \uc778\uc99d\uc11c\uc5d0 \ub300\ud55c \uc0c1\ud0dc\ub97c \uc720\uc9c0\ud558\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_NOT_ENABLED=\uc774 \uc791\uc5c5\uc744 \uc218\ud589\ud558\uae30 \uc804\uc5d0 \ubc18\ub4dc\uc2dc OCSP\ub97c \uc0ac\uc6a9\ud574\uc57c \ud569\ub2c8\ub2e4.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=\uc774 \uc791\uc5c5\uc744 \uc218\ud589\ud558\uae30 \uc804\uc5d0 OCSP \uae30\ubcf8 \uc751\ub2f5\uc790\ub97c \ubc18\ub4dc\uc2dc \uc124\uc815\ud574\uc57c \ud569\ub2c8\ub2e4.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=OCSP \uc11c\ubc84\ub85c\ubd80\ud130 \ubc1b\uc740 \uc751\ub2f5\uc774 \ud6fc\uc190\ub418\uac70\ub098 \uc801\uc808\ud558\uc9c0 \uc54a\uc740 \ud615\uc2dd\uc73c\ub85c \ub418\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=OCSP \uc751\ub2f5\uc758 \uc11c\uba85\uc790\ub294 \ud574\ub2f9 \uc778\uc99d\uc11c\uc5d0 \ub300\ud574 \uc0c1\ud0dc\ub97c \uc751\ub2f5\ud560 \uc218 \uc788\ub3c4\ub85d \ud5c8\uac00\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_FUTURE_RESPONSE=OCSP \uc751\ub2f5\uc740 \uc544\uc9c1 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4 (\ubbf8\ub798\uc758 \ub0a0\uc9dc\ub97c \uac00\ub9ac\ud0a4\uace0 \uc788\uc74c).
SEC_ERROR_OCSP_OLD_RESPONSE=OCSP \uc751\ub2f5\uc774 \ub0a0\uc9dc\uac00 \uc9c0\ub09c \uc815\ubcf4\ub97c \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_DIGEST_NOT_FOUND=CMS \ub610\ub294 PKCS \#7 \uc694\uc57d\uae30\uac00 \uc11c\uba85\ub41c \uba54\uc2dc\uc9c0\uc5d0\uc11c \ubc1c\uacac\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=CMS \ub610\ub294 PKCS \#7 \uba54\uc2dc\uc9c0 \uc720\ud615\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_MODULE_STUCK=\ubaa8\ub4c8\uc774 \uc544\uc9c1 \uc0ac\uc6a9 \uc911\uc774\uae30 \ub54c\ubb38\uc5d0 PKCS \#11 \ubaa8\ub4c8\uc744 \uc81c\uac70\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_TEMPLATE=ASN.1 \ub370\uc774\ud130\ub97c \ubcf5\ud638\ud654\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uc9c0\uc815\ud55c \ud15c\ud50c\ub9bf\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_NOT_FOUND=\uc77c\uce58\ud558\uc9c0 \uc54a\ub294 CRL\uc774 \ubc1c\uacac\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=\uc874\uc7ac\ud558\ub294 \uc778\uc99d\uc11c\ub85c\uc11c \uac19\uc740 \ubc1c\uae09\uc790/\uc2dc\ub9ac\uc5bc \ubc88\ud638\uc758 \uc778\uc99d\uc11c\ub97c \uac00\uc838\uc624\ub824\uace0\ud558\uace0 \uc788\uc73c\ub098, \uac00\uc838\uc62c \uc778\uc99d\uc11c\uac00 \uac19\uc740 \uc778\uc99d\uc11c\uac00 \uc544\ub2d9\ub2c8\ub2e4.
SEC_ERROR_BUSY=NSS\ub294 \ub04c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \uac1d\uccb4\uac00 \uc544\uc9c1 \uc0ac\uc6a9 \uc911\uc785\ub2c8\ub2e4.
SEC_ERROR_EXTRA_INPUT=DER-\uc778\ucf54\ub529\ub41c \uba54\uc2dc\uc9c0\uac00 \ucd94\uac00\ub85c \uc0ac\uc6a9\ub418\uc9c0 \uc54a\uc740 \ub370\uc774\ud130\ub97c \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=\uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \ud0c0\uc6d0 \uace1\uc120\uc785\ub2c8\ub2e4.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=\uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 \ud0c0\uc6d0 \uace1\uc120 \ud3ec\uc778\ud2b8 \ud615\uc2dd\uc785\ub2c8\ub2e4.
SEC_ERROR_UNRECOGNIZED_OID=\uc778\uc2dd\ub418\uc9c0 \uc54a\uc740 \uac1d\uccb4 \uc2dd\ubcc4\uc790\uc785\ub2c8\ub2e4.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=\uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 OCSP \uc11c\uba85 \uc778\uc99d\uc11c\uac00 OCSP \uc751\ub2f5\uc5d0 \ub4e4\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=\ubc1c\uae09\uc790\uc758 \uc778\uc99d\uc11c \ud3d0\uae30 \ubaa9\ub85d\uc5d0 \ub4e4\uc5b4\uc788\ub294 \uc778\uc99d\uc11c\uac00 \ud3d0\uae30\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=\ubc1c\uae09\uc790\uc758 OCSP \uc751\ub2f5\uc790\uac00 \uc778\uc99d\uc11c\uac00 \ud3d0\uae30 \ub418\uc5c8\uc74c\uc744 \ubcf4\uace0\ud569\ub2c8\ub2e4.
SEC_ERROR_CRL_INVALID_VERSION=\ubc1c\uae09\uc790\uc758 \uc778\uc99d\uc11c \ud3d0\uae30 \ubaa9\ub85d\uc5d0 \uc54c \uc218 \uc5c6\ub294 \ubc84\uc804 \ubc88\ud638\uac00 \ub4e4\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=\ubc1c\uae09\uc790\uc758 V1 \uc778\uc99d\uc11c \ud3d0\uae30 \ubaa9\ub85d\uc5d0 \uc784\uacc4 \ud655\uc7a5\uc774 \ub4e4\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=\ubc1c\uae09\uc790\uc758 V2 \uc778\uc99d\uc11c \ud3d0\uae30 \ubaa9\ub85d\uc5d0 \uc54c \uc218 \uc5c6\ub294 \uc784\uacc4 \ud655\uc7a5\uc774 \ub4e4\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=\uc54c \uc218 \uc5c6\ub294 \uac1d\uccb4 \uc720\ud615\uc774 \uc9c0\uc815 \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_INCOMPATIBLE_PKCS11=PKCS \#11 \ub4dc\ub77c\uc774\ubc84\uac00 \ud638\ud658\ub418\uc9c0 \uc54a\ub294 \ubc29\uc2dd\uc73c\ub85c \uae30\uc220\uc801 \uba85\uc138\ub97c \uc5b4\uae41\ub2c8\ub2e4.
SEC_ERROR_NO_EVENT=\ud604\uc7ac \uc0c8\ub85c\uc6b4 \uc2ac\ub86f \uc774\ubca4\ud2b8\uac00 \uc874\uc7ac\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL\uc774 \uc774\ubbf8 \uc874\uc7ac\ud569\ub2c8\ub2e4.
SEC_ERROR_NOT_INITIALIZED=NSS\uac00 \ucd08\uae30\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=PKCS \#11 \ud1a0\ud070\uc774 \ub85c\uadf8\uc778 \ub418\uc9c0 \uc54a\uc544 \uc791\uc5c5\uc774 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=\uc124\uc815\ub41c OCSP \uc751\ub2f5\uc790\uc758 \uc778\uc99d\uc11c\uac00 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OCSP_BAD_SIGNATURE=OCSP \uc751\ub2f5\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\ub294 \uc11c\uba85\uc744 \ud3ec\ud568\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=\uc778\uc99d\uc11c \uc720\ud6a8\uc131 \uac80\uc0ac \ud69f\uc218\uac00 \uc81c\ud55c\uc744 \ucd08\uacfc\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_INVALID_POLICY_MAPPING=\uc778\uc99d\uc11c \uc815\ucc45\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_POLICY_VALIDATION_FAILED=\uc778\uc99d\uc11c \uacc4\uce35\ubcc4 \uc815\ucc45\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=AIA \uc778\uc99d\uc11c \ud655\uc7a5\uc758 \uc8fc\uc18c \ud615\uc2dd\uc744 \uc54c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_HTTP_RESPONSE=\uc11c\ubc84\uc758 HTTP \uc751\ub2f5\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_LDAP_RESPONSE=\uc11c\ubc84\uc758 LDAP \uc751\ub2f5\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_FAILED_TO_ENCODE_DATA=ASN1 \uc778\ucf54\ub354\ub85c \ub370\uc774\ud130 \ubcc0\ud658\uc774 \uc2e4\ud328\ud558\uc600\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=\uc778\uc99d\uc11c \ud655\uc7a5\uc758 \uc8fc\uc18c \uc815\ubcf4\uac00 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
SEC_ERROR_LIBPKIX_INTERNAL=\uc778\uc99d\uc11c \uc720\ud6a8\uc131 \ud655\uc778 \uc911 Libpkix \ub0b4\ubd80 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS11_GENERAL_ERROR=PKCS \#11 \ubaa8\ub4c8\uc5d0\uc11c CKR_GENERAL_ERROR\ub77c\ub294 \ud655\uc778\ud560 \uc218 \uc5c6\ub294 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_PKCS11_FUNCTION_FAILED=PKCS \#11 \ubaa8\ub4c8\uc5d0\uc11c CKR_FUNCTION_FAILED\ub77c\ub294 \uc694\uccad\ud55c \uae30\ub2a5\uc774 \uc2e4\ud589\ub418\uc9c0 \uc54a\uc558\uc74c\uc744 \uc9c0\uc2dc\ud558\ub294 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4. \ub2e4\uc2dc \ud55c\ubc88 \uc2e4\ud589\ud574 \ubcf4\uc2dc\uae30 \ubc14\ub78d\ub2c8\ub2e4.
SEC_ERROR_PKCS11_DEVICE_ERROR=PKCS \#11 \ubaa8\ub4c8\uc5d0\uc11c CKR_DEVICE_ERROR\ub77c\ub294 \ud1a0\ud070 \ubc0f \uc2ac\ub86f\uc5d0\uc11c \ubc1c\uc0dd\ud558\ub294 \uc624\ub958\uac00 \ubc1c\uc0dd\ud558\uc600\uc2b5\ub2c8\ub2e4.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=\uc778\uc99d\uc11c \ud655\uc7a5\uc5d0\uc11c \uc54c \uc218 \uc5c6\ub294 \uc815\ubcf4 \uc811\uadfc \uae30\ub2a5\uc774 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CRL_IMPORT_FAILED=\uc778\uc99d\uc11c \ud3d0\uae30 \ubaa9\ub85d(CRL)\uc744 \uac00\uc838 \uc624\ub294 \uc911 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
SEC_ERROR_EXPIRED_PASSWORD=\uc554\ud638\uac00 \ub9cc\ub8cc\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SEC_ERROR_LOCKED_PASSWORD=\uc554\ud638\uac00 \uc7a0\uacbc\uc2b5\ub2c8\ub2e4.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=\uc54c \uc218 \uc5c6\ub294 PKCS \#11 \uc624\ub958\uc785\ub2c8\ub2e4.
SEC_ERROR_BAD_CRL_DP_URL=\uc720\ud6a8\ud558\uc9c0 \uc54a\uac70\ub098 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\ub294 URL\uc774 CRL \ubc30\ud3ec \ub0b4\uc6a9\uc5d0 \uc788\uc2b5\ub2c8\ub2e4.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=\uc548\uc804\ud558\uc9c0 \uc54a\uc740 \uc774\uc720\ub85c \ud604\uc7ac \uc11c\uba85 \uc54c\uace0\ub9ac\uc998\uc73c\ub85c \uc11c\uba85\ub41c \uc778\uc99d\uc11c\ub97c \uc0ac\uc6a9 \uc911\uc9c0\ud558\uc600\uc2b5\ub2c8\ub2e4.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

