#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u0430 \u043a\u043e\u043c\u0443\u043d\u0438\u043a\u0430\u0446\u0438\u0458\u0430.  \u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u0432\u0430 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u0432\u0438\u0441\u043e\u043a\u0435 \u043a\u0430\u0442\u0435\u0433\u043e\u0440\u0438\u0458\u0435.
SSL_ERROR_US_ONLY_SERVER=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u0430 \u043a\u043e\u043c\u0443\u043d\u0438\u043a\u0430\u0446\u0438\u0458\u0430.  \u0414\u0440\u0443\u0433\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0437\u0430\u0445\u0442\u0435\u0432\u0430 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u0432\u0438\u0441\u043e\u043a\u0435 \u043a\u0430\u0442\u0435\u0433\u043e\u0440\u0438\u0458\u0435 \u043a\u043e\u0458\u0435 \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e.
SSL_ERROR_NO_CYPHER_OVERLAP=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u0430 \u043a\u043e\u043c\u0443\u043d\u0438\u043a\u0430\u0446\u0438\u0458\u0430 \u0441\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u0438\u043c \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u043e\u043c.  \u041d\u0435\u043c\u0430 \u0437\u0430\u0458\u0435\u0434\u043d\u0438\u0447\u043a\u0438\u0445 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c\u0430 \u0437\u0430 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435.
SSL_ERROR_NO_CERTIFICATE=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u0440\u043e\u043d\u0430\u045b\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0438\u043b\u0438 \u043a\u0459\u0443\u0447 \u043f\u043e\u0442\u0440\u0435\u0431\u0430\u043d \u0437\u0430 \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u043a\u0430\u0446\u0438\u0458\u0443.
SSL_ERROR_BAD_CERTIFICATE=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e \u043a\u043e\u043c\u0443\u043d\u0438\u0446\u0438\u0440\u0430\u0442\u0438 \u0441\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u0438\u043c \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u043e\u043c\: \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u043e\u0432 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d.
SSL_ERROR_UNUSED_5=Unrecognized SSL error code.
SSL_ERROR_BAD_CLIENT=\u0421\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u043d\u0430\u0438\u0448\u0430\u043e \u043d\u0430 \u043b\u043e\u0448\u0435 \u043f\u043e\u0434\u0430\u0442\u043a\u0435 \u043f\u043e\u0441\u043b\u0430\u0442\u0435 \u043e\u0434 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u0430.
SSL_ERROR_BAD_SERVER=\u041a\u043b\u0438\u0458\u0435\u043d\u0442 \u0458\u0435 \u043d\u0430\u0438\u0448\u0430\u043e \u043d\u0430 \u043b\u043e\u0448\u0435 \u043f\u043e\u0434\u0430\u0442\u043a\u0435 \u043e\u0434 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=\u041e\u0432\u0430 \u0432\u0440\u0441\u0442\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0430.
SSL_ERROR_UNSUPPORTED_VERSION=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u043d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e \u0438\u0437\u0434\u0430\u045a\u0435 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u043e\u0433 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0430.
SSL_ERROR_UNUSED_10=Unrecognized SSL error code.
SSL_ERROR_WRONG_CERTIFICATE=\u041f\u043e\u0442\u0432\u0440\u0452\u0438\u0432\u0430\u045a\u0435 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u043a\u0430 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e\: \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438 \u043a\u0459\u0443\u0447 \u0443 \u0431\u0430\u0437\u0438 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430 \u043e \u043a\u0459\u0443\u0447\u0435\u0432\u0438\u043c\u0430 \u043d\u0435 \u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430 \u0458\u0430\u0432\u043d\u043e\u043c \u043a\u0459\u0443\u0447\u0443 \u0443 \u0431\u0430\u0437\u0438 \u043f\u043e\u0442\u0432\u0440\u0434\u0430.
SSL_ERROR_BAD_CERT_DOMAIN=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u0430 \u043a\u043e\u043c\u0443\u043d\u0438\u043a\u0430\u0446\u0438\u0458\u0430 \u0441\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u0438\u043c \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u043e\u043c\: \u0442\u0440\u0430\u0436\u0435\u043d\u043e \u0438\u043c\u0435 \u0434\u043e\u043c\u0435\u043d\u0430 \u0441\u0435 \u043d\u0435 \u043f\u043e\u043a\u043b\u0430\u043f\u0430 \u0441\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u0432\u0438\u043c \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u043c.
SSL_ERROR_POST_WARNING=Unrecognized SSL error code.
SSL_ERROR_SSL2_DISABLED=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043f\u043e\u0434\u0440\u0436\u0430\u0432\u0430 \u0441\u0430\u043c\u043e \u0438\u0437\u0434\u0430\u045a\u0435 2 \u0421\u0421\u041b\u0430, \u043a\u043e\u0458\u0435 \u0458\u0435 \u043e\u0432\u0434\u0435 \u0438\u0441\u043a\u0459\u0443\u0447\u0435\u043d\u043e.
SSL_ERROR_BAD_MAC_READ=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u043e\u0433 \u0441\u0430 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0438\u043c \u043a\u043e\u0434\u043e\u043c \u0437\u0430 \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u043a\u0430\u0446\u0438\u0458\u0443 \u043f\u043e\u0440\u0443\u043a\u0435.
SSL_ERROR_BAD_MAC_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043f\u0440\u0438\u0458\u0430\u0432\u0459\u0443\u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u043a\u043e\u0434 \u0437\u0430 \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u043a\u0430\u0446\u0438\u0458\u0443 \u043f\u043e\u0440\u0443\u043a\u0435.
SSL_ERROR_BAD_CERT_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u0438 \u0432\u0430\u0448 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SSL_ERROR_REVOKED_CERT_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u0458\u0435 \u043e\u0434\u0431\u0438\u043e \u0412\u0430\u0448 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u0435\u0440 \u0458\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043e\u043f\u043e\u0437\u0432\u0430\u043d.
SSL_ERROR_EXPIRED_CERT_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u0458\u0435 \u043e\u0434\u0431\u0438\u043e \u0412\u0430\u0448 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u0435\u0440 \u0458\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0438\u0441\u0442\u0435\u043a\u0430\u043e.
SSL_ERROR_SSL_DISABLED=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u043e\u0432\u0435\u0437\u0430\u0442\u0438 \u0441\u0435\: \u0421\u0421\u041b \u0458\u0435 \u0438\u0441\u043a\u0459\u0443\u0447\u0435\u043d.
SSL_ERROR_FORTEZZA_PQG=\u041d\u0418\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u043e\u0432\u0435\u0437\u0430\u0442\u0438 \u0441\u0435\:  \u0443\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u0441\u0435 \u043d\u0430\u043b\u0430\u0437\u0438 \u0443 \u0434\u0440\u0443\u0433\u043e\u043c \u0444\u043e\u0440\u0442\u0435\u0446\u0430 \u0434\u043e\u043c\u0435\u043d\u0443 (FORTEZZA).
SSL_ERROR_UNKNOWN_CIPHER_SUITE=\u0422\u0440\u0430\u0436\u0435\u043d \u0458\u0435 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u043f\u0430\u043a\u0435\u0442 \u0448\u0438\u0444\u0430\u0440\u0430 \u0437\u0430 \u0421\u0421\u041b.
SSL_ERROR_NO_CIPHERS_SUPPORTED=\u041d\u0438\u0458\u0435\u0434\u0430\u043d \u043f\u0430\u043a\u0435\u0442 \u0448\u0438\u0444\u0430\u0440\u0430 \u043d\u0438\u0458\u0435 \u043f\u0440\u0438\u0441\u0443\u0442\u0430\u043d \u043d\u0438\u0442\u0438 \u0443\u043a\u0459\u0443\u0447\u0435\u043d \u0443 \u043e\u0432\u0430\u0458 \u043f\u0440\u043e\u0433\u0440\u0430\u043c.
SSL_ERROR_BAD_BLOCK_PADDING=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u043e\u0433 \u0441\u0430 \u043b\u043e\u0448\u043e\u043c \u043f\u043e\u043f\u0443\u043d\u043e\u043c \u0431\u043b\u043e\u043a\u0430 (padding).
SSL_ERROR_RX_RECORD_TOO_LONG=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u043e\u0433 \u043a\u043e\u0458\u0438 \u043f\u0440\u0435\u043c\u0430\u0448\u0443\u0458\u0435 \u043d\u0430\u0458\u0432\u0435\u045b\u0443 \u0434\u043e\u0437\u0432\u043e\u0459\u0435\u043d\u0443 \u0434\u0443\u0436\u0438\u043d\u0443.
SSL_ERROR_TX_RECORD_TOO_LONG=\u0421\u0421\u041b \u0458\u0435 \u043f\u043e\u043a\u0443\u0448\u0430\u043e \u0441\u043b\u0430\u045a\u0435 \u0441\u043b\u043e\u0433\u0430 \u043a\u043e\u0458\u0438 \u043f\u0440\u0435\u043c\u0430\u0448\u0443\u0458\u0435 \u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u043d\u0443 \u0434\u043e\u0437\u0432\u043e\u0459\u0435\u043d\u0443 \u0434\u0443\u0436\u0438\u043d\u0443.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u043e\u0432\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u0432\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0441\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u043c.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043a\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u0437\u0430\u0445\u0442\u0435\u0432 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043a\u0440\u0430\u0458 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u0430 \u0441\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0442\u0430\u0432\u043d\u0443 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u0441\u043a\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_RX_MALFORMED_FINISHED=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043a\u0440\u0430\u0458.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u0441\u043b\u043e\u0433 \u0437\u0430 \u043f\u0440\u043e\u043c\u0435\u043d\u0443 \u0441\u043f\u0435\u0446\u0438\u0444\u0438\u043a\u0430\u0446\u0438\u0458\u0435 \u0448\u0438\u0444\u0440\u0435.
SSL_ERROR_RX_MALFORMED_ALERT=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u0441\u043b\u043e\u0433 \u0437\u0430 \u0443\u0437\u0431\u0443\u043d\u0443.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u0441\u043b\u043e\u0433 \u0437\u0430 \u0441\u0443\u0441\u0440\u0435\u0442.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u0441\u043b\u043e\u0433 \u0437\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0441\u043a\u0435 \u043f\u043e\u0434\u0430\u0442\u043a\u0435.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u0441\u043a\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043a\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0441\u043a\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043a\u0443 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d \u0437\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043a\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043e\u043a\u043e\u043d\u0447\u0430\u045a\u0435 \u0440\u0430\u0434\u0430.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u0441\u043a\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_RX_UNEXPECTED_FINISHED=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043e\u043a\u043e\u043d\u0447\u0430\u045a\u0435.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u043f\u0440\u043e\u043c\u0435\u043d\u0443 \u0441\u043f\u0435\u0446\u0438\u0444\u0438\u043a\u0430\u0446\u0438\u0458\u0435 \u0448\u0438\u0444\u0440\u0435.
SSL_ERROR_RX_UNEXPECTED_ALERT=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0438 \u0441\u043b\u043e\u0433 \u0443\u0437\u0431\u0443\u043d\u0435.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0438 \u0441\u043b\u043e\u0433 \u0437\u0430 \u0441\u0443\u0441\u0440\u0435\u0442.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0438 \u0441\u043b\u043e\u0433 \u0441\u0430 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0441\u043a\u0438\u043c \u043f\u043e\u0434\u0430\u0446\u0438\u043c\u0430.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u043e\u0433 \u0441\u0430 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u043e\u043c \u0432\u0440\u0441\u0442\u043e\u043c \u0441\u0430\u0434\u0440\u0436\u0430\u0458\u0430.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043f\u043e\u0440\u0443\u043a\u0443 \u0437\u0430 \u0441\u0443\u0441\u0440\u0435\u0442 \u0441\u0430 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u043e\u043c \u0432\u0440\u0441\u0442\u043e\u043c \u043f\u043e\u0440\u0443\u043a\u0435.
SSL_ERROR_RX_UNKNOWN_ALERT=\u0421\u0421\u041b \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u043e\u0433 \u0437\u0430 \u0443\u0437\u0431\u0443\u043d\u0443 \u0441\u0430 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u0438\u043c \u043e\u043f\u0438\u0441\u043e\u043c \u0443\u0437\u0431\u0443\u043d\u0435.
SSL_ERROR_CLOSE_NOTIFY_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u0458\u0435 \u0437\u0430\u0442\u0432\u043e\u0440\u0438\u043e \u043e\u0432\u0443 \u0432\u0435\u0437\u0443.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0438\u0458\u0435 \u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043e \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u043a\u043e\u0458\u0443 \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0443\u0441\u043f\u0435\u0448\u043d\u043e \u0434\u0435\u043a\u043e\u043c\u043f\u0440\u0438\u043c\u0443\u0458\u0435 \u0441\u043b\u043e\u0433 \u0421\u0421\u041b\u0430 \u043a\u043e\u0458\u0438 \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043e \u0434\u0430 \u0443\u0433\u043e\u0432\u043e\u0440\u0438 \u043f\u0440\u0438\u0445\u0432\u0430\u0442\u0459\u0438\u0432 \u0441\u043a\u0443\u043f \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0438\u0445 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0430\u0440\u0430.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u0458\u0435 \u043e\u0434\u0431\u0438\u043e \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0435 \u043f\u043e\u0440\u0443\u043a\u0435 \u0443\u0441\u043b\u0435\u0434 \u043d\u0435\u043f\u0440\u0438\u0445\u0432\u0430\u0442\u0459\u0438\u0432\u043e\u0433 \u0441\u0430\u0434\u0440\u0436\u0430\u0458\u0430.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u0432\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0435 \u043e\u043d\u0435 \u0432\u0440\u0441\u0442\u0435 \u043a\u043e\u0458\u0430 \u043c\u0443 \u0458\u0435 \u043f\u043e\u0441\u043b\u0430\u0442\u0430.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=\u0420\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u0458\u0435 \u043d\u0430\u0438\u0448\u0430\u043e \u043d\u0430 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u043f\u0440\u043e\u0431\u043b\u0435\u043c \u0441\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u043c \u043a\u043e\u0433 \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e.
SSL_ERROR_GENERATE_RANDOM_FAILURE=\u0413\u0435\u043d\u0435\u0440\u0430\u0442\u043e\u0440 \u0441\u043b\u0443\u0447\u0430\u0458\u043d\u0438\u0445 \u0431\u0440\u043e\u0458\u0435\u0432\u0430 \u0437\u0430 \u0421\u0421\u041b \u0441\u0435 \u043f\u043e\u043a\u0432\u0430\u0440\u0438\u043e.
SSL_ERROR_SIGN_HASHES_FAILURE=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0434\u0438\u0433\u0438\u0442\u0430\u043b\u043d\u043e \u043f\u043e\u0442\u0438\u043f\u0441\u0430\u0442\u0438 \u043f\u043e\u0434\u0430\u0442\u043a\u0435 \u043f\u043e\u0442\u0440\u0435\u0431\u043d\u0435 \u0437\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u0443 \u0412\u0430\u0448\u0435\u0433 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=\u0421\u0421\u041b \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0438\u0437\u0432\u0443\u0447\u0435 \u0458\u0430\u0432\u043d\u0438 \u043a\u0459\u0443\u0447 \u0438\u0437 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=\u0414\u043e\u0448\u043b\u043e \u0458\u0435 \u0434\u043e \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u0435 \u0433\u0440\u0435\u0448\u043a\u0435 \u043f\u0440\u0438 \u043e\u0431\u0440\u0430\u0434\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043a\u043e\u0433 \u0421\u0421\u041b \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=\u0414\u043e\u0448\u043b\u043e \u0458\u0435 \u0434\u043e \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u0435 \u0433\u0440\u0435\u0448\u043a\u0435 \u043f\u0440\u0438 \u043e\u0431\u0440\u0430\u0434\u0438 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u0441\u043a\u043e\u0433 \u0421\u0421\u041b \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_ENCRYPTION_FAILURE=\u0410\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0437\u0430 \u0437\u0431\u0438\u0440\u043d\u043e \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043e \u0441\u0430 \u0438\u0437\u0430\u0431\u0440\u0430\u043d\u043e\u043c \u0441\u0432\u0438\u0442\u043e\u043c \u0448\u0438\u0444\u0430\u0440\u0430.
SSL_ERROR_DECRYPTION_FAILURE=\u0410\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0437\u0430 \u0437\u0431\u0438\u0440\u043d\u043e \u0434\u0435\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043e \u0441\u0430 \u0438\u0437\u0430\u0431\u0440\u0430\u043d\u043e\u043c \u0441\u0432\u0438\u0442\u043e\u043c \u0448\u0438\u0444\u0430\u0440\u0430.
SSL_ERROR_SOCKET_WRITE_FAILURE=\u041f\u043e\u043a\u0443\u0448\u0430\u0458 \u043f\u0438\u0441\u0430\u045a\u0430 \u043d\u0435\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u0438\u0445 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430 \u0443 \u043f\u043e\u0434\u0440\u0435\u0452\u0435\u043d\u0438 \u043f\u0440\u0438\u043a\u0459\u0443\u0447\u0430\u043a (socket) \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043e.
SSL_ERROR_MD5_DIGEST_FAILURE=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 \u0437\u0430 \u041c\u04145 \u0441\u0430\u0436\u0435\u0442\u0430\u043a \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u0430.
SSL_ERROR_SHA_DIGEST_FAILURE=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 \u0437\u0430 \u0441\u0430\u0436\u0435\u0442\u0430\u043a \u0421\u0425\u0410-1 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u0430.
SSL_ERROR_MAC_COMPUTATION_FAILURE=\u0420\u0430\u0447\u0443\u043d\u0430\u045a\u0435 \u041c\u0410\u0426\u0430 (MAC) \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=\u041d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e \u043a\u0440\u0435\u0438\u0440\u0430\u045a\u0435 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0437\u0430 \u0441\u0438\u043c\u0435\u0442\u0440\u0438\u0447\u043d\u0438 \u043a\u0459\u0443\u0447.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043e\u0434\u043c\u043e\u0442\u0430\u0442\u0438 \u0441\u0438\u043c\u0435\u0442\u0440\u0438\u0447\u043d\u0438 \u043a\u0459\u0443\u0447 \u0443 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u0441\u043a\u0435 \u043f\u043e\u0440\u0443\u043a\u0435 \u0437\u0430 \u0440\u0430\u0437\u043c\u0435\u043d\u0443 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=\u0421\u0435\u0440\u0432\u0435\u0440 \u0437\u0430 \u0421\u0421\u041b \u0458\u0435 \u043f\u043e\u043a\u0443\u0448\u0430\u043e \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u0430\u043c\u0435\u0440\u0438\u0447\u043a\u0438 \u0458\u0430\u0432\u043d\u0438 \u043a\u0459\u0443\u0447 \u0441\u0430 \u0438\u0437\u0432\u043e\u0437\u043d\u043e\u043c \u0441\u0432\u0438\u0442\u043e\u043c \u0448\u0438\u0444\u0430\u0440\u0430.
SSL_ERROR_IV_PARAM_FAILURE=\u041a\u041e\u0414 \u041f\u041a\u0426\u042111 (PKCS11) \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043e \u0434\u0430 \u043f\u0440\u0435\u0432\u0435\u0434\u0435 \u0418\u0412 (IV) \u0443 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0430\u0440.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=\u041d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u0430 \u0438\u043d\u0438\u0446\u0438\u0458\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0458\u0430 \u0438\u0437\u0430\u0431\u0440\u0430\u043d\u0435 \u0441\u0432\u0438\u0442\u0435 \u0448\u0438\u0444\u0430\u0440\u0430.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=\u041a\u043b\u0438\u0458\u0435\u043d\u0442 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043e \u0434\u0430 \u043d\u0430\u043f\u0440\u0430\u0432\u0438 \u0441\u0435\u0441\u0438\u0458\u0441\u043a\u0435 \u043a\u0459\u0443\u0447\u0435\u0432\u0435 \u0437\u0430 \u0441\u0435\u0441\u0438\u0458\u0443 \u0421\u0421\u041b\u0430.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=\u0421\u0435\u0440\u0432\u0435\u0440 \u043d\u0435\u043c\u0430 \u043a\u0459\u0443\u0447 \u0437\u0430 \u043f\u043e\u043a\u0443\u0448\u0430\u043d\u0438 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0440\u0430\u0437\u043c\u0435\u043d\u0435 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=\u041d\u043e\u0432\u0447\u0438\u045b \u0437\u0430 \u041f\u041a\u0426\u0421\#11 (PKCS\#11) \u0458\u0435 \u0443\u0431\u0430\u0447\u0435\u043d \u0438\u043b\u0438 \u0443\u043a\u043b\u043e\u045a\u0435\u043d \u0442\u043e\u043a\u043e\u043c \u0434\u0435\u0458\u0441\u0442\u0432\u0430.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=\u041d\u0438\u0458\u0435 \u043d\u0430\u0452\u0435\u043d \u043d\u0438\u0458\u0435\u0434\u0430\u043d \u043d\u043e\u0432\u0447\u0438\u045b \u0437\u0430 \u041f\u041a\u0426\u0421\#11 \u0437\u0430 \u0442\u0440\u0430\u0436\u0435\u043d\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e.
SSL_ERROR_NO_COMPRESSION_OVERLAP=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u0430 \u043a\u043e\u043c\u0443\u043d\u0438\u043a\u0430\u0446\u0438\u0458\u0430 \u0441\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u0438\u043c \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u043e\u043c\: \u043d\u0435\u043c\u0430 \u0437\u0430\u0458\u0435\u0434\u043d\u0438\u0447\u043a\u0438\u0445 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c\u0430 \u0437\u0430 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0443.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u043e\u043a\u0440\u0435\u043d\u0443\u0442\u0438 \u0458\u043e\u0448 \u0458\u0435\u0434\u0430\u043d \u0441\u0443\u0441\u0440\u0435\u0442 \u0437\u0430 \u0421\u0421\u041b \u0434\u043e\u043a \u0441\u0435 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u0438 \u0441\u0443\u0441\u0440\u0435\u0442 \u043d\u0435 \u0434\u043e\u0432\u0440\u0448\u0438.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=\u041f\u0440\u0438\u043c\u0459\u0435\u043d\u0435 \u0441\u0443 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0435 \u0432\u0440\u0435\u0434\u043d\u043e\u0441\u0442\u0438 \u0445\u0435\u0448\u0430 \u0441\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430.
SSL_ERROR_CERT_KEA_MISMATCH=\u0414\u0430\u0442\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0441\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0443\u043f\u043e\u0442\u0440\u0435\u0431\u0438\u0442\u0438 \u0437\u0430 \u0438\u0437\u0430\u0431\u0440\u0430\u043d\u0438 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0440\u0430\u0437\u043c\u0435\u043d\u0435 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=\u041d\u0438\u0458\u0435\u0434\u0430\u043d \u0430\u0443\u0442\u043e\u0440\u0438\u0442\u0435\u0442 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0435 \u043d\u0438\u0458\u0435 \u043e\u0434 \u043f\u043e\u0432\u0435\u0440\u0435\u045a\u0430 \u0437\u0430 \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u043a\u0430\u0446\u0438\u0458\u0443 \u043f\u0443\u0442\u0435\u043c \u0421\u0421\u041b\u0430 \u0441\u0430 \u043a\u043b\u0438\u0458\u0435\u043d\u0442\u043e\u043c.
SSL_ERROR_SESSION_NOT_FOUND=\u041a\u043b\u0438\u0458\u0435\u043d\u0442\u043e\u0432 \u0418\u0411 \u0437\u0430 \u0441\u0435\u0441\u0438\u0458\u0443 \u0421\u0421\u041b\u0430 \u043d\u0438\u0458\u0435 \u043d\u0430\u0452\u0435\u043d \u0443 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u0432\u043e\u043c \u043a\u0435\u0448\u0443 \u0437\u0430 \u0441\u0435\u0441\u0438\u0458\u0435.
SSL_ERROR_DECRYPTION_FAILED_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0434\u0435\u0448\u0438\u0444\u0440\u0443\u0458\u0435 \u0441\u043b\u043e\u0433 \u0421\u0421\u041b\u0430 \u043a\u043e\u0433 \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e.
SSL_ERROR_RECORD_OVERFLOW_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u043e\u0433 \u0421\u0421\u043b\u0430 \u043a\u043e\u0458\u0438 \u0458\u0435 \u0434\u0443\u0436\u0438 \u043e\u0434 \u0434\u043e\u0437\u0432\u043e\u0459\u0435\u043d\u043e\u0433.
SSL_ERROR_UNKNOWN_CA_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0435 \u043f\u0440\u0435\u043f\u043e\u0437\u043d\u0430\u0458\u0435 \u0438 \u043d\u0435 \u0432\u0435\u0440\u0443\u0458\u0435 \u0430\u0443\u0442\u043e\u0440\u0438\u0442\u0435\u0442\u0443 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0435 (CA) \u043a\u043e\u0458\u0438 \u0458\u0435 \u0438\u0437\u0434\u0430\u043e \u0412\u0430\u0448 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SSL_ERROR_ACCESS_DENIED_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0432\u0430\u0436\u0435\u045b\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442, \u0430\u043b\u0438 \u0458\u0435 \u043f\u0440\u0438\u0441\u0442\u0443\u043f \u043e\u0434\u0431\u0438\u0458\u0435\u043d.
SSL_ERROR_DECODE_ERROR_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0434\u0435\u043a\u043e\u0434\u0438\u0440\u0430 \u043f\u043e\u0437\u0434\u0440\u0430\u0432\u043d\u0443 \u043f\u043e\u0440\u0443\u043a\u0443 \u0421\u0421\u041b\u0430.
SSL_ERROR_DECRYPT_ERROR_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0458\u0430\u0432\u0459\u0430 \u0433\u0440\u0435\u0448\u043a\u0443 \u043f\u0440\u0438 \u043f\u0440\u043e\u0432\u0435\u0440\u0438 \u043f\u043e\u0442\u043f\u0438\u0441\u0430 \u0438\u043b\u0438 \u0440\u0430\u0437\u043c\u0435\u043d\u0438 \u043a\u0459\u0443\u0447\u0435\u0432\u0430.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043f\u0440\u0438\u0458\u0430\u0432\u0459\u0443\u0458\u0435 \u0434\u0430 \u0434\u043e\u0433\u043e\u0432\u043e\u0440 \u043d\u0438\u0458\u0435 \u0441\u0430\u0433\u043b\u0430\u0441\u0430\u043d \u0441\u0430 \u043f\u0440\u0430\u0432\u0438\u043b\u0438\u043c\u0430 \u043e \u0438\u0437\u0432\u043e\u0437\u0443.
SSL_ERROR_PROTOCOL_VERSION_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0458\u0430\u0432\u0459\u0430 \u043d\u0435\u0441\u0430\u0433\u043b\u0430\u0441\u043d\u043e \u0438\u043b\u0438 \u043d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e \u0438\u0437\u0434\u0430\u045a\u0435 \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0430.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Server \u0437\u0430\u0445\u0442\u0435\u0432\u0430 \u0448\u0438\u0444\u0440\u0435 \u043a\u043e\u0458\u0435 \u0441\u0443 \u0441\u0438\u0433\u0443\u0440\u043d\u0438\u0458\u0435 \u043e\u0434 \u043e\u043d\u0438\u0445 \u043a\u043e\u0458\u0435 \u0458\u0435 \u0434\u043e\u0441\u0442\u0430\u0432\u0438\u043e \u043a\u043b\u0438\u0458\u0435\u043d\u0442.
SSL_ERROR_INTERNAL_ERROR_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0458\u0430\u0432\u0459\u0430 \u0434\u0430 \u0458\u0435 \u0438\u0441\u043a\u0443\u0441\u0438\u043e \u0438\u043d\u0442\u0435\u0440\u043d\u0443 \u0433\u0440\u0435\u0448\u043a\u0443.
SSL_ERROR_USER_CANCELED_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u043a \u0458\u0435 \u043e\u0442\u043a\u0430\u0437\u0430\u043e \u0441\u0443\u0441\u0440\u0435\u0442.
SSL_ERROR_NO_RENEGOTIATION_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0435 \u0434\u043e\u0437\u0432\u043e\u0459\u0430\u0432\u0430 \u043f\u043e\u043d\u043e\u0432\u043d\u0438 \u0434\u043e\u0433\u043e\u0432\u043e\u0440 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0438\u0445 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0430\u0440\u0430 \u0421\u0421\u041b\u0430.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=\u0421\u0435\u0440\u0432\u0435\u0440\u0441\u043a\u0438 \u043a\u0435\u0448 \u0437\u0430 \u0421\u0421\u041b \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0435\u0448\u0435\u043d \u0438 \u043d\u0438\u0458\u0435 \u0438\u0441\u043a\u0459\u0443\u0447\u0435\u043d \u0437\u0430 \u043e\u0432\u0430\u0458 \u043f\u0440\u0438\u043a\u0459\u0443\u0447\u0430\u043a (socket).
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u0432\u0430 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u043f\u0440\u043e\u0434\u0443\u0436\u0435\u0442\u0430\u043a \u0422\u041b\u0421\u0430 (TLS) \u0437\u0430 \u043f\u043e\u0437\u0434\u0440\u0430\u0432.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0434\u043e\u0431\u0430\u0432\u0438 \u0412\u0430\u0448 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0441\u0430 \u043f\u0440\u043e\u0441\u043b\u0435\u0452\u0435\u043d\u043e\u0433 \u0423\u0420\u041b\u0430.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0441\u0430 \u0421\u0421\u041b\u043e\u043c \u043d\u0435\u043c\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0437\u0430 \u0442\u0440\u0430\u0436\u0435\u043d\u043e \u0438\u043c\u0435 \u0441\u0430 \u0414\u041d\u0421\u0430.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0437\u0430 \u0421\u0421\u041b \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0434\u043e\u0431\u0438\u0458\u0435 \u043e\u0434\u0433\u043e\u0432\u043e\u0440 \u041e\u0426\u0421\u041f (OCSP) \u0437\u0430 \u0441\u0432\u043e\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u0437\u0430 \u0421\u0421\u041b \u0458\u0435 \u0434\u043e\u0458\u0430\u0432\u0438\u043e \u043b\u043e\u0448\u0443 \u0432\u0440\u0435\u0434\u043d\u043e\u0441\u0442 \u0445\u0435\u0448\u0430 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0443 New Session Ticket handshake \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e malformed New Session Ticket handshake \u043f\u043e\u0440\u0443\u043a\u0443.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u0430\u0431\u0438\u0458\u0435\u043d\u0438 \u0437\u0430\u043f\u0438\u0441 \u043a\u043e\u0458\u0438 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0441\u0435 \u0440\u0430\u0441\u043f\u0430\u043a\u0443\u0458\u0435.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Renegotiation \u043d\u0438\u0458\u0435 \u0434\u043e\u0437\u0432\u043e\u0459\u0435\u043d \u043d\u0430 \u043e\u0432\u043e\u043c SSL socket-\u0443.
SSL_ERROR_UNSAFE_NEGOTIATION=Peer \u0458\u0435 \u043f\u043e\u043a\u0443\u0448\u0430\u043e (\u043c\u043e\u0436\u0434\u0430 \u0440\u0430\u045a\u0438\u0432) handshake \u0441\u0442\u0430\u0440\u043e\u0433 \u0441\u0442\u0438\u043b\u0430.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d \u0440\u0430\u0441\u043f\u0430\u043a\u043e\u0432\u0430\u043d\u0438 \u0437\u0430\u043f\u0438\u0441.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL \u0458\u0435 \u043f\u0440\u0438\u043c\u0438\u043e \u0441\u043b\u0430\u0431 ephemeral Diffie-Hellman \u043a\u0459\u0443\u0447 \u0443 Server Key Exchange handshake \u043f\u043e\u0440\u0443\u0446\u0438.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL received invalid NPN extension data.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=SSL feature not supported for SSL 2.0 connections.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=SSL feature not supported for servers.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=SSL feature not supported for clients.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=\u0414\u043e\u0448\u043b\u043e \u0458\u0435 \u0434\u043e \u0423/\u0418 \u0433\u0440\u0435\u0448\u043a\u0435 \u0442\u043e\u043a\u043e\u043c \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0435 \u0430\u0443\u0442\u043e\u0440\u0438\u0437\u0430\u0446\u0438\u0458\u0435.
SEC_ERROR_LIBRARY_FAILURE=\u0433\u0440\u0435\u0448\u043a\u0430 \u0443 \u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u0446\u0438 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442.
SEC_ERROR_BAD_DATA=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043f\u0440\u0438\u043c\u0459\u0435\u043d\u0438 \u0441\u0443 \u043b\u043e\u0448\u0438 \u043f\u043e\u0434\u0430\u0446\u0438.
SEC_ERROR_OUTPUT_LEN=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u0433\u0440\u0435\u0448\u043a\u0430 \u0441\u0430 \u0434\u0443\u0436\u0438\u043d\u043e\u043c \u0438\u0437\u043b\u0430\u0437\u0430.
SEC_ERROR_INPUT_LEN=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442 \u0458\u0435 \u0434\u043e\u0458\u0430\u0432\u0438\u043b\u0430 \u0433\u0440\u0435\u0448\u043a\u0443 \u0441\u0430 \u0434\u0443\u0436\u0438\u043d\u043e\u043c \u0438\u0437\u043b\u0430\u0437\u0430.
SEC_ERROR_INVALID_ARGS=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0438 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0438.
SEC_ERROR_INVALID_ALGORITHM=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c.
SEC_ERROR_INVALID_AVA=\u0411\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u0410\u0412\u0410 (AVA) \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430.
SEC_ERROR_INVALID_TIME=\u041d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u0458\u0435 \u0444\u043e\u0440\u043c\u0430\u0442\u0438\u0440\u0430\u043d\u0430 \u043d\u0438\u0441\u043a\u0430 \u043a\u043e\u0458\u0430 \u043e\u0434\u0440\u0435\u0452\u0443\u0458\u0435 \u0432\u0440\u0435\u043c\u0435.
SEC_ERROR_BAD_DER=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u0458\u0435 \u0444\u043e\u0440\u043c\u0430\u0442\u0438\u0440\u0430\u043d\u0430 \u0414\u0415\u0420-\u043a\u043e\u0434\u0438\u0440\u0430\u043d\u0430 \u043f\u043e\u0440\u0443\u043a\u0430.
SEC_ERROR_BAD_SIGNATURE=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430 \u0438\u043c\u0430 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438 \u043f\u043e\u0442\u043f\u0438\u0441.
SEC_ERROR_EXPIRED_CERTIFICATE=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430 \u0458\u0435 \u0438\u0441\u0442\u0435\u043a\u0430\u043e.
SEC_ERROR_REVOKED_CERTIFICATE=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430 \u0458\u0435 \u043e\u043f\u043e\u0437\u0432\u0430\u043d.
SEC_ERROR_UNKNOWN_ISSUER=\u0418\u0437\u0434\u0430\u0432\u0430\u0447 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0437\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0438\u0458\u0435 \u043f\u0440\u0435\u043f\u043e\u0437\u043d\u0430\u0442.
SEC_ERROR_BAD_KEY=\u0408\u0430\u0432\u043d\u0438 \u043a\u0459\u0443\u0447 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_BAD_PASSWORD=\u0423\u043d\u0435\u0441\u0435\u043d\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0430 \u043b\u043e\u0437\u0438\u043d\u043a\u0430 \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430.
SEC_ERROR_RETRY_PASSWORD=\u041d\u043e\u0432\u0430 \u043b\u043e\u0437\u0438\u043d\u043a\u0430 \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u0443\u043d\u0435\u0442\u0430.  \u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043f\u0440\u043e\u0431\u0430\u0442\u0435 \u043f\u043e\u043d\u043e\u0432\u043e.
SEC_ERROR_NO_NODELOCK=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043d\u0435\u043c\u0430 \u043a\u0459\u0443\u0447\u0430 \u0437\u0430 \u043d\u043e\u0434.
SEC_ERROR_BAD_DATABASE=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043f\u043e\u043a\u0432\u0430\u0440\u0435\u043d\u0430 \u0431\u0430\u0437\u0430 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_NO_MEMORY=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u0433\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u0434\u043e\u0434\u0435\u043b\u0438 \u043c\u0435\u043c\u043e\u0440\u0438\u0458\u0435.
SEC_ERROR_UNTRUSTED_ISSUER=\u041a\u043e\u0440\u0438\u0441\u043d\u0438\u043a \u0458\u0435 \u043e\u0437\u043d\u0430\u0447\u0438\u043e \u0434\u0430 \u0438\u0437\u0434\u0430\u0432\u0430\u0447 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0437\u0430 \u0443\u0434\u0430\u0459\u0435\u043d\u0438 \u0440\u0430\u0447\u0443\u043d\u0430\u0440 \u043d\u0438\u0458\u0435 \u043e\u0434 \u043f\u043e\u0432\u0435\u0440\u0435\u045a\u0430.
SEC_ERROR_UNTRUSTED_CERT=\u041a\u043e\u0440\u0438\u0441\u043d\u0438\u043a \u0458\u0435 \u043e\u0437\u043d\u0430\u0447\u0438\u043e \u0434\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0443\u0434\u0430\u0459\u0435\u043d\u043e\u0433 \u0440\u0430\u0447\u0443\u043d\u0430\u0440\u0430 \u043d\u0438\u0458\u0435 \u043e\u0434 \u043f\u043e\u0432\u0435\u0440\u0435\u045a\u0430.
SEC_ERROR_DUPLICATE_CERT=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0432\u0435\u045b \u043f\u043e\u0441\u0442\u043e\u0458\u0438 \u0443 \u0412\u0430\u0448\u043e\u0458 \u0431\u0430\u0437\u0438 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_DUPLICATE_CERT_NAME=\u041f\u0440\u0435\u0443\u0437\u0435\u0442\u043e \u0438\u043c\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0432\u0435\u045b \u043f\u043e\u0441\u0442\u043e\u0458\u0438 \u0443 \u0412\u0430\u0448\u043e\u0458 \u0431\u0430\u0437\u0438 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_ADDING_CERT=\u0413\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u0434\u043e\u0434\u0430\u0432\u0430\u045a\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0443 \u0431\u0430\u0437\u0443 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_FILING_KEY=\u0413\u0440\u0435\u0448\u043a\u0430 \u0443 \u043f\u043e\u043d\u043e\u0432\u043d\u043e\u043c \u043f\u043e\u0434\u043d\u043e\u0448\u0435\u045a\u0443 \u043a\u0459\u0443\u0447\u0430 \u0437\u0430 \u043e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SEC_ERROR_NO_KEY=\u041f\u0440\u0438\u0432\u0430\u0442\u043d\u0438 \u043a\u0459\u0443\u0447 \u0437\u0430 \u043e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d \u0443 \u0431\u0430\u0437\u0438 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_CERT_VALID=\u041e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u0435 \u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_CERT_NOT_VALID=\u041e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_CERT_NO_RESPONSE=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0435\: \u043d\u0435\u043c\u0430 \u043e\u0434\u0433\u043e\u0432\u043e\u0440\u0430
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0458\u0435 \u0438\u0441\u0442\u0435\u043a\u0430\u043e.  \u041f\u0440\u043e\u0432\u0435\u0440\u0438\u0442\u0435 \u0441\u0438\u0441\u0442\u0435\u043c\u0441\u043a\u0438 \u0434\u0430\u0442\u0443\u043c \u0438 \u0432\u0440\u0435\u043c\u0435.
SEC_ERROR_CRL_EXPIRED=\u0426\u0420\u041b (CRL) \u0437\u0430 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0458\u0435 \u0438\u0441\u0442\u0435\u043a\u0430\u043e.  \u041e\u0441\u0432\u0435\u0436\u0438\u0442\u0435 \u0433\u0430 \u0438\u043b\u0438 \u043f\u0440\u043e\u0432\u0435\u0440\u0438\u0442\u0435 \u0441\u0438\u0441\u0442\u0435\u043c\u0441\u043a\u0438 \u0434\u0430\u0442\u0443\u043c \u0438 \u0432\u0440\u0435\u043c\u0435.
SEC_ERROR_CRL_BAD_SIGNATURE=\u0426\u0420\u041b (CRL) \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0441\u0430\u0434\u0440\u0436\u0438 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438 \u043f\u043e\u0442\u043f\u0438\u0441.
SEC_ERROR_CRL_INVALID=\u041d\u043e\u0432\u0430 \u041b\u041f\u0421 \u0438\u043c\u0430 \u043f\u043e\u0433\u0440\u0435\u0448\u0430\u043d \u0444\u043e\u0440\u043c\u0430\u0442.
SEC_ERROR_EXTENSION_VALUE_INVALID=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0432\u0430 \u0432\u0440\u0435\u0434\u043d\u043e\u0441\u0442 \u0437\u0430 \u043f\u0440\u043e\u0434\u0443\u0436\u0435\u045a\u0435 \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430.
SEC_ERROR_EXTENSION_NOT_FOUND=\u041f\u0440\u043e\u0434\u0443\u0436\u0435\u045a\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d\u043e.
SEC_ERROR_CA_CERT_INVALID=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0430 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=\u041e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u045a\u0435 \u0434\u0443\u0436\u0438\u043d\u0435 \u0441\u0442\u0430\u0437\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0435.
SEC_ERROR_CERT_USAGES_INVALID=\u041f\u043e\u0459\u0435 \u0443\u043f\u043e\u0442\u0440\u0435\u0431\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 (usages) \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e.
SEC_INTERNAL_ONLY=**\u0418\u0441\u043a\u0459\u0443\u0447\u0438\u0432\u043e \u0438\u043d\u0442\u0435\u0440\u043d\u0438 \u043c\u043e\u0434\u0443\u043b**
SEC_ERROR_INVALID_KEY=\u041e\u0432\u0430\u0458 \u043a\u0459\u0443\u0447 \u043d\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u0432\u0430 \u0442\u0440\u0430\u0436\u0435\u043d\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0441\u0430\u0434\u0440\u0436\u0438 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u0438 \u043a\u0440\u0438\u0442\u0438\u0447\u0430\u043d \u043f\u0440\u043e\u0434\u0443\u0436\u0435\u0442\u0430\u043a.
SEC_ERROR_OLD_CRL=\u041d\u043e\u0432\u0438 \u0426\u0420\u041b (CRL) \u043d\u0438\u0458\u0435 \u0441\u0442\u0430\u0440\u0438\u0458\u0438 \u043e\u0434 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u043e\u0433.
SEC_ERROR_NO_EMAIL_CERT=\u041d\u0438\u0458\u0435 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e \u043d\u0438\u0442\u0438 \u043f\u043e\u0442\u043f\u0438\u0441\u0430\u043d\u043e\: \u0458\u043e\u0448 \u0443\u0432\u0435\u043a \u043d\u0435\u043c\u0430\u0442\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0437\u0430 \u0435\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u0441\u043a\u0443 \u043f\u043e\u0448\u0442\u0443.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=\u041d\u0438\u0458\u0435 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e\: \u043d\u0435\u043c\u0430\u0442\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0435 \u0437\u0430 \u0441\u0432\u0435 \u043f\u0440\u0438\u043c\u0430\u043e\u0446\u0435.
SEC_ERROR_NOT_A_RECIPIENT=\u0414\u0435\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435\: \u043d\u0438\u0441\u0442\u0435 \u043f\u0440\u0438\u043c\u0430\u043b\u0430\u0446, \u0438\u043b\u0438 \u043d\u0438\u0441\u0443 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d\u0438 \u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430\u0458\u0443\u045b\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0438 \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u0438 \u043a\u0459\u0443\u0447.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=\u0414\u0435\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435\: \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0437\u0430 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u043a\u0459\u0443\u0447\u0435\u0432\u0430 \u043d\u0435 \u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430 \u0412\u0430\u0448\u0435\u043c \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0443.
SEC_ERROR_PKCS7_BAD_SIGNATURE=\u041f\u0440\u043e\u0432\u0435\u0440\u0430 \u043f\u043e\u0442\u043f\u0438\u0441\u0430 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u0430\: \u043f\u043e\u0442\u043f\u0438\u0441\u043d\u0438\u043a \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d, \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d\u043e \u0458\u0435 \u043f\u0440\u0435\u0432\u0438\u0448\u0435 \u043f\u043e\u0442\u043f\u0438\u0441\u043d\u0438\u043a\u0430, \u0438\u043b\u0438 \u0441\u0443 \u043f\u043e\u0434\u0430\u0446\u0438 \u043d\u0435\u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430\u0458\u0443\u045b\u0438 \u0438\u043b\u0438 \u043f\u043e\u043a\u0432\u0430\u0440\u0435\u043d\u0438.
SEC_ERROR_UNSUPPORTED_KEYALG=\u041d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d \u0438\u043b\u0438 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0437\u0430 \u043a\u0459\u0443\u0447\u0435\u0432\u0435.
SEC_ERROR_DECRYPTION_DISALLOWED=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0434\u0435\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435\: \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u043d\u043e \u043f\u043e\u043c\u043e\u045b\u0443 \u043d\u0435\u0434\u043e\u0437\u0432\u043e\u0459\u0435\u043d\u043e\u0433 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u043c\u0430 \u0438\u043b\u0438 \u0434\u0443\u0436\u0438\u043d\u0435 \u043a\u0459\u0443\u0447\u0430.
XP_SEC_FORTEZZA_BAD_CARD=\u0424\u043e\u0440\u0442\u0435\u0446\u0430 (Fortezza) \u043a\u0430\u0440\u0442\u0430 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043f\u0438\u0441\u043d\u043e \u043f\u043e\u043a\u0440\u0435\u043d\u0443\u0442\u0430.  \u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u0458\u0435 \u0443\u043a\u043b\u043e\u043d\u0438\u0442\u0435 \u0438 \u0432\u0440\u0430\u0442\u0438\u0442\u0435 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0443.
XP_SEC_FORTEZZA_NO_CARD=\u041d\u0438\u0458\u0435 \u043d\u0430\u0452\u0435\u043d\u0430 \u043d\u0438\u0458\u0435\u0434\u043d\u0430 \u0444\u043e\u0440\u0442\u0435\u0446\u0430 (Fortezza) \u043a\u0430\u0440\u0442\u0430
XP_SEC_FORTEZZA_NONE_SELECTED=\u041d\u0438\u0458\u0435 \u0438\u0437\u0430\u0431\u0440\u0430\u043d\u0430 \u0444\u043e\u0440\u0442\u0435\u0446\u0430 (Fortezza) \u043a\u0430\u0440\u0442\u0430
XP_SEC_FORTEZZA_MORE_INFO=\u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u0438\u0437\u0430\u0431\u0435\u0440\u0435\u0442\u0435 \u043b\u0438\u0447\u043d\u043e\u0441\u0442 \u043e \u043a\u043e\u0458\u043e\u0458 \u0442\u0440\u0435\u0431\u0430 \u0434\u043e\u0431\u0430\u0432\u0438\u0442\u0438 \u043f\u043e\u0434\u0430\u0442\u043a\u0435
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=\u041b\u0438\u0447\u043d\u043e\u0441\u0442 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d\u0430
XP_SEC_FORTEZZA_NO_MORE_INFO=\u041d\u0435\u043c\u0430 \u0432\u0438\u0448\u0435 \u043f\u0434\u043e\u0430\u0442\u0430\u043a\u0430 \u043e \u0442\u043e\u0458 \u043b\u0438\u0447\u043d\u043e\u0441\u0442\u0438
XP_SEC_FORTEZZA_BAD_PIN=\u041d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u041f\u0418\u041d
XP_SEC_FORTEZZA_PERSON_ERROR=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u043e\u043a\u0440\u0435\u043d\u0443\u0442\u0438 \u0444\u043e\u0440\u0442\u0435\u0446\u0438\u043d\u0435 (Fortezza) \u043b\u0438\u0447\u043d\u043e\u0441\u0442\u0438.
SEC_ERROR_NO_KRL=\u041a\u0420\u041b (KRL) \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043e\u0432\u043e\u0433 \u0441\u0430\u0458\u0442\u0430 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d.
SEC_ERROR_KRL_EXPIRED=\u041a\u0420\u041b (KRL) \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043e\u0432\u043e\u0433 \u0441\u0430\u0458\u0442\u0430 \u0458\u0435 \u0438\u0441\u0442\u0435\u043a\u0430\u043e.
SEC_ERROR_KRL_BAD_SIGNATURE=\u041a\u0420\u041b (KRL) \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043e\u0432\u043e\u0433 \u0441\u0430\u0458\u0442\u0430 \u0438\u043c\u0430 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438 \u043f\u043e\u0442\u043f\u0438\u0441.
SEC_ERROR_REVOKED_KEY=\u041a\u0459\u0443\u0447 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043e\u0432\u043e\u0433 \u0441\u0430\u0458\u0442\u0430 \u0458\u0435 \u043e\u043f\u043e\u0437\u0432\u0430\u043d.
SEC_ERROR_KRL_INVALID=\u041d\u043e\u0432\u0438 \u041a\u0420\u041b (KRL) \u0438\u043c\u0430 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438 \u0444\u043e\u0440\u043c\u0430\u0442.
SEC_ERROR_NEED_RANDOM=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043f\u043e\u0442\u0440\u0435\u0431\u043d\u0438 \u0441\u0443 \u0441\u043b\u0443\u0447\u0430\u0458\u043d\u0438 \u043f\u043e\u0434\u0430\u0446\u0438.
SEC_ERROR_NO_MODULE=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u043d\u0438\u0458\u0435\u0434\u0430\u043d \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0438 \u043c\u043e\u0434\u0443\u043b \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0438\u0437\u0432\u0440\u0448\u0438 \u0442\u0440\u0430\u0436\u0435\u043d\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e.
SEC_ERROR_NO_TOKEN=\u0411\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0430 \u043a\u0430\u0440\u0442\u0430 \u0438\u043b\u0438 \u043d\u043e\u0432\u0447\u0438\u045b \u043d\u0435 \u043f\u043e\u0441\u0442\u043e\u0458\u0435, \u043f\u043e\u0442\u0440\u0435\u0431\u043d\u043e \u0458\u0435 \u0434\u0430 \u0441\u0435 \u043f\u043e\u0441\u0442\u0430\u0432\u0435, \u0438\u043b\u0438 \u0441\u0443 \u0443\u043a\u043b\u043e\u045a\u0435\u043d\u0438.
SEC_ERROR_READ_ONLY=\u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430 \u0437\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\: \u0431\u0430\u0437\u0430 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430 \u0458\u0435 \u0441\u0430\u043c\u043e \u0437\u0430 \u0447\u0438\u0442\u0430\u045a\u0435.
SEC_ERROR_NO_SLOT_SELECTED=\u041d\u0438\u0458\u0435\u0434\u0430\u043d \u043f\u0440\u043e\u0440\u0435\u0437 \u043d\u0438 \u043d\u043e\u0432\u0447\u0438\u045b \u043d\u0438\u0441\u0443 \u0438\u0437\u0430\u0431\u0440\u0430\u043d\u0438.
SEC_ERROR_CERT_NICKNAME_COLLISION=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0441\u0430 \u0438\u0441\u0442\u043e\u043c \u043e\u0437\u043d\u0430\u043a\u043e\u043c \u0432\u0435\u045b \u043f\u043e\u0441\u0442\u043e\u0458\u0438.
SEC_ERROR_KEY_NICKNAME_COLLISION=\u041a\u0459\u0443\u0447 \u0441\u0430 \u0438\u0441\u0442\u043e\u043c \u043e\u0437\u043d\u0430\u043a\u043e\u043c \u0432\u0435\u045b \u043f\u043e\u0441\u0442\u043e\u0458\u0438.
SEC_ERROR_SAFE_NOT_CREATED=\u0433\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u043f\u0440\u0430\u0432\u0459\u0435\u045a\u0443 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0433 \u043e\u0431\u0458\u0435\u043a\u0442\u0430
SEC_ERROR_BAGGAGE_NOT_CREATED=\u0433\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u043f\u0440\u0430\u0432\u0459\u0435\u045a\u0443 \u043e\u0431\u0458\u0435\u043a\u0442\u0430 \u043f\u0440\u0442\u0459\u0430\u0433\u0430
XP_JAVA_REMOVE_PRINCIPAL_ERROR=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0443\u043a\u043b\u043e\u043d\u0438\u0442\u0438 \u043f\u0440\u0438\u043d\u0446\u0438\u043f\u0430\u043b
XP_JAVA_DELETE_PRIVILEGE_ERROR=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0443\u043a\u043b\u043e\u043d\u0438\u0442\u0438 \u043f\u0440\u0438\u0432\u0438\u043b\u0435\u0433\u0438\u0458\u0443
XP_JAVA_CERT_NOT_EXISTS_ERROR=\u041e\u0432\u0430\u0458 \u043f\u0440\u0438\u043d\u0446\u0438\u043f\u0430\u043b \u043d\u0435\u043c\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442
SEC_ERROR_BAD_EXPORT_ALGORITHM=\u0422\u0440\u0430\u0436\u0435\u043d\u0438 \u0430\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u043d\u0438\u0458\u0435 \u0434\u043e\u043f\u0443\u0448\u0442\u0435\u043d.
SEC_ERROR_EXPORTING_CERTIFICATES=\u0413\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u0438\u0437\u0432\u043e\u0437\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SEC_ERROR_IMPORTING_CERTIFICATES=\u0413\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u0443\u0432\u043e\u0437\u0443 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SEC_ERROR_PKCS12_DECODING_PFX=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u0447.  \u0414\u043e\u0448\u043b\u043e \u0458\u0435 \u0434\u043e \u0433\u0440\u0435\u0448\u043a\u0435 \u043f\u0440\u0438 \u0434\u0435\u043a\u043e\u0434\u043e\u0432\u0430\u045a\u0443.  \u0414\u0430\u0442\u043e\u0442\u0435\u043a\u0430 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0430.
SEC_ERROR_PKCS12_INVALID_MAC=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u041c\u0410\u0426 (MAC) \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d.  \u041b\u043e\u0437\u0438\u043d\u043a\u0430 \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430 \u0438\u043b\u0438 \u0458\u0435 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0430 \u043e\u0448\u0442\u0435\u045b\u0435\u043d\u0430.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0410\u043b\u0433\u043e\u0440\u0438\u0442\u0430\u043c \u0437\u0430 \u041c\u0410\u0426 (MAC) \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0421\u0430\u043c\u043e \u0441\u0443 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0438 \u043c\u043e\u0434\u043e\u0432\u0438 \u0441\u0430 \u0438\u043d\u0442\u0435\u0433\u0440\u0438\u0442\u0435\u0442\u043e\u043c \u043b\u043e\u0437\u0438\u043d\u043a\u0435 \u0438 \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u043e\u0441\u0442\u0438.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0421\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0430 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0435 \u0458\u0435 \u043f\u043e\u0440\u0435\u043c\u0435\u045b\u0435\u043d\u0430.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0410\u043b\u0433\u043e\u0440\u0438\u0442\u043c\u0438 \u0437\u0430 \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u043d\u0438\u0441\u0443 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0438.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0418\u0437\u0434\u0430\u045a\u0435 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0435 \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u041d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430 \u043b\u043e\u0437\u0438\u043d\u043a\u0430 \u0437\u0430 \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u043e\u0441\u0442.
SEC_ERROR_PKCS12_CERT_COLLISION=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0418\u0441\u0442\u043e \u0438\u043c\u0435 \u0432\u0435\u045b \u043f\u043e\u0441\u0442\u043e\u0458\u0438 \u0443 \u0431\u0430\u0437\u0438 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_USER_CANCELLED=\u041a\u043e\u0440\u0438\u0441\u043d\u0438\u043a \u0458\u0435 \u043e\u0442\u043a\u0430\u0437\u0430\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e.
SEC_ERROR_PKCS12_DUPLICATE_DATA=\u041d\u0438\u0458\u0435 \u0443\u0432\u0435\u0437\u0435\u043d\u043e, \u0432\u0435\u045b \u0441\u0435 \u043d\u0430\u043b\u0430\u0437\u0438 \u0443 \u0431\u0430\u0437\u0438 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_MESSAGE_SEND_ABORTED=\u041f\u043e\u0440\u0443\u043a\u0430 \u043d\u0438\u0458\u0435 \u043f\u043e\u0441\u043b\u0430\u0442\u0430.
SEC_ERROR_INADEQUATE_KEY_USAGE=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 \u043a\u0459\u0443\u0447\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u043d\u0435 \u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430 \u043f\u043e\u043a\u0443\u0448\u0430\u043d\u043e\u043c \u0434\u0435\u0458\u0441\u0442\u0432\u0443.
SEC_ERROR_INADEQUATE_CERT_TYPE=\u0412\u0440\u0441\u0442\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u043d\u0438\u0458\u0435 \u043e\u0434\u043e\u0431\u0440\u0435\u043d\u0430 \u0437\u0430 \u043e\u0432\u0443 \u043f\u0440\u0438\u043c\u0435\u043d\u0443.
SEC_ERROR_CERT_ADDR_MISMATCH=\u0410\u0434\u0440\u0435\u0441\u0430 \u0443 \u043f\u043e\u0442\u043f\u0438\u0441\u043d\u043e\u043c \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0443 \u043d\u0435 \u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430 \u0430\u0434\u0440\u0435\u0441\u0438 \u0443 \u0437\u0430\u0433\u043b\u0430\u0432\u0459\u0438\u043c\u0430 \u043f\u043e\u0440\u0443\u043a\u0435.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0413\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u0443\u0432\u043e\u0437\u0443 \u043f\u0440\u0438\u0432\u0430\u0442\u043d\u043e\u0433 \u043a\u0459\u0443\u0447\u0430.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0413\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438 \u0443\u0432\u043e\u0437\u0443 \u043b\u0430\u043d\u0446\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u0440\u043e\u043d\u0430\u045b\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0438\u043b\u0438 \u043a\u0459\u0443\u0447 \u043f\u043e \u0438\u043c\u0435\u043d\u0443.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=\u0418\u0437\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u041f\u0440\u0438\u0432\u0430\u0442\u043d\u0438 \u043a\u0459\u0443\u0447 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=\u0418\u0437\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u0438 \u0438\u0437\u0432\u043e\u0437\u043d\u0443 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0443.
SEC_ERROR_PKCS12_UNABLE_TO_READ=\u0423\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u0440\u043e\u0447\u0438\u0442\u0430\u0442\u0438 \u0443\u0432\u043e\u0437\u043d\u0443 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0443.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=\u0418\u0437\u0432\u043e\u0437 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b.  \u0411\u0430\u0437\u0430 \u043a\u0459\u0443\u0447\u0435\u0432\u0430 \u0458\u0435 \u043e\u0448\u0442\u0435\u045b\u0435\u043d\u0430 \u0438\u043b\u0438 \u0443\u043a\u043b\u043e\u045a\u0435\u043d\u0430.
SEC_ERROR_KEYGEN_FAIL=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043d\u0430\u043f\u0440\u0430\u0432\u0438\u0442\u0438 \u043f\u0430\u0440 \u0458\u0430\u0432\u043d\u043e\u0433 \u0438 \u0442\u0430\u0458\u043d\u043e\u0433 \u043a\u0459\u0443\u0447\u0430.
SEC_ERROR_INVALID_PASSWORD=\u0423\u043d\u0435\u0441\u0435\u043d\u0430 \u043b\u043e\u0437\u0438\u043d\u043a\u0430 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0430.  \u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u0438\u0437\u0430\u0431\u0435\u0440\u0435\u0442\u0435 \u043d\u0435\u043a\u0443 \u0434\u0440\u0443\u0433\u0443.
SEC_ERROR_RETRY_OLD_PASSWORD=\u0421\u0442\u0430\u0440\u0430 \u043b\u043e\u0437\u0438\u043d\u043a\u0430 \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u0443\u043d\u0435\u0442\u0430.  \u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043f\u0440\u043e\u0431\u0430\u0442\u0435 \u043f\u043e\u043d\u043e\u0432\u043e.
SEC_ERROR_BAD_NICKNAME=\u0422\u043e \u0438\u043c\u0435 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0441\u0435 \u0432\u0435\u045b \u043a\u043e\u0440\u0438\u0441\u0442\u0438.
SEC_ERROR_NOT_FORTEZZA_ISSUER=\u0423\u0434\u0430\u0459\u0435\u043d\u0438 \u0444\u043e\u0440\u0442\u0435\u0446\u0430 (Fortezza) \u043b\u0430\u043d\u0430\u0446 \u0438\u043c\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043a\u043e\u0458\u0438 \u043d\u0438\u0458\u0435 \u0444\u043e\u0440\u0442\u0435\u0446\u0430.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=\u041f\u043e\u0432\u0435\u0440\u0459\u0438\u0432 \u043a\u0459\u0443\u0447 \u0441\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435 \u043f\u043e\u043c\u0435\u0440\u0438\u0442\u0438 \u0434\u043e \u0431\u0440\u0430\u0432\u0435 \u0437\u0430 \u043a\u043e\u0458\u0443 \u0458\u0435 \u043d\u0435\u043e\u043f\u0445\u043e\u0434\u0430\u043d.
SEC_ERROR_JS_INVALID_MODULE_NAME=\u041d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u0438\u043c\u0435 \u043c\u043e\u0434\u0443\u043b\u0430.
SEC_ERROR_JS_INVALID_DLL=\u041d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430 \u0441\u0442\u0430\u0437\u0430 \u0438\u043b\u0438 \u0438\u043c\u0435 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0435 \u0437\u0430 \u043c\u043e\u0434\u0443\u043b
SEC_ERROR_JS_ADD_MOD_FAILURE=\u041d\u0435\u043c\u043e\u0433\u0443\u045b\u0435 \u0458\u0435 \u0434\u043e\u0434\u0430\u0442\u0438 \u043c\u043e\u0434\u0443\u043b
SEC_ERROR_JS_DEL_MOD_FAILURE=\u041d\u0435\u0443\u0441\u043f\u0435\u0448\u043d\u043e \u0431\u0440\u0438\u0441\u0430\u045a\u0435 \u043c\u043e\u0434\u0443\u043b\u0430
SEC_ERROR_OLD_KRL=\u041d\u043e\u0432\u0438 \u041a\u0420\u041b (KRL) \u043d\u0438\u0458\u0435 \u0441\u0442\u0430\u0440\u0438\u0458\u0438 \u043e\u0434 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u043e\u0433.
SEC_ERROR_CKL_CONFLICT=\u041d\u043e\u0432\u0438 \u0426\u041a\u041b (CKL) \u0438\u043c\u0430 \u0434\u0440\u0443\u0433\u043e\u0433 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0430 \u043e\u0434 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u043e\u0433 \u0426\u041a\u041b\u0430.  \u0423\u043a\u043b\u043e\u043d\u0438\u0442\u0435 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u0438 \u0426\u041a\u041b.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=\u0410\u0443\u0442\u043e\u0440\u0438\u0442\u0435\u0442 \u0437\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u0446\u0438\u0440\u0430\u045a\u0435 \u0437\u0430 \u043e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043d\u0435 \u0441\u043c\u0435 \u0434\u0430 \u0438\u0437\u0434\u0430\u0458\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0441\u0430 \u043e\u0432\u0438\u043c \u0438\u043c\u0435\u043d\u043e\u043c.
SEC_ERROR_KRL_NOT_YET_VALID=\u0421\u043f\u0438\u0441\u0430\u043a \u043e\u043f\u043e\u0437\u0432\u0430\u043d\u0438\u0445 \u043a\u0459\u0443\u0447\u0435\u0432\u0430 \u0437\u0430 \u043e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u043e\u0448 \u043d\u0438\u0458\u0435 \u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_CRL_NOT_YET_VALID=\u0421\u043f\u0438\u0441\u0430\u043a \u043e\u043f\u043e\u0437\u0432\u0430\u043d\u0438\u0445 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0437\u0430 \u043e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u043e\u0448 \u043d\u0438\u0458\u0435 \u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_UNKNOWN_CERT=\u0422\u0440\u0430\u0436\u0435\u043d\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d.
SEC_ERROR_UNKNOWN_SIGNER=\u041f\u043e\u0442\u043f\u0438\u0441\u043d\u0438\u043a\u043e\u0432 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=\u041c\u0435\u0441\u0442\u043e \u0437\u0430 \u0441\u0442\u0430\u0442\u0443\u0441\u043d\u0438 \u0441\u0435\u0440\u0432\u0435\u0440 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0438\u043c\u0430 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u0444\u043e\u0440\u043c\u0430\u0442.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=\u041e\u0426\u0421\u041f (OCSP) \u043e\u0434\u0433\u043e\u0432\u043e\u0440 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u043f\u043e\u0442\u043f\u0443\u043d\u043e \u0434\u0435\u043a\u043e\u0434\u0438\u0440\u0430\u0442\u0438; \u0432\u0440\u0441\u0442\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u0458\u0435 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u0430.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=\u0421\u0435\u0440\u0432\u0435\u0440 \u0437\u0430 \u041e\u0426\u0421\u041f (OCSP) \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e \u043d\u0435\u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043d\u0435 \u0438\u043b\u0438 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0435 \u043f\u043e\u0434\u0430\u0442\u043a\u0435 \u043a\u0440\u043e\u0437 \u0425\u0422\u0422\u041f.
SEC_ERROR_OCSP_MALFORMED_REQUEST=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u043e \u0434\u0430 \u0458\u0435 \u0437\u0430\u0445\u0442\u0435\u0432 \u043e\u0448\u0442\u0435\u045b\u0435\u043d \u0438\u043b\u0438 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d.
SEC_ERROR_OCSP_SERVER_ERROR=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u0438\u0441\u043a\u0443\u0441\u0438\u043e \u0438\u043d\u0442\u0435\u0440\u043d\u0443 \u0433\u0440\u0435\u0448\u043a\u0443.
SEC_ERROR_OCSP_TRY_SERVER_LATER=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u0435\u0434\u043b\u0430\u0436\u0435 \u0430\u0434 \u043f\u0440\u043e\u0431\u0430\u0442\u0435 \u043a\u0430\u0441\u043d\u0438\u0458\u0435 \u043e\u043f\u0435\u0442.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u0442\u0440\u0430\u0436\u0438 \u043f\u043e\u0442\u043f\u0438 \u043d\u0430 \u043e\u0432\u043e\u043c \u0437\u0430\u0445\u0442\u0435\u0432\u0443.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u043e\u0434\u0431\u0438\u043e \u043e\u0432\u0430\u0458 \u0437\u0430\u0445\u0442\u0435\u0432 \u043a\u0430\u043e \u043d\u0435\u043e\u0432\u043b\u0430\u0448\u045b\u0435\u043d.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e \u0441\u0442\u0430\u0442\u0443\u0441\u043d\u0438 \u043a\u043e\u0434 \u043a\u043e\u0458\u0438 \u043d\u0438\u0458\u0435 \u043f\u0440\u0435\u043f\u043e\u0437\u043d\u0430\u0442.
SEC_ERROR_OCSP_UNKNOWN_CERT=\u041e\u0426\u0421\u041f (OCSP) \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0435\u043c\u0430 \u0441\u0442\u0430\u0442\u0443\u0441\u043d\u0438 \u043a\u043e\u0434 \u0437\u0430 \u043e\u0432\u0430\u0458 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442.
SEC_ERROR_OCSP_NOT_ENABLED=\u041c\u043e\u0440\u0430\u0442\u0435 \u0434\u0430 \u0443\u043a\u0459\u0443\u0447\u0438\u0442\u0435 \u041e\u0426\u0421\u041f (OCSP) \u043f\u0440\u0435 \u043d\u0435\u0433\u043e \u0448\u0442\u043e \u0438\u0437\u0432\u0435\u0434\u0435\u0442\u0435 \u043e\u0432\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=\u041c\u043e\u0440\u0430\u0442\u0435 \u0434\u0430 \u043f\u043e\u0441\u0442\u0430\u0432\u0438\u0442\u0435 \u0438\u0437\u0432\u043e\u0440\u043d\u0438 \u0440\u0435\u0441\u043f\u043e\u043d\u0434\u0435\u0440 \u043f\u0440\u0435 \u043d\u0435\u0433\u043e \u0448\u0442\u043e \u0438\u0437\u0432\u0435\u0434\u0435\u0442\u0435 \u043e\u0432\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=\u041e\u0434\u0433\u043e\u0432\u043e\u0440 \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0437\u0430 \u041e\u0426\u0421\u041f (OCSP) \u0458\u0435 \u043e\u0448\u0442\u0435\u045b\u0435\u043d \u0438\u043b\u0438 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u043e \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=\u041f\u043e\u0442\u043f\u0438\u0441\u043d\u0438\u043a \u043e\u0432\u043e\u0433 \u043e\u0434\u0433\u043e\u0432\u043e\u0440\u0430 \u0437\u0430 \u041e\u0426\u0421\u041f (OCSP) \u043d\u0438\u0458\u0435 \u043e\u0432\u043b\u0430\u0448\u045b\u0435\u043d \u0434\u0430 \u0434\u0430 \u0441\u0442\u0430\u0442\u0443\u0441 \u043e\u0432\u043e\u0433 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SEC_ERROR_OCSP_FUTURE_RESPONSE=\u041e\u0426\u0421\u041f (OCSP) \u043e\u0434\u0433\u043e\u0432\u043e\u0440 \u0458\u043e\u0448 \u0443\u0432\u0435\u043a \u043d\u0438\u0458\u0435 \u0432\u0430\u0436\u0435\u045b\u0438 (\u0441\u0430\u0434\u0440\u0436\u0438 \u0431\u0443\u0434\u0443\u045b\u0438 \u0434\u0430\u0442\u0443\u043c).
SEC_ERROR_OCSP_OLD_RESPONSE=\u041e\u0426\u0421\u041f (OCSP) \u043e\u0434\u0433\u043e\u0432\u043e\u0440 \u0441\u0430\u0434\u0440\u0436\u0438 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0435 \u043f\u043e\u0434\u0430\u0442\u043a\u0435.
SEC_ERROR_DIGEST_NOT_FOUND=\u0421\u0430\u0436\u0435\u0446\u0438 \u0426\u041c\u0421 (CMS) \u0438\u043b\u0438 \u041f\u041a\u0426\u0421 \#7 (PKCS \#7) \u043d\u0438\u0441\u0443 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d\u0438 \u0443 \u043f\u043e\u0442\u043f\u0438\u0441\u0430\u043d\u043e\u0458 \u043f\u043e\u0440\u0443\u0446\u0438.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=\u0412\u0440\u0441\u0442\u0435 \u043f\u043e\u0440\u0443\u043a\u0430 \u0426\u041c\u0421 (CMS) \u0438\u043b\u0438 \u041f\u041a\u0426\u0421 \#7 (PKCS \#7) \u043d\u0438\u0441\u0443 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0435.
SEC_ERROR_MODULE_STUCK=\u041c\u043e\u0434\u0443\u043b \u041f\u041a\u0426\u0421 \#11 (PKCS \#11) \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0431\u0443\u0434\u0435 \u0443\u043a\u043b\u043e\u045a\u0435\u043d \u0458\u0435\u0440 \u0441\u0435 \u0458\u043e\u0448 \u0443\u0432\u0435\u043a \u043a\u043e\u0440\u0438\u0441\u0442\u0438.
SEC_ERROR_BAD_TEMPLATE=\u041d\u0438\u0458\u0435 \u043c\u043e\u0433\u0443\u045b\u0435 \u0434\u0435\u043a\u043e\u0434\u043e\u0432\u0430\u0442\u0438 \u043f\u043e\u0434\u0430\u0442\u043a\u0435 \u0437\u0430 \u0410\u0421\u041d.1 (ASN.1).  \u041d\u0430\u0437\u043d\u0430\u0447\u0435\u043d\u0438 \u043e\u0431\u0440\u0430\u0437\u0430\u0446 \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_CRL_NOT_FOUND=\u041d\u0438\u0458\u0435\u0434\u0430\u043d \u043e\u0434\u0433\u043e\u0432\u0430\u0440\u0430\u0458\u0443\u045b\u0438 \u0426\u0420\u041b (CRL) \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u043d\u0430\u0452\u0435\u043d.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=\u041f\u043e\u043a\u0443\u0448\u0430\u0432\u0430\u0442\u0435 \u0434\u0430 \u0443\u0432\u0435\u0437\u0435\u0442\u0435 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u043a\u043e\u0458\u0438 \u0438\u043c\u0430 \u0438\u0441\u0442\u043e\u0433 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0430 \u0438 \u0441\u0435\u0440\u0438\u0458\u0441\u043a\u0438 \u0431\u0440\u043e\u0458 \u043a\u0430\u043e \u043f\u043e\u0441\u0442\u043e\u0458\u0435\u045b\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442, \u0430\u043b\u0438 \u0442\u0430 \u0434\u0432\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u043d\u0438\u0441\u0443 \u0438\u0434\u0435\u043d\u0442\u0438\u0447\u043d\u0430.
SEC_ERROR_BUSY=\u041d\u0421\u0421 (NSS) \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u0430\u043e \u0434\u0430 \u0431\u0443\u0434\u0435 \u0438\u0441\u043a\u0459\u0443\u0447\u0435\u043d.  \u041e\u0431\u0458\u0435\u043a\u0442\u0438 \u0441\u0435 \u0438 \u0434\u0430\u0459\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0435.
SEC_ERROR_EXTRA_INPUT=\u041f\u043e\u0440\u0443\u043a\u0430 \u043a\u043e\u0434\u0438\u0440\u0430\u043d\u0430 \u043f\u043e\u043c\u043e\u045b\u0443 \u0414\u0415\u0420\u0430 (DER) \u0441\u0430\u0434\u0440\u0436\u0430\u043b\u0430 \u0458\u0435 \u0432\u0438\u0448\u0430\u043a \u043d\u0435\u0438\u0441\u043a\u043e\u0440\u0438\u0448\u045b\u0435\u043d\u0438\u0445 \u043f\u043e\u0434\u0430\u0442\u0430\u043a\u0430.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=\u041d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0430 \u0435\u043b\u0438\u043f\u0442\u0438\u0447\u043a\u0430 \u043a\u0440\u0438\u0432\u0430.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=\u041d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d \u0442\u0430\u0447\u043a\u0430\u0441\u0442 \u043e\u0431\u043b\u0438\u043a \u0435\u043b\u0438\u043f\u0442\u0438\u0447\u043a\u0435 \u043a\u0440\u0438\u0432\u0435.
SEC_ERROR_UNRECOGNIZED_OID=\u041d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u0438\u0434\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440 \u043e\u0431\u0458\u0435\u043a\u0430\u0442\u0430.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=\u041d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d \u041e\u0426\u0421\u041f (OCSP) \u043f\u043e\u0442\u043f\u0438\u0441\u043d\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0443 \u041e\u0426\u0421\u041f (OCSP) \u043e\u0434\u0433\u043e\u0432\u043e\u0440\u0443.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=\u0421\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0458\u0435 \u043e\u043f\u043e\u0437\u0432\u0430\u043d \u043f\u043e\u043c\u043e\u045b\u0443 \u0438\u0437\u0434\u0430\u0432\u0430\u0447\u0435\u0432\u043e\u0433 \u0441\u043f\u0438\u0441\u043a\u0430 \u043e\u043f\u043e\u0437\u0432\u0430\u043d\u0438\u0445 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=\u0418\u0437\u0434\u0430\u0432\u0430\u0447\u0435\u0432 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0437\u0430 \u041e\u0426\u0421\u041f (OCSP) \u0458\u0435 \u043e\u043f\u043e\u0437\u0432\u0430\u043d.
SEC_ERROR_CRL_INVALID_VERSION=\u0418\u0437\u0434\u0430\u0432\u0430\u0447\u0435\u0432 \u0441\u043f\u0438\u0441\u0430\u043a \u043e\u043f\u043e\u0437\u0432\u0430\u043d\u0438\u0445 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 (\u0426\u0420\u041b, CRL) \u043d\u043e\u0441\u0438 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u0431\u0440\u043e\u0458 \u0438\u0437\u0434\u0430\u045a\u0430.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=\u0418\u0437\u0434\u0430\u0432\u0430\u0447\u0435\u0432 \u0441\u043f\u0438\u0441\u0430\u043a \u043e\u043f\u043e\u0437\u0432\u0430\u043d\u0438\u0445 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u04121 (V1) \u0438\u043c\u0430 \u043a\u0440\u0438\u0442\u0447\u043d\u043e \u043f\u0440\u043e\u0434\u0443\u0436\u0435\u045a\u0435.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=\u0418\u0437\u0434\u0430\u0432\u0430\u0447\u0435\u0432 \u0441\u043f\u0438\u0441\u0430\u043a \u043e\u043f\u043e\u0437\u0432\u0430\u043d\u0438\u0445 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430 \u04122 (V2) \u0438\u043c\u0430 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u043e \u043a\u0440\u0438\u0442\u0447\u043d\u043e \u043f\u0440\u043e\u0434\u0443\u0436\u0435\u045a\u0435.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=\u041d\u0430\u0437\u043d\u0430\u0447\u0435\u043d\u0430 \u0458\u0435 \u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u0430 \u0432\u0440\u0441\u0442\u0430 \u043e\u0431\u0458\u0435\u043a\u0442\u0430.
SEC_ERROR_INCOMPATIBLE_PKCS11=\u0414\u0440\u0430\u0458\u0432\u0435\u0440 \u0437\u0430 \u041f\u041a\u0426\u0421 \#11 (PKCS \#11) \u043d\u0430\u0440\u0443\u0448\u0430\u0432\u0430 \u0441\u043f\u0435\u0446\u0438\u0444\u0438\u043a\u0430\u0446\u0438\u0458\u0443 \u043d\u0430 \u043d\u0435\u0441\u0430\u0433\u043b\u0430\u0441\u0430\u043d \u043d\u0430\u0447\u0438\u043d.
SEC_ERROR_NO_EVENT=\u0422\u0440\u0435\u043d\u0443\u0442\u043d\u043e \u043d\u0435 \u043f\u043e\u0441\u0442\u043e\u0458\u0438 \u043d\u0438\u0458\u0435\u0434\u0430\u043d \u0441\u043b\u043e\u0431\u043e\u0434\u0430\u043d \u043f\u0440\u043e\u0440\u0435\u0437.
SEC_ERROR_CRL_ALREADY_EXISTS=\u0426\u0420\u041b (CRL) \u0432\u0435\u045b \u043f\u043e\u0441\u0442\u043e\u0458\u0438.
SEC_ERROR_NOT_INITIALIZED=\u041d\u0421\u0421 (NSS) \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u043e\u0441\u0442\u0430\u0432\u0459\u0435\u043d.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=\u0414\u0435\u0458\u0441\u0442\u0432\u043e \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e \u0458\u0435\u0440 \u043d\u043e\u0432\u0447\u0438\u045b \u0437\u0430 \u041f\u041a\u0426\u0421 \#11 (PKCS \#11) \u043d\u0438\u0458\u0435 \u043f\u0440\u0438\u0458\u0430\u0432\u0459\u0435\u043d.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=\u041f\u043e\u0434\u0435\u0448\u0435\u043d \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442 \u0440\u0435\u0441\u043f\u043e\u043d\u0434\u0435\u0440\u0430 \u0437\u0430 \u041e\u0426\u0421\u041f (OCSP) \u0458\u0435 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438.
SEC_ERROR_OCSP_BAD_SIGNATURE=\u041e\u0434\u0433\u043e\u0432\u043e\u0440 \u0437\u0430 \u041e\u0426\u0421\u041f (OCSP) \u0438\u043c\u0430 \u043d\u0435\u0432\u0430\u0436\u0435\u045b\u0438 \u043f\u043e\u0442\u043f\u0438\u0441.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Cert validation \u043f\u0440\u0435\u0442\u0440\u0430\u0433\u0430 \u0458\u0435 \u0432\u0430\u043d \u043c\u043e\u0433\u0443\u045b\u043d\u043e\u0441\u0442\u0438 \u043f\u0440\u0435\u0442\u0440\u0430\u0436\u0438\u0432\u0430\u045a\u0430.
SEC_ERROR_INVALID_POLICY_MAPPING=Policy mapping \u0441\u0430\u0434\u0440\u0436\u0438 anypolicy.
SEC_ERROR_POLICY_VALIDATION_FAILED=Cert chain \u043d\u0438\u0458\u0435 \u043f\u0440\u043e\u0448\u0430\u043e \u043f\u043e\u0442\u0432\u0440\u0434\u0443 \u043f\u043e\u043b\u0438\u0442\u0438\u043a\u0435.
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=\u041d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u0442\u0438\u043f \u043b\u043e\u043a\u0430\u0446\u0438\u0458\u0435 \u0443 cert AIA \u0442\u0438\u043f\u0443 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0435.
SEC_ERROR_BAD_HTTP_RESPONSE=\u0421\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e \u043b\u043e\u0448 HTTP \u043e\u0434\u0433\u043e\u0432\u043e\u0440.
SEC_ERROR_BAD_LDAP_RESPONSE=\u0421\u0435\u0440\u0432\u0435\u0440 \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e \u043b\u043e\u0448 LDAP \u043e\u0434\u0433\u043e\u0432\u043e\u0440.
SEC_ERROR_FAILED_TO_ENCODE_DATA=\u041d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e \u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 \u0441\u0430 ASN1 \u0443\u0440\u0435\u0452\u0430\u0458\u0435\u043c \u0437\u0430 \u043a\u043e\u0434\u0438\u0440\u0430\u045a\u0435.
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=\u041b\u043e\u043a\u0430\u0446\u0438\u0458\u0430 \u0437\u0430 \u043f\u0440\u0438\u0441\u0442\u0443\u043f \u043f\u043e\u0434\u0430\u0446\u0438\u043c\u0430 \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430 \u0443 \u0435\u043a\u0441\u0442\u0435\u043d\u0437\u0438\u0458\u0438 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430
SEC_ERROR_LIBPKIX_INTERNAL=\u0414\u043e\u0448\u043b\u043e \u0458\u0435 \u0434\u043e \u0443\u043d\u0443\u0442\u0440\u0430\u0448\u045a\u0435 Libpkix \u0433\u0440\u0435\u0448\u043a\u0435 \u0442\u043e\u043a\u043e\u043c \u043f\u043e\u0442\u0432\u0440\u0452\u0438\u0432\u0430\u045a\u0430 cert-\u0430.
SEC_ERROR_PKCS11_GENERAL_ERROR=PKCS \#11 \u043c\u043e\u0434\u0443\u043b \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e CKR_GENERAL_ERROR, \u0448\u0442\u043e \u0437\u043d\u0430\u0447\u0438 \u0434\u0430 \u0458\u0435 \u0434\u043e\u0448\u043b\u043e \u0434\u043e \u043d\u0435\u043f\u043e\u0432\u0440\u0430\u0442\u043d\u0435 \u0433\u0440\u0435\u0448\u043a\u0435.
SEC_ERROR_PKCS11_FUNCTION_FAILED=PKCS \#11 \u043c\u043e\u0434\u0443\u043b \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e CKR_FUNCTION_FAILED, \u0448\u0442\u043e \u0437\u043d\u0430\u0447\u0438 \u0434\u0430 \u0442\u0440\u0430\u0436\u0435\u043d\u0430 \u0444\u0443\u043d\u043a\u0446\u0438\u0458\u0430 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0438\u0442\u0438 \u0438\u0437\u0432\u0435\u0434\u0435\u043d\u0430. \u041c\u043e\u0436\u0434\u0430 \u045b\u0435 \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0458\u0430 \u0443\u0441\u043f\u0435\u0442\u0438 \u0438\u0437 \u043d\u043e\u0432\u043e\u0433 \u043f\u043e\u043a\u0443\u0448\u0430\u0458\u0430.
SEC_ERROR_PKCS11_DEVICE_ERROR=PKCS \#11 \u043c\u043e\u0434\u0443\u043b \u0458\u0435 \u0432\u0440\u0430\u0442\u0438\u043e CKR_DEVICE_ERROR, \u0448\u0442\u043e \u0437\u043d\u0430\u0447\u0438 \u0434\u0430 \u0458\u0435 \u0434\u043e\u0448\u043b\u043e \u0434\u043e \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0441\u0430 \u0442\u043e\u043a\u0435\u043d\u043e\u043c \u0438\u043b\u0438 \u0441\u043b\u043e\u0442\u043e\u043c.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=\u041d\u0435\u043f\u043e\u0437\u043d\u0430\u0442 \u043c\u0435\u0442\u043e\u0434 \u043f\u0440\u0438\u0441\u0442\u0443\u043f\u0430 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0458\u0438 \u0443 \u043e\u0437\u043d\u0430\u0446\u0438 \u0442\u0438\u043f\u0430 \u0441\u0435\u0440\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u0430.
SEC_ERROR_CRL_IMPORT_FAILED=\u0413\u0440\u0435\u0448\u043a\u0430 \u043f\u0440\u0438\u043b\u0438\u043a\u043e\u043c \u043f\u043e\u043a\u0443\u0448\u0430\u0458\u0430 \u0443\u0432\u043e\u0437\u0430 CRL-\u0430.
SEC_ERROR_EXPIRED_PASSWORD=The password expired.
SEC_ERROR_LOCKED_PASSWORD=The password is locked.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Unknown PKCS \#11 error.
SEC_ERROR_BAD_CRL_DP_URL=Invalid or unsupported URL in CRL distribution point name.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=The certificate was signed using a signature algorithm that is disabled because it is not secure.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

