#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Varna komunikacija ni mo\u017ena. Vrstnik ne podpira visoke stopnje \u0161ifriranja.
SSL_ERROR_US_ONLY_SERVER=Varna komunikacija ni mo\u017ena. Vrstnik zahteva visoko stopnjo \u0161ifriranja, ki ni na voljo.
SSL_ERROR_NO_CYPHER_OVERLAP=Varna komunikacija z vrstnikom ni mogo\u010da\: na voljo ni skupnih \u0161ifrirnih algoritmov.
SSL_ERROR_NO_CERTIFICATE=Ni mogo\u010de najti digitalnega potrdila ali klju\u010da, potrebega za overjanje.
SSL_ERROR_BAD_CERTIFICATE=Varna komunikacija z vrstnikom ni mogo\u010da\: digitalno potrdilo vrstnika je zavrnjeno.
SSL_ERROR_UNUSED_5=Neznana koda napake SSL.
SSL_ERROR_BAD_CLIENT=Stre\u017enik je prejel slabe podatke od odjemalca.
SSL_ERROR_BAD_SERVER=Odjemalec je prejel slabe podatke od stre\u017enika.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Nepodprt tip digitalnega potrdila.
SSL_ERROR_UNSUPPORTED_VERSION=Vrstnik uporablja nepodprto razli\u010dico varnostnega protokola.
SSL_ERROR_UNUSED_10=Neznana koda napake SSL.
SSL_ERROR_WRONG_CERTIFICATE=Overjanje odjemalca je spodletelo\: zasebni klju\u010d v podatkovni bazi klju\u010dev se ne ujema z javnim klju\u010dem v podatkovni bazi digitalnih potrdil.
SSL_ERROR_BAD_CERT_DOMAIN=Varna komunikacija z vrstnikom ni mogo\u010da\: zahtevano domensko ime se ne ujema z digitalnim potrdilom stre\u017enika.
SSL_ERROR_POST_WARNING=Neznana koda napake SSL.
SSL_ERROR_SSL2_DISABLED=Vrstnik podpira le SSL razli\u010dico 2, ki je krajevno onemogo\u010dena.
SSL_ERROR_BAD_MAC_READ=SSL je prejel zapis z neustrezno avtorizacijsko kodo sporo\u010dila.
SSL_ERROR_BAD_MAC_ALERT=SSL vrstnik sporo\u010da neustrezno avtorizacijsko kodo sporo\u010dila.
SSL_ERROR_BAD_CERT_ALERT=SSL vrstnik ne more preveriti va\u0161ega digitalnega potrdila.
SSL_ERROR_REVOKED_CERT_ALERT=SSL vrstnik je zavrnil va\u0161e digitalno potrdilo kot preklicano.
SSL_ERROR_EXPIRED_CERT_ALERT=SSL vrstnik je zavrnil va\u0161e digitalno potrdilo kot prete\u010deno.
SSL_ERROR_SSL_DISABLED=Povezava ni mogo\u010da\: SSL je onemogo\u010den.
SSL_ERROR_FORTEZZA_PQG=Povezana ni mogo\u010da\: SSL vrstnik spada v drugo FORTEZZA domeno.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Zahtevana je bila neznana razli\u010dica SSL \u0161ifrirne programske opreme.
SSL_ERROR_NO_CIPHERS_SUPPORTED=V tem programu ni prisotne in omogo\u010dene \u0161ifrirne programske opreme.
SSL_ERROR_BAD_BLOCK_PADDING=SSL je prejel zapis z neveljavnim blokom bitnega zapolnjevanja.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL je prejel zapis, ki presega najve\u010djo dovoljeno dol\u017eino.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL je poskusil poslati zapis, ki presega najve\u010djo dovoljeno dol\u017eino.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL je prejel nepravilno Hello Request sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL je prejel nepravilno Client Hello sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL je prejel nepravilno Server Hello sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL je prejel nepravilno Certifikate Hello sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL je prejel nepravilno Server Key Exchange sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL je prejel nepravilno Certifikate Request sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL je prejel nepravilno Server Hello Done sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL je prejel nepravilno Certificate Verify sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL je prejel nepravilno Client Key Exchange sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL je prejel nepravilno Finished sporo\u010dilo rokovanja.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL je prejel nepravilen Change Cipher Spec zapis.
SSL_ERROR_RX_MALFORMED_ALERT=SSL je prejel nepravilen Alert zapis.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL je prejel nepravilen Handshake zapis.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL je prejel nepravilen Application Data zapis.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL je prejel nepri\u010dakovano Hello Request sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL je prejel nepri\u010dakovano Client Hello sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL je prejel nepri\u010dakovano Server Hello sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL je prejel nepri\u010dakovano Certificate sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL je prejel nepri\u010dakovano Server Exchange Key sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL je prejel nepri\u010dakovano Certificate Request sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL je prejel nepri\u010dakovano Server Hello Done sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL je prejel nepri\u010dakovano Certificate Verify sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL je prejel nepri\u010dakovano Client Key Exchange sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL je prejel nepri\u010dakovano Finished sporo\u010dilo rokovanja.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL je prejel nepri\u010dakovan Change Cipher Spec zapis.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL je prejel nepri\u010dakovan Alert zapis.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL je prejel nepri\u010dakovan Handshake zapis.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL je prejel nepri\u010dakovan Application Data zapis.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL je prejel zapis z nepoznano vsebino.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL je prejel sporo\u010dilo rokovanja z neznanim tipom sporo\u010dila.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL je prejel zapis opozorila z neznanim opisom opozorila.
SSL_ERROR_CLOSE_NOTIFY_ALERT=SSL vrstnik je zaprl to povezavo.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=SSL vrstnik ni pri\u010dakoval sporo\u010dila rokovanja ki ga je prejel.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=SSL vrstnik ni uspel raz\u0161iriti SSL zapisa, ki ga je prejel.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=SSL vrstniku pri pogajanju ni uspelo dobiti sprejemljivega nabora varnostnih parametrov.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=SSL vrstnik je zaradi neprejemljive vsebine zavrnil sporo\u010dilo rokovanja.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=SSL vrstnik ne podpira tipa digitalnih potrdil, ki jih je prejel.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=SSL vrstnik je imel neznano te\u017eavo s prejetimi digitalnimi potrdili.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL je do\u017eivel napako generatorja naklju\u010dnih \u0161tevil.
SSL_ERROR_SIGN_HASHES_FAILURE=Podatkov potrebnih za preverjanje va\u0161ega digitalnega potrdila ni mo\u017eno digitalno podpisati.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL ni uspel izvle\u010di javnega klju\u010da iz digitalnega potrdila vrstnika.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Med obdelovanjem SSL Server Key rokovanja se je pojavila neznana napaka.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Med obdelovanjem SSL Client Key Exchange rokovanja se je pojavila neznana napaka.
SSL_ERROR_ENCRYPTION_FAILURE=Bulk data \u0161ifrirni algoritem je naletel na napako v izbrani \u0161ifrirni programski opremi.
SSL_ERROR_DECRYPTION_FAILURE=Bulk data de\u0161ifrirni algoritem je naletel na napako v izbrani \u0161ifrirni programski opremi.
SSL_ERROR_SOCKET_WRITE_FAILURE=Poskus pisanja podatkov v vti\u010d ni uspel.
SSL_ERROR_MD5_DIGEST_FAILURE=MD5 digest funkcija ni uspela.
SSL_ERROR_SHA_DIGEST_FAILURE=SHA-1 digest funkcija ni uspela.
SSL_ERROR_MAC_COMPUTATION_FAILURE=MAC izra\u010dun ni uspel.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Napaka pri kreiranju Symmetric Key konteksta.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Neuspelo odvijanje Symmetric Key v Client Exchange Key sporo\u010dilu.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=SSL stre\u017enik je poskusil uporabiti javni klju\u010d z nizko stopnjo \u0161ifriranja pri izvozu \u0161ifrirne programske opreme.
SSL_ERROR_IV_PARAM_FAILURE=PKCS11 koda ni prevedla IV v parameter.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Neuspeh pri inicializiranju izbrane \u0161ifrirne programske opreme.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Odjemalcu ni uspelo generiranje klju\u010dev za SSL sejo.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Stre\u017enik nima klju\u010da za nameravan algoritem izmenjave klju\u010dev.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=PKCS\#11 \u017eeton je bil med trajanjem operacije vstavljen ali odstranjen.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Za zahtevano operacijo ni bilo mo\u017eno najti PKCS\#11 \u017eetona.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Varna komunikacija z odjemalcem ni mogo\u010da\: ni skupnih \u0161ifrirnih algoritmov.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Ni mo\u017eno za\u010deti novega SSL rokovanja, dokler se trenutno rokovanje ne zaklju\u010di.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Od vrstnika sem prejel nepravilne vrednosti izvle\u010dka rokovanja.
SSL_ERROR_CERT_KEA_MISMATCH=Prejetega digitalnega potrdila ni mogo\u010de uporabiti z izbranim algoritmom izmenjave klju\u010dev.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Nobenemu overitelju mi mogo\u010de zaupati za overjanje odjemalca SSL.
SSL_ERROR_SESSION_NOT_FOUND=ID SSL seje odjemalca ni v stre\u017enikovem predpomnilniku sej.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Vrstniku ni uspelo de\u0161ifrirati prejetega SSL zapisa.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Vrstnik je prejel SSL zapis, ki je dalj\u0161i od dovoljenega.
SSL_ERROR_UNKNOWN_CA_ALERT=Vrstnik ne prepozna in ne zaupa CA, ki je izdala va\u0161e digitalno potrdilo.
SSL_ERROR_ACCESS_DENIED_ALERT=Vrstnik je prejel veljavno digitalno potrdilo, vendar je zavrnil dostop.
SSL_ERROR_DECODE_ERROR_ALERT=Vrstniku ni uspelo de\u0161ifrirati SSL sporo\u010dila rokovanja.
SSL_ERROR_DECRYPT_ERROR_ALERT=Vrstnik sporo\u010da napako pri preverjanju podpisa ali izmenjavi klju\u010dev.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Vrstnik sporo\u010da, da pogajanje ni v skladu s pravili izvoza.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Vrstnik sporo\u010da nezdru\u017eljivo ali nepodprto razli\u010dico protokola.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Stre\u017enik zahteva varnej\u0161e \u0161ifrirne algoritme, kot jih podpirajo odjemalci.
SSL_ERROR_INTERNAL_ERROR_ALERT=Vrstnik sporo\u010da, da je naletel na notranjo napako.
SSL_ERROR_USER_CANCELED_ALERT=Uporabnik vrstnika je preklical rokovanje.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Vrstnik ne dovoli ponovnega pogajanja SSL varnostnih parametrov.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=SSL stre\u017eni\u0161ki predpomnilnik ni nastavljen in ni onemogo\u010den za ta vti\u010d.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=SSL vrstnik ne podpira zahtevanih TLS hello raz\u0161iritev.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=SSL vrstnik ni mogel prevzeti va\u0161ega digitalnega potrdila s podanega URL-ja.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=SSL vrstnik nima digitalnega potrdila za zahtevan DNS zapis.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=SSL vrstnik ni mogel dobiti OCSP odziva za svoje digitalno potrdilo.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=SSL vrstnik je sporo\u010dil neveljavno vrednost izvle\u010dka digitalnega potrdila.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL je ob rokovanju prejel nepri\u010dakovano sporo\u010dilo New Session Ticket.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL je ob rokovanju prejel po\u0161kodovano sporo\u010dilo New Session Ticket.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL je prejel stisnjen zapis, ki ga ni mogo\u010de odpakirati.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Naj tej vti\u010dnici SSL ponovno pogajanje ni dovoljeno.
SSL_ERROR_UNSAFE_NEGOTIATION=Vrstnik je posku\u0161al izvesti zastareli na\u010din rokovanja, ki je lahko nevaren.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL je prejel nepri\u010dakovan stisnjeni zapis.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL je prejel \u0161ibak kratkotrajen klju\u010d Diffie-Hellman v sporo\u010dilu rokovanja pri izmenjavi klju\u010dev.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL je prejel neveljavne podatke za raz\u0161iritev NPN.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Zmogljivost SSL, ki je povezave SSL 2.0 ne podpirajo.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Zmogljivost SSL, ki je stre\u017eniki ne podpirajo.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Zmogljivost SSL, ki je odjemalci ne podpirajo.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Med varnostnim preverjanjem je pri\u0161lo do I/O napake.
SEC_ERROR_LIBRARY_FAILURE=napaka varnostne knji\u017enice.
SEC_ERROR_BAD_DATA=varnosta knji\u017enica\: prejeti so bili neveljavni podatki
SEC_ERROR_OUTPUT_LEN=varnostna knji\u017enica\: napaka pri dol\u017eini izhoda.
SEC_ERROR_INPUT_LEN=varnostna knji\u017enica je zaznala napako pri dol\u017eini vhoda.
SEC_ERROR_INVALID_ARGS=varnostna knji\u017enica\: napa\u010dni argumenti.
SEC_ERROR_INVALID_ALGORITHM=varnostna knji\u017enica\: napa\u010den algoritem.
SEC_ERROR_INVALID_AVA=varnostna knji\u017enica\: napa\u010den AVA.
SEC_ERROR_INVALID_TIME=Nepravilno oblikovan \u010dasovni niz.
SEC_ERROR_BAD_DER=varnostna knji\u017enica\: nepravilno oblikovano DER-\u0161ifrirano sporo\u010dilo.
SEC_ERROR_BAD_SIGNATURE=Vrstnikovo digitalno potrdilo ima neveljaven podpis.
SEC_ERROR_EXPIRED_CERTIFICATE=Vrstnikovo digitalno potrdilo je preteklo.
SEC_ERROR_REVOKED_CERTIFICATE=Vrstnikovo digitalno potrdilo je preklicano.
SEC_ERROR_UNKNOWN_ISSUER=Izdajatelj vrstnikovega digitalnega potrdila ni prepoznan.
SEC_ERROR_BAD_KEY=Vrstnikov javi klju\u010d ni veljaven.
SEC_ERROR_BAD_PASSWORD=Vne\u0161eno varnostno geslo je nepravilno.
SEC_ERROR_RETRY_PASSWORD=Novo geslo je vne\u0161eno nepravilno. Poskusite znova.
SEC_ERROR_NO_NODELOCK=varnostna knji\u017enica\: vozli\u0161\u010de ni zaklenjeno.
SEC_ERROR_BAD_DATABASE=varnostna knji\u017enica\: neveljavna podatkovna baza.
SEC_ERROR_NO_MEMORY=varnostna knji\u017enica\: napaka pri dodeljevanju pomnilnika.
SEC_ERROR_UNTRUSTED_ISSUER=Uporabnik je ozna\u010dil, da ne zaupa izdajatelju digitalnega potrdila za vrstnika.
SEC_ERROR_UNTRUSTED_CERT=Uporabnik je ozna\u010dil, da ne zaupa digitalnemu potrdilu vrstnika.
SEC_ERROR_DUPLICATE_CERT=Digitalno potrdilo \u017ee obstaja v va\u0161i podatkovni bazi.
SEC_ERROR_DUPLICATE_CERT_NAME=Ime prenesenega digitalnega potrdila se podvaja z zapisom v va\u0161i podatkovni bazi.
SEC_ERROR_ADDING_CERT=Napaka pri dodajanju digitalnega potrdila v podatkovno bazo.
SEC_ERROR_FILING_KEY=Napaka pri ponovnem polnjenju klju\u010da za to digitalno potrdilo.
SEC_ERROR_NO_KEY=Zasebnega klju\u010da za to digitalno potrdilo ni mogo\u010de najti v podatkovni bazi klju\u010dev.
SEC_ERROR_CERT_VALID=Digitalno potrdilo je veljavno.
SEC_ERROR_CERT_NOT_VALID=Digitalno potrdilo ni veljavno.
SEC_ERROR_CERT_NO_RESPONSE=Knji\u017enica digitalnih potrdil\: Ni odziva.
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Digitalno potrdilo izdajatelja digitalnih potrdil je preteklo. Preverite sistemski \u010das in datum.
SEC_ERROR_CRL_EXPIRED=CPS izdajatelja digitalnega potrdila je pretekel. Posodobite ali preverite sistemski \u010das in datum.
SEC_ERROR_CRL_BAD_SIGNATURE=CPS izdajatelja digitalnega potrdila ima nepravilen podpis.
SEC_ERROR_CRL_INVALID=Novi CRL ima nepravilno obliko.
SEC_ERROR_EXTENSION_VALUE_INVALID=Raz\u0161iritvena vrednost digitalnega potrdila je nepravilna.
SEC_ERROR_EXTENSION_NOT_FOUND=Raz\u0161iritve digitalnega potrdila ni mogo\u010de najti.
SEC_ERROR_CA_CERT_INVALID=Digitalno potrdilo izdajatelja je nepravilno.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Omejitev dol\u017eine poti do digitalnega potrdila je nepravilna.
SEC_ERROR_CERT_USAGES_INVALID=Polje uporab digitalnega potrdila je nepravilno.
SEC_INTERNAL_ONLY=**SAMO interni modul**
SEC_ERROR_INVALID_KEY=Klju\u010d ne podpira zahtevane operacije.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Digitalno potrdilo vsebuje nepoznano kriti\u010dno raz\u0161iritev.
SEC_ERROR_OLD_CRL=Nov CPS nima kasnej\u0161ega datuma kot trenutni.
SEC_ERROR_NO_EMAIL_CERT=Ni \u0161ifrirano ali podpisano\: nimate \u0161e digitalnega potrdila za elektronsko po\u0161to.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Ni \u0161ifrirano\: nimate digitalnih potrdil za vse prejemnike.
SEC_ERROR_NOT_A_RECIPIENT=De\u0161ifriranje ni mo\u017eno\: niste prejemnik ali pa ne morem najti ustreznega digitalnega potrdila in zasebnega klju\u010da.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=De\u0161ifriranje ni mo\u017eno\: algoritem za \u0161ifriranje klju\u010da se ne ujema z va\u0161im digitalnim potrdilom.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Preverjanje podpisa ni uspelo\: ne morem najti podpisovalca, preve\u010d podpisovalcev najdenih ali pa so podatki neustrezni oziroma pokvarjeni.
SEC_ERROR_UNSUPPORTED_KEYALG=Nepodprt ali nepoznan algoritem klju\u010da.
SEC_ERROR_DECRYPTION_DISALLOWED=De\u0161ifriranje ni mo\u017eno\: sporo\u010dilo je \u0161ifrirano z uporabi nedovoljenega algoritma oziroma nedovoljeno dol\u017eino klju\u010da.
XP_SEC_FORTEZZA_BAD_CARD=Fortezza kartica ni bila pravilno inicializirana. Odstranite jo in jo vrnite va\u0161emu izdajatelju kartice.
XP_SEC_FORTEZZA_NO_CARD=Nisem na\u0161el Fortezza kartice.
XP_SEC_FORTEZZA_NONE_SELECTED=Fortezza kartica ni izbrana.
XP_SEC_FORTEZZA_MORE_INFO=Prosimo, izberite osebnost, da dobite ve\u010d podatkov o
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Osebnost ni najdena.
XP_SEC_FORTEZZA_NO_MORE_INFO=Ni dodatnih informacij o osebnosti.
XP_SEC_FORTEZZA_BAD_PIN=Napa\u010dna PIN koda.
XP_SEC_FORTEZZA_PERSON_ERROR=Inicializacija Fortezza osebnosti ni uspela.
SEC_ERROR_NO_KRL=KRL za ceritifikat te strani ni najden.
SEC_ERROR_KRL_EXPIRED=KRL za digitalno potrdilo te strani je potekel.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL za digitalno potrdilo te strani ima nepravilen podpis.
SEC_ERROR_REVOKED_KEY=Klju\u010d za digitalno potrdilo te strani je preklican.
SEC_ERROR_KRL_INVALID=Nov KRL vsebuje nepravilne podatke.
SEC_ERROR_NEED_RANDOM=varnostna knji\u017enica\: potrebujem naklju\u010dne podatke.
SEC_ERROR_NO_MODULE=varnostna knji\u017enica\: noben izmed varnostnih modulov ne more izvesti zahtevane operacije.
SEC_ERROR_NO_TOKEN=Varnosta kratica ali \u017eeton ne obstaja\: potrebna je ponovna inicializacija ali je bila odstranjena.
SEC_ERROR_READ_ONLY=varnostna knji\u017enica\: podatkovno bazo je mogo\u010de samo brati.
SEC_ERROR_NO_SLOT_SELECTED=Niste izbrali \u017eetona ali re\u017ee.
SEC_ERROR_CERT_NICKNAME_COLLISION=Digitalno potrdilo s tem vzdevkom \u017ee obstaja.
SEC_ERROR_KEY_NICKNAME_COLLISION=Klju\u010d s tem vzdevkom \u017ee obstaja.
SEC_ERROR_SAFE_NOT_CREATED=napaka med kreiranjem varnega objekta
SEC_ERROR_BAGGAGE_NOT_CREATED=napaka med kreiranjem prtlja\u017enega objekta
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Ni mo\u017eno odstraniti predstojnika
XP_JAVA_DELETE_PRIVILEGE_ERROR=Ni mo\u017eno izbrisati privilegija
XP_JAVA_CERT_NOT_EXISTS_ERROR=Predstojnik nima digitalnega potrdila
SEC_ERROR_BAD_EXPORT_ALGORITHM=Zahtevan algoritem ni dovoljen.
SEC_ERROR_EXPORTING_CERTIFICATES=Napaka med poskusom izvoza digitalnega potrdila.
SEC_ERROR_IMPORTING_CERTIFICATES=Napaka med poskusom uvoza digitalnega potrdila.
SEC_ERROR_PKCS12_DECODING_PFX=Uvoz ni mo\u017een. Napake med de\u0161ifriranjem. Datoteka je nepravilna.
SEC_ERROR_PKCS12_INVALID_MAC=Uvoz ni mo\u017een. Napa\u010den MAC. Napa\u010dno geslo ali pokvarjena datoteka.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Uvoz ni mo\u017een. MAC algoritem ni podprt.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Uvoz ni mo\u017een. Podprta sta samo neokrnjenost gesla in zasebni na\u010dini.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Uvoz ni mo\u017een. Struktura datoteke je pokvarjena.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Uvoz ni mo\u017een. \u0160ifrirni algoritem ni podprt.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Uvoz ni mo\u017een. Razli\u010dica datoteke ni podprta.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Uvoz ni mo\u017een. Nepravilno zasebno geslo.
SEC_ERROR_PKCS12_CERT_COLLISION=Uvoz ni mo\u017een. Vzdevek \u017ee obstaja v podatkovni bazi.
SEC_ERROR_USER_CANCELLED=Uporabnik je izbral prekli\u010di.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Uvoz preklican, vnos v bazi \u017ee obstaja.
SEC_ERROR_MESSAGE_SEND_ABORTED=Sporo\u010dilo ni poslano.
SEC_ERROR_INADEQUATE_KEY_USAGE=Uporaba klju\u010da digitalnega potrdila ne zadostuje za \u017eeleno operacijo.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tip digitalnega potrdila ni odobren za aplikacijo.
SEC_ERROR_CERT_ADDR_MISMATCH=Naslov v digitalnem potrdilu za podpis se ne ujema z naslovom v glavi sporo\u010dila.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Uvoz ni mo\u017een. Napaka med poskusom uvoza zasebnega klju\u010da.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Uvoz ni mo\u017een. Napaka med poskusom uvoza verige digitalnih potrdil.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Izvoz ni mo\u017een. Iskanje digitalnega potrdila ali klju\u010da po vzdevku ni uspelo.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Izvoz ni mo\u017een. Zasebnega klju\u010da ni mogo\u010de najti in izvoziti.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Izvoz ni mo\u017een. Datoteke za izvoz ni mogo\u010de zapisati.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Uvoz ni mo\u017een. Datoteke za uvoz ni mogo\u010de prebrati.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Izvoz ni mo\u017een. Podatkovna baza klju\u010dev je pokvarjena ali izbrisana.
SEC_ERROR_KEYGEN_FAIL=Ne morem ustvariti para javnega in zasebnega klju\u010da.
SEC_ERROR_INVALID_PASSWORD=Vne\u0161eno geslo ni pravilno. Prosimo izberite druga\u010dno geslo.
SEC_ERROR_RETRY_OLD_PASSWORD=Staro geslo je vne\u0161eno nepravilno. Poskusite znova.
SEC_ERROR_BAD_NICKNAME=Vzdevek digitalnega potrdila je \u017ee v uporabi.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Vrstnikova FORTEZZA veriga vsebuje ne-FORTEZZA ceritifkat.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Klju\u010da ni mogo\u010de premakniti v re\u017eo, kjer se ga potrebuje.
SEC_ERROR_JS_INVALID_MODULE_NAME=Napa\u010dno ime modula.
SEC_ERROR_JS_INVALID_DLL=Napa\u010dna pot do modula/ime datoteke
SEC_ERROR_JS_ADD_MOD_FAILURE=Ne morem dodati modula.
SEC_ERROR_JS_DEL_MOD_FAILURE=Ne morem izbrisati modula.
SEC_ERROR_OLD_KRL=Nov KRL nima kasnej\u0161ega datuma kot trenuten.
SEC_ERROR_CKL_CONFLICT=Nov CKL ima drugega izdajatelja kot trenuten. Izbri\u0161ite trenuten CKL.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Certifikatna Avtoriteta za to digitalno potrdilo nima dovoljenje za izdajo digitalnega potrdila s tem imenom.
SEC_ERROR_KRL_NOT_YET_VALID=Seznam preklicanih klju\u010dev za to digitalno potrdilo \u0161e ni veljaven.
SEC_ERROR_CRL_NOT_YET_VALID=Seznam preklicanih digitalnih potrdil za to digitalno potrdilo \u0161e ni veljaven.
SEC_ERROR_UNKNOWN_CERT=Zahtevanega digitalnega potrdila ni mogo\u010de najti.
SEC_ERROR_UNKNOWN_SIGNER=Digitalnega potrdila podpisnika ni mogo\u010de najti.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Naslov stre\u017enika s stanjem digitalnega potrdila je v nepravilnem formatu.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=OCSP odziva ni mogo\u010de v celti de\u0161ifrirati; je nepoznanega tipa.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=OSCP stre\u017enik je vrnil nepri\u010dakovane/neveljavne HTTP podatke.
SEC_ERROR_OCSP_MALFORMED_REQUEST=OCSP stre\u017enik je zahtevek zavrnil kot pokvarjen ali nepravilno oblikovan.
SEC_ERROR_OCSP_SERVER_ERROR=OSCP stre\u017enik je naletel na notranjo napako.
SEC_ERROR_OCSP_TRY_SERVER_LATER=OCSP stre\u017enik predlaga, da ponovno poskusite kasneje.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=OCSP stre\u017enik zahteva podpis za ta zahtevek.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=OCSP stre\u017enik je ta zahtevek zavrnil kot nepoobla\u0161\u010denega,
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=OCSP stre\u017enik je vrnil neprepoznano stanje.
SEC_ERROR_OCSP_UNKNOWN_CERT=OCSP stre\u017enik nima stanja za ta digitalno potrdilo.
SEC_ERROR_OCSP_NOT_ENABLED=Pred to operacijo morate omogo\u010diti OCSP.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Pred to operacijo morate nastaviti privzeti odzivnik OCSP.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Odziv stre\u017enika OCSP je pokvarjen ali nepravilno oblikovan.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Podpisnik odziva OCSP ni poobla\u0161\u010den za dajanje stanja temu digitalnemu potrdilu.
SEC_ERROR_OCSP_FUTURE_RESPONSE=OCSP odziv \u0161e ni veljaven (vsebuje prihodnji datum).
SEC_ERROR_OCSP_OLD_RESPONSE=OCSP odziv vsebuje prete\u010dene podatke.
SEC_ERROR_DIGEST_NOT_FOUND=CMS ali PKCS \#7 Digest nista najdena v podpisanem sporo\u010dilu.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Tipi sporo\u010dila CMS ali PKCS \#7 niso podprti.
SEC_ERROR_MODULE_STUCK=PKCS \#11 modula ni mogo\u010de odstraniti, ker se \u0161e vedno uporablja.
SEC_ERROR_BAD_TEMPLATE=De\u0161ifriranje podatkov ASN.1 ni uspelo. Navedena predloga je nepravilna.
SEC_ERROR_CRL_NOT_FOUND=Ujemajo\u010d CPS ni najden.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Poskusili ste uvoziti digitalno potrdilo z istim izdajatljem in serijsko \u0161tevilko kot obstoje\u010de digitalno potrdilo, ki pa ni isto.
SEC_ERROR_BUSY=NSS se ne more zaustaviti. Objekti so \u0161e zmeraj v uporabi.
SEC_ERROR_EXTRA_INPUT=DER-\u0161ifrirano sporo\u010dilo je vsebovalo dodatne neuporabljene podatke.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Nepodprta elipti\u010dna krivulja.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Nepodprta oblika to\u010dke elipti\u010dne krivulje.
SEC_ERROR_UNRECOGNIZED_OID=Nepoznan identifikator objekta.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Nepravilen OCSP digitalnega potrdila za podpis v OCSP odzivu.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Digitalno potrdilo je preklicano v seznamu preklicanih digitalnih potrdil.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Izdajateljev OCSP odzivnik sporo\u010da, da je digitalno potrdilo preklicano.
SEC_ERROR_CRL_INVALID_VERSION=Seznam preklicanih digitalnih potrdil ima nepoznano \u0161tevilko razli\u010dice.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Izdajateljev seznam preklicanih digitalnih potrdil V1 vsebuje kriti\u010dno raz\u0161iritev.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Izdajateljev seznam preklicanih digitalnih potrdil V2 vsebuje nepoznano kriti\u010dno raz\u0161iritev.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Naveden neznan tip objekta.
SEC_ERROR_INCOMPATIBLE_PKCS11=PKCS \#11 gonilnik kr\u0161i specifikacije na nezdru\u017eljiv na\u010din.
SEC_ERROR_NO_EVENT=V tem trenutku ni na voljo novega dogodka za re\u017eo.
SEC_ERROR_CRL_ALREADY_EXISTS=CPS \u017ee obstaja.
SEC_ERROR_NOT_INITIALIZED=NSS ni inicializiran.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Operacija ni uspela ker PKCS\#11 \u017eeton ni prijavljen.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Nastavljeno digitalno potrdilo OCSP odzivnika ni pravilno.
SEC_ERROR_OCSP_BAD_SIGNATURE=OCSP odziv ima nepravilen podpis.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Iskanje veljavnosti digitalnega potrdila je preseglo omejitve iskanja.
SEC_ERROR_INVALID_POLICY_MAPPING=Mapiranje politike vsebuje vse politike
SEC_ERROR_POLICY_VALIDATION_FAILED=Veriga digitalnih potrdil ima neveljavno politiko
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Neznana vrsta lokacije v raz\u0161iritvi certifikata AIA
SEC_ERROR_BAD_HTTP_RESPONSE=Stre\u017enik je vrnil napa\u010den odgovor HTTP
SEC_ERROR_BAD_LDAP_RESPONSE=Stre\u017enik je vrnil napa\u010den odgovor LDAP
SEC_ERROR_FAILED_TO_ENCODE_DATA=Neuspe\u0161no \u0161ifriranje podatkov z ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Napa\u010dna lokacija dostopa do podatkov v raz\u0161iritvi digitalnega potrdila
SEC_ERROR_LIBPKIX_INTERNAL=Med preverjanjem veljavnosti digitalnega potrdila je pri\u0161lo do napake Libpkix.
SEC_ERROR_PKCS11_GENERAL_ERROR=Modul PKCS \#11 je vrnil CKR_GENERAL_ERROR, torej je pri\u0161lo do napake, ki se je ne da odpraviti.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Modul PKCS \#11 je vrnil CKR_FUNCTION_FAILED, torej zahtevane funkcije ni bilo mogo\u010de izvesti. Ponovitev iste operacije bi lahko bila uspe\u0161na.
SEC_ERROR_PKCS11_DEVICE_ERROR=Modul PKCS \#11 je vrnil CKR_DEVICE_ERROR, torej je pri\u0161lo do napake \u017eetona ali re\u017ee.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Neznana metoda dostopa do podatkov v raz\u0161iritvi digitalnega potrdila.
SEC_ERROR_CRL_IMPORT_FAILED=Napaka pri poskusu uvoza CRL.
SEC_ERROR_EXPIRED_PASSWORD=Geslo je poteklo.
SEC_ERROR_LOCKED_PASSWORD=Geslo je zaklenjeno.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Neznana napaka PKCS \#11.
SEC_ERROR_BAD_CRL_DP_URL=Neznan ali nepodprt URL v imenu to\u010dke za \u0161irjenje CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Sporo\u010dilo je bil podpisano s pomo\u010djo algoritma za podpise, ki je iz varnostnih razlogov onemogo\u010den.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

