#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=\u0410\u0434\u0440\u0435\u0441\u0430 \u043d\u0438\u0458\u0435 \u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0430 \u0438 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0438\u0442\u0438 \u0443\u0447\u0438\u0442\u0430\u043d\u0430.
fileNotFound=\u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u043f\u0440\u043e\u043d\u0430\u0452\u0435 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0443 \u043d\u0430 %S.
dnsNotFound=\u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u043f\u0440\u043e\u043d\u0430\u0452\u0435 \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430 %S.
protocolNotFound=\u0444\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u043d\u0435 \u0437\u043d\u0430 \u043a\u0430\u043a\u043e \u0434\u0430 \u043e\u0442\u0432\u043e\u0440\u0438 \u043e\u0432\u0443 \u0430\u0434\u0440\u0435\u0441\u0443, \u0437\u0430\u0442\u043e \u0448\u0442\u043e \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b (%S) \u043d\u0438\u0458\u0435 \u0434\u043e\u0434\u0435\u0459\u0435\u043d \u043d\u0438 \u0458\u0435\u0434\u043d\u043e\u043c \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0443.
connectionFailure=\u0444\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u043e\u0441\u0442\u0432\u0430\u0440\u0438 \u0432\u0435\u0437\u0443 \u043d\u0430 \u0441\u0435\u0440\u0432\u0435\u0440 \u043d\u0430 %S.
netInterrupt=\u0412\u0435\u0437\u0430 \u0441\u0430 %S  \u0458\u0435 \u043f\u0440\u0435\u043a\u0438\u043d\u0443\u0442\u0430 \u043f\u0440\u0438\u043b\u0438\u043a\u043e\u043c \u0443\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0430 \u0441\u0442\u0440\u0430\u043d\u0435.
netTimeout=\u0421\u0435\u0440\u0432\u0435\u0440 \u043d\u0430 %S \u0437\u0430\u0445\u0442\u0435\u0432\u0430 \u043f\u0440\u0435\u0432\u0438\u0448\u0435 \u0432\u0440\u0435\u043c\u0435\u043d\u0430 \u0434\u0430 \u0441\u0435 \u043e\u0434\u0430\u0437\u043e\u0432\u0435.
redirectLoop=\u0444\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u0458\u0435 \u043f\u0440\u0435\u043f\u043e\u0437\u043d\u0430\u043e \u0434\u0430 \u0441\u0435\u0440\u0432\u0435\u0440 \u043f\u0440\u0435\u0443\u0441\u043c\u0435\u0440\u0430\u0432\u0430 \u0437\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0430\u0434\u0440\u0435\u0441\u043e\u043c \u043d\u0430 \u043d\u0430\u0447\u0438\u043d \u0434\u0430 \u0433\u0430 \u043d\u0438\u043a\u0430\u0434 \u043d\u0435\u045b\u0435 \u0437\u0430\u0432\u0440\u0448\u0438\u0442\u0438.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=\u0414\u0430 \u0431\u0438 \u043e\u0432\u0430 \u0441\u0442\u0440\u0430\u043d\u0430 \u0431\u0438\u043b\u0430 \u043f\u0440\u0438\u043a\u0430\u0437\u0430\u043d\u0430, %S \u043c\u043e\u0440\u0430 \u0434\u0430 \u043f\u043e\u0448\u0430\u0459\u0435 \u043f\u043e\u0434\u0430\u0442\u043a\u0435 \u043a\u043e\u0458\u0438 \u045b\u0435 \u043f\u043e\u043d\u043e\u0432\u0438\u0442\u0438 \u0441\u0432\u0430\u043a\u043e \u0434\u0435\u0458\u0441\u0442\u0432\u043e (\u043f\u043e\u043f\u0443\u0442 \u043f\u0440\u0435\u0442\u0440\u0430\u0433\u0435 \u0438\u043b\u0438 \u043f\u043e\u0442\u0432\u0440\u0434\u0435 \u043d\u0430\u0440\u0443\u045f\u0431\u0435) \u043a\u043e\u0458\u0430 \u0458\u0435 \u043f\u0440\u0435\u0442\u0445\u043e\u0434\u043d\u043e \u0438\u0437\u0432\u0435\u0434\u0435\u043d\u043e.
resendButton.label=\u041f\u043e\u0448\u0430\u0459\u0438 \u043e\u043f\u0435\u0442
unknownSocketType=\u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u043d\u0435 \u0437\u043d\u0430 \u043a\u0430\u043a\u043e \u0434\u0430 \u043a\u043e\u043c\u0443\u043d\u0438\u0446\u0438\u0440\u0430 \u0441\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c.
netReset=\u0412\u0435\u0437\u0430 \u0441\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u043e\u043c \u0458\u0435 \u043f\u043e\u043d\u0438\u0448\u0442\u0435\u043d\u0430 \u043f\u0440\u0438 \u0443\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0443 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0435.
notCached=\u041e\u0432\u0430\u0458 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u0432\u0438\u0448\u0435 \u043d\u0438\u0458\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u0430\u043d.
netOffline=\u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u043e \u0440\u0430\u0434\u0438 \u0432\u0430\u043d \u043c\u0440\u0435\u0436\u0435 \u0438 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u043f\u0440\u0438\u0441\u0442\u0443\u043f\u0438 \u0438\u043d\u0442\u0435\u0440\u043d\u0435\u0442\u0443.
isprinting=\u0417\u0430 \u0432\u0440\u0435\u043c\u0435 \u0448\u0442\u0430\u043c\u043f\u0435 \u0438\u043b\u0438 \u043f\u0440\u0435\u0433\u043b\u0435\u0434\u0430 \u0441\u0442\u0440\u0430\u043d\u0435 \u043f\u0440\u0435 \u0448\u0442\u0430\u043c\u043f\u0435 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0438\u0442\u0438 \u0438\u0437\u043c\u0435\u045a\u0435\u043d.
deniedPortAccess=\u041e\u0432\u0430 \u0430\u0434\u0440\u0435\u0441\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u043c\u0440\u0435\u0436\u043d\u0438 \u043f\u043e\u0440\u0442 \u043a\u043e\u0458\u0438 \u0441\u0435 \u043e\u0431\u0438\u0447\u043d\u043e \u043d\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u0437\u0430 \u0441\u0443\u0440\u0444\u043e\u0432\u0430\u045a\u0435 \u0438\u043d\u0442\u0435\u0440\u043d\u0435\u0442\u043e\u043c. \u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u0458\u0435 \u043f\u0440\u0435\u043a\u0438\u043d\u0443\u043e \u0437\u0430\u0445\u0442\u0435\u0432 \u0440\u0430\u0434\u0438 \u0432\u0430\u0448\u0435 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\u0438.
proxyResolveFailure=\u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u0458\u0435 \u043f\u043e\u0434\u0435\u0448\u0435\u043d \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u043f\u043e\u0441\u0440\u0435\u0434\u043d\u0438\u0447\u043a\u0438 \u0441\u0435\u0440\u0432\u0435\u0440 \u043a\u043e\u0458\u0438 \u043d\u0435 \u043f\u043e\u0441\u0442\u043e\u0458\u0438.
proxyConnectFailure=\u0424\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441 \u0458\u0435 \u043f\u043e\u0434\u0435\u0448\u0435\u043d \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u043f\u043e\u0441\u0440\u0435\u0434\u043d\u0438\u0447\u043a\u0438 \u0441\u0435\u0440\u0432\u0435\u0440 \u043a\u043e\u0458\u0438 \u043e\u0434\u0431\u0438\u0458\u0430 \u0432\u0435\u0437\u0435.
contentEncodingError=\u0421\u0442\u0440\u0430\u043d\u0430 \u043a\u043e\u0458\u0443 \u043f\u043e\u043a\u0443\u0448\u0430\u0432\u0430\u0442\u0435 \u0434\u0430 \u043f\u043e\u0433\u043b\u0435\u0434\u0430\u0442\u0435 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u043b\u0430 \u0431\u0438\u0442\u0438 \u043f\u0440\u0438\u043a\u0430\u0437\u0430\u043d\u0430 \u0458\u0435\u0440 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u043d\u0443 \u0438\u043b\u0438 \u043d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0443 \u043a\u043e\u043c\u043f\u0440\u0435\u0441\u0438\u0458\u0443.
unsafeContentType=\u0421\u0442\u0440\u0430\u043d\u0430 \u043a\u043e\u0458\u0443 \u043f\u043e\u043a\u0443\u0448\u0430\u0432\u0430\u0442\u0435 \u0434\u0430 \u043f\u043e\u0433\u043b\u0435\u0434\u0430\u0442\u0435 \u043d\u0438\u0458\u0435 \u043c\u043e\u0433\u043b\u0430 \u0431\u0438\u0442\u0438 \u043f\u0440\u0438\u043a\u0430\u0437\u0430\u043d\u0430 \u0458\u0435\u0440 \u0458\u0435 \u0441\u0430\u0434\u0440\u0436\u0430\u043d\u0430 \u0443 \u0432\u0440\u0441\u0442\u0438 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0430 \u043a\u043e\u0458\u0435 \u043d\u0438\u0441\u0443 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u0435 \u0437\u0430 \u043e\u0442\u0432\u0430\u0440\u0430\u045a\u0435.  \u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043e\u0431\u0430\u0432\u0435\u0441\u0442\u0438\u0442\u0435 \u0432\u043b\u0430\u0441\u043d\u0438\u043a\u0435 \u0441\u0430\u0458\u0442\u0430 \u043e \u043e\u0432\u043e\u043c \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0443.
externalProtocolTitle=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0441\u043f\u043e\u0459\u0430\u0448\u045a\u0438\u043c \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u043e\u043c
externalProtocolPrompt=\u0421\u043f\u043e\u0459\u043d\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c \u043c\u043e\u0440\u0430 \u0431\u0438\u0442\u0438 \u043f\u043e\u043a\u0440\u0435\u043d\u0443\u0442 \u0434\u0430 \u0431\u0438 \u043e\u0431\u0440\u0430\u0434\u0438\u043e \u0432\u0435\u0437\u0435 %1$S\:. \u0422\u0440\u0430\u0436\u0435\u043d\u0430 \u0432\u0435\u0437\u0430\:\n\n\n%2$S\n\n\n\u041f\u0440\u043e\u0433\u0440\u0430\u043c\: %3$S\n\n\n\u0410\u043a\u043e \u043d\u0438\u0441\u0442\u0435 \u043e\u0447\u0435\u043a\u0438\u0432\u0430\u043b\u0438 \u043e\u0432\u0430\u0458 \u0437\u0430\u0445\u0442\u0435\u0432, \u0442\u043e \u043c\u043e\u0436\u0435 \u0431\u0438\u0442\u0438 \u043d\u0430\u0447\u0438\u043d \u0434\u0430 \u0441\u0435 \u0438\u0441\u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u0441\u043b\u0430\u0431\u043e\u0441\u0442 \u0442\u043e\u0433 \u0441\u043f\u043e\u0459\u043d\u043e\u0433 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u0430, \u043f\u0440\u0435\u043a\u0438\u043d\u0438\u0442\u0435 \u0437\u0430\u0445\u0442\u0435\u0432, \u043e\u0441\u0438\u043c \u0430\u043a\u043e \u0441\u0442\u0435 \u0441\u0438\u0433\u0443\u0440\u043d\u0438 \u0434\u0430 \u0437\u0430\u0445\u0442\u0435\u0432 \u043d\u0438\u0458\u0435 \u0437\u043b\u043e\u043d\u0430\u043c\u0435\u0440\u0430\u043d.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\u043d\u0435\u043f\u043e\u0437\u043d\u0430\u0442\u043e>
externalProtocolChkMsg=\u0417\u0430\u043f\u0430\u043c\u0442\u0438 \u043c\u043e\u0458 \u0438\u0437\u0431\u043e\u0440 \u0437\u0430 \u0441\u0432\u0435 \u0432\u0435\u0437\u0435 \u043e\u0432\u0435 \u0432\u0440\u0441\u0442\u0435.
externalProtocolLaunchBtn=\u041f\u043e\u043a\u0440\u0435\u043d\u0438 \u043f\u0440\u043e\u0433\u0440\u0430\u043c
malwareBlocked=\u0421\u0430\u0458\u0442 %S \u0458\u0435 \u043f\u0440\u0438\u0458\u0430\u0432\u0459\u0435\u043d \u043a\u0430\u043e \u0437\u043b\u043e\u043d\u0430\u043c\u0435\u0440\u0430\u043d \u0438 \u043f\u0440\u0438\u0441\u0442\u0443\u043f \u045a\u0435\u043c\u0443 \u0458\u0435 \u043e\u043d\u0435\u043c\u043e\u0433\u0443\u045b\u0435\u043d \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0443 \u0412\u0430\u0448\u0438\u0445 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u043d\u0438\u0445 \u043f\u043e\u0441\u0442\u0430\u0432\u043a\u0438.
phishingBlocked=\u0412\u0435\u0431 \u0441\u0430\u0458\u0442 \u043d\u0430 \u0430\u0434\u0440\u0435\u0441\u0438 %S \u0458\u0435 \u043f\u0440\u0438\u0458\u0430\u0432\u0459\u0435\u043d \u043a\u0430\u043e \u0444\u0430\u043b\u0441\u0438\u0444\u0438\u043a\u0430\u0442 \u043a\u043e\u0458\u0438 \u043d\u0430\u0432\u043e\u0434\u0438 \u043a\u043e\u0440\u0438\u0441\u043d\u0438\u043a\u0435 \u0434\u0430 \u043e\u0434\u0430\u0458\u0443 \u043b\u0438\u0447\u043d\u0435 \u0438\u043b\u0438 \u0444\u0438\u043d\u0430\u043d\u0441\u0438\u0458\u0441\u043a\u0435 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0458\u0435.
cspFrameAncestorBlocked=\u041e\u0432\u0430 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0430 \u0438\u043c\u0430 \u043f\u043e\u043b\u0438\u0442\u0438\u043a\u0443 \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\u0438 \u0441\u0430\u0434\u0440\u0436\u0430\u0458\u0430 \u043a\u043e\u0458\u0430 \u0458\u0435 \u0441\u043f\u0440\u0435\u0447\u0430\u0432\u0430 \u0434\u0430 \u0431\u0443\u0434\u0435 \u0443\u0433\u0440\u0430\u0452\u0435\u043d\u0430 \u043d\u0430 \u043e\u0432\u0430\u043a\u0430\u0432 \u043d\u0430\u0447\u0438\u043d.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=\u0421\u0442\u0440\u0430\u043d\u0430 \u043a\u043e\u0458\u0443 \u0436\u0435\u043b\u0438\u0442\u0435 \u0434\u0430 \u043f\u043e\u0433\u0435\u0434\u0430\u0442\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0431\u0438\u0442\u0438 \u043f\u0440\u0438\u043a\u0430\u0437\u0430\u043d\u0430 \u0443\u0441\u043b\u0435\u0434 \u0433\u0440\u0435\u0448\u043a\u0435 \u0443 \u043f\u0440\u0435\u043d\u043e\u0441\u0443.
remoteXUL=\u041e\u0432\u0430 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u043d\u0435\u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0443 \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0458\u0443 \u043a\u043e\u0458\u0430 \u0432\u0438\u0448\u0435 \u043d\u0438\u0458\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u0430 \u0443 \u043f\u043e\u0434\u0440\u0430\u0437\u0443\u043c\u0435\u0432\u0430\u043d\u043e\u043c \u0438\u0437\u0434\u0430\u045a\u0443 \u0444\u0430\u0458\u0435\u0440\u0444\u043e\u043a\u0441\u0430 (Pale Moon).

