#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=C\u1ea3nh b\u00e1o\: M\u00e3 kh\u00f4ng \u0111\u00e1p \u1ee9ng
KillScriptMessage=Tr\u00ecnh duy\u1ec7t \u0111ang b\u1eadn x\u1eed l\u00ed m\u1ed9t \u0111o\u1ea1n m\u00e3 trong trang n\u00e0y, ho\u1eb7c kh\u00f4ng x\u1eed l\u00ed \u0111\u01b0\u1ee3c. B\u1ea1n c\u00f3 th\u1ec3 d\u1eebng x\u1eed l\u00ed ngay, ho\u1eb7c ti\u1ebfp t\u1ee5c xem n\u1ebfu vi\u1ec7c x\u1eed l\u00ed c\u00f3 th\u1ec3 ho\u00e0n t\u1ea5t \u0111\u01b0\u1ee3c.
KillScriptWithDebugMessage=Tr\u00ecnh duy\u1ec7t \u0111ang b\u1eadn x\u1eed l\u00ed m\u1ed9t \u0111o\u1ea1n m\u00e3 trong trang n\u00e0y, ho\u1eb7c kh\u00f4ng x\u1eed l\u00ed \u0111\u01b0\u1ee3c. B\u1ea1n c\u00f3 th\u1ec3 d\u1eebng x\u1eed l\u00ed ngay, m\u1edf \u0111o\u1ea1n m\u00e3 b\u1eb1ng tr\u00ecnh s\u1eeda l\u1ed7i, ho\u1eb7c ti\u1ebfp t\u1ee5c x\u1eed l\u00ed.
KillScriptLocation=M\u00e3\: %S
StopScriptButton=D\u1eebng x\u1eed l\u00ed
DebugScriptButton=S\u1eeda l\u1ed7i
WaitForScriptButton=Ti\u1ebfp t\u1ee5c
DontAskAgain=\u0110\u1eebng &h\u1ecfi l\u1ea1i
JSURLLoadBlockedWarning=C\u1ed1 t\u1ea3i m\u1ed9t javascript\: URL t\u1eeb m\u1ed9t host\ntrong m\u1ed9t c\u1eeda s\u1ed5 \u0111ang hi\u1ec3n th\u1ecb n\u1ed9i dung t\u1eeb m\u1ed9t host kh\u00e1c\n\u0111\u00e3 b\u1ecb ch\u1eb7n b\u1edfi tr\u00ecnh qu\u1ea3n l\u00ed b\u1ea3o m\u1eadt.
WindowCloseBlockedWarning=\u0110o\u1ea1n m\u00e3 s\u1ebd kh\u00f4ng \u0111\u00f3ng c\u1eeda s\u1ed5 m\u00e0 kh\u00f4ng ph\u1ea3i do n\u00f3 m\u1edf.
OnBeforeUnloadTitle=B\u1ea1n c\u00f3 ch\u1eafc kh\u00f4ng?
OnBeforeUnloadMessage=Trang n\u00e0y y\u00eau c\u1ea7u b\u1ea1n x\u00e1c nh\u1eadn r\u1eb1ng b\u1ea1n mu\u1ed1n r\u1eddi \u0111i - d\u1eef li\u1ec7u m\u00e0 b\u1ea1n \u0111\u00e3 nh\u1eadp c\u00f3 th\u1ec3 s\u1ebd kh\u00f4ng \u0111\u01b0\u1ee3c l\u01b0u.
OnBeforeUnloadStayButton=\u1ede l\u1ea1i Trang
OnBeforeUnloadLeaveButton=R\u1eddi b\u1ecf Trang
UnexpectedCanvasVariantStyle=canvas\: n\u1ed7 l\u1ef1c - \u0111\u1eb7t gi\u00e1 tr\u1ecb cho strokeStyle ho\u1eb7c fillStyle th\u00e0nh m\u1ed9t gi\u00e1 tr\u1ecb kh\u00f4ng ph\u1ea3i l\u00e0 chu\u1ed7i hay CanvasGradient hay CanvasPattern - \u0111\u00e3 b\u1ecb b\u1ecf qua.
EmptyGetElementByIdParam=Chu\u1ed7i tr\u1ed1ng \u0111\u00e3 \u0111\u01b0\u1ee3c \u0111\u01b0a sang getElementById().
LowMemoryTitle=C\u1ea3nh b\u00e1o\: Thi\u1ebfu b\u1ed9 nh\u1edb
LowMemoryMessage=M\u1ed9t m\u00e3 script tr\u00ean trang n\u00e0y \u0111\u00e3 b\u1ecb ng\u1eebng v\u00ec t\u00ecnh tr\u1ea1ng thi\u1ebfu b\u1ed9 nh\u1edb.
SpeculationFailed=M\u1ed9t c\u00e2y kh\u00f4ng c\u00e2n b\u1eb1ng \u0111\u01b0\u1ee3c vi\u1ebft b\u1eb1ng document.write() khi\u1ebfn d\u1eef li\u1ec7u t\u1eeb m\u1ea1ng b\u1ecb ph\u00e2n t\u00e1ch. \u0110\u1ecdc th\u00eam th\u00f4ng tin https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing
DocumentWriteIgnored=M\u1ed9t l\u1ec7nh g\u1ecdi t\u1edbi document.write() t\u1eeb m\u1ed9t m\u00e3 script n\u1ea1p kh\u00f4ng \u0111\u1ed3ng b\u1ed9 b\u00ean ngo\u00e0i \u0111\u00e3 b\u1ecb b\u1ecf qua.
FormValidationTextTooLong=Vui l\u00f2ng r\u00fat ng\u1eafn \u0111o\u1ea1n n\u00e0y xu\u1ed1ng c\u00f2n %S k\u00ed t\u1ef1 ho\u1eb7c \u00edt h\u01a1n (b\u1ea1n hi\u1ec7n \u0111ang d\u00f9ng %S k\u00ed t\u1ef1).
FormValidationValueMissing=Vui l\u00f2ng \u0111i\u1ec1n v\u00e0o tr\u01b0\u1eddng n\u00e0y.
FormValidationCheckboxMissing=Vui l\u00f2ng \u0111\u00e1nh d\u1ea5u \u00f4 n\u00e0y n\u1ebfu b\u1ea1n mu\u1ed1n ti\u1ebfn h\u00e0nh.
FormValidationRadioMissing=Vui l\u00f2ng ch\u1ecdn m\u1ed9t trong c\u00e1c t\u00f9y ch\u1ecdn n\u00e0y.
FormValidationFileMissing=Vui l\u00f2ng ch\u1ecdn m\u1ed9t t\u1eadp tin.
FormValidationSelectMissing=Vui l\u00f2ng ch\u1ecdn m\u1ed9t m\u1ee5c trong danh s\u00e1ch.
FormValidationInvalidEmail=Vui l\u00f2ng \u0111i\u1ec1n m\u1ed9t \u0111\u1ecba ch\u1ec9 email.
FormValidationInvalidURL=Vui l\u00f2ng \u0111i\u1ec1n m\u1ed9t URL.
FormValidationPatternMismatch=Vui l\u00f2ng kh\u1edbp \u0111\u1ecbnh d\u1ea1ng \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u.
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=Vui l\u00f2ng kh\u1edbp \u0111\u1ecbnh d\u1ea1ng \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u\: %S.
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=C\u1ea7n ch\u1ecdn m\u1ed9t gi\u00e1 tr\u1ecb h\u1ee3p l\u1ec7. Hai gi\u00e1 tr\u1ecb h\u1ee3p l\u1ec7 g\u1ea7n nh\u1ea5t l\u00e0 %S v\u00e0 %S.
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=C\u1ea7n ch\u1ecdn m\u1ed9t gi\u00e1 tr\u1ecb h\u1ee3p l\u1ec7. Gi\u00e1 tr\u1ecb h\u1ee3p l\u1ec7 g\u1ea7n nh\u1ea5t l\u00e0 %S.
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=Vi\u1ec7c d\u00f9ng getAttributeNode() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng getAttribute() thay th\u1ebf.
SetAttributeNodeWarning=Vi\u1ec7c d\u00f9ng setAttributeNode() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng setAttribute() thay th\u1ebf.
GetAttributeNodeNSWarning=Vi\u1ec7c d\u00f9ng getAttributeNodeNS() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng getAttributeNS() thay th\u1ebf.
SetAttributeNodeNSWarning=Vi\u1ec7c d\u00f9ng setAttributeNodeNS() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng setAttributeNS() thay th\u1ebf.
RemoveAttributeNodeWarning=Vi\u1ec7c d\u00f9ng removeAttributeNode() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng removeAttribute() thay th\u1ebf.
CreateAttributeWarning=Vi\u1ec7c d\u00f9ng document.createAttribute() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng element.setAttribute() thay th\u1ebf.
CreateAttributeNSWarning=Vi\u1ec7c d\u00f9ng document.createAttributeNS() b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng element.setAttributeNS() thay th\u1ebf.
OwnerElementWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh attributes' ownerElement b\u1ecb ph\u1ea3n \u0111\u1ed1i.
NodeValueWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh attributes' nodeValue b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng value thay th\u1ebf.
TextContentWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh attributes' textContent b\u1ecb ph\u1ea3n \u0111\u1ed1i. H\u00e3y d\u00f9ng value thay th\u1ebf.
EnablePrivilegeWarning=Vi\u1ec7c d\u00f9ng enablePrivilege b\u1ecb ph\u1ea3n \u0111\u1ed1i. Vui l\u00f2ng d\u00f9ng \u0111o\u1ea1n m\u00e3 ch\u1ea1y v\u1edbi th\u00e0nh ph\u1ea7n ch\u00ednh h\u1ec7 th\u1ed1ng (vd. m\u1ed9t ph\u1ea7n m\u1edf r\u1ed9ng).
nsIJSONDecodeDeprecatedWarning=Kh\u00f4ng d\u00f9ng nsIJSON.decode. H\u00e3y d\u00f9ng JSON.parse.
nsIJSONEncodeDeprecatedWarning=Kh\u00f4ng n\u00ean d\u00f9ng nsIJSON.encode. Vui l\u00f2ng d\u00f9ng JSON.stringify \u0111\u1ec3 thay th\u1ebf.
nsIDOMWindowInternalWarning=Kh\u00f4ng n\u00ean d\u00f9ng nsIDOMWindowInternal. D\u00f9ng nsIDOMWindow \u0111\u1ec3 thay th\u1ebf.
InputEncodingWarning=Vi\u1ec7c d\u00f9ng inputEncoding b\u1ecb l\u1ed7i th\u1eddi.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=S\u1ef1 ki\u1ec7n MozBeforePaint kh\u00f4ng c\u00f2n \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3. Ph\u1ea3i truy\u1ec1n t\u1edbi  mozRequestAnimationFrame \u0111\u1ed1i s\u1ed1 callback kh\u00f4ng null.
FullScreenDeniedBlocked=Y\u00eau c\u1ea7u ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec b\u1ecb ng\u01b0\u1eddi d\u00f9ng ch\u1eb7n tr\u00ean domain n\u00e0y.
FullScreenDeniedDisabled=Ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec API b\u1ecb t\u1eaft b\u1edfi s\u1ef1 t\u00f9y ch\u1ec9nh c\u1ee7a ng\u01b0\u1eddi d\u00f9ng.
FullScreenDeniedFocusedPlugin=T\u1eeb ch\u1ed1i y\u00eau c\u1ea7u m\u1edf to\u00e0n-m\u00e0n-h\u00ecnh v\u00ec \u0111ang d\u00f9ng windowed-plugin.
FullScreenDeniedHidden=Kh\u00f4ng th\u1ec3 xem to\u00e0n m\u00e0n h\u00ecnh v\u00ec t\u00e0i li\u1ec7u n\u00e0y kh\u00f4ng c\u00f2n t\u1ed3n t\u1ea1i.
FullScreenDeniedIframeNotAllowed=Y\u00eau c\u1ea7u hi\u1ec3n th\u1ecb to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec c\u00f3 \u00edt nh\u1ea5t m\u1ed9t trang ch\u01b0a iframe kh\u00f4ng c\u00f3 thu\u1ed9c t\u00ednh "allowfullscreen".
FullScreenDeniedNotInputDriven=Y\u00eau c\u1ea7u ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i do Element.mozRequestFullScreen() kh\u00f4ng \u0111\u01b0\u1ee3c g\u1ecdi t\u1eeb m\u1ed9t s\u1ef1 ki\u1ec7n do ng\u01b0\u1eddi d\u00f9ng t\u1ea1o ra.
FullScreenDeniedNotInDocument=Y\u00eau c\u1ea7u ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec ph\u1ea7n t\u1eed \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u kh\u00f4ng c\u00f2n t\u1ed3n t\u1ea1i.
FullScreenDeniedMovedDocument=Y\u00eau c\u1ea7u ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec ph\u1ea7n t\u1eed \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u \u0111\u00e3 b\u1ecb chuy\u1ec3n sang t\u00e0i li\u1ec7u kh\u00e1c.
FullScreenDeniedLostWindow=Y\u00eau c\u1ea7u hi\u1ec3n th\u1ecb to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i do kh\u00f4ng c\u00f2n c\u1eeda s\u1ed5 n\u00e0o n\u1eefa.
FullScreenDeniedSubDocFullScreen=Y\u00eau c\u1ea7u hi\u1ec3n th\u1ecb to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i do m\u1ed9t t\u00e0i li\u1ec7u ph\u1ee5 c\u1ee7a t\u00e0i li\u1ec7u n\u00e0y \u0111ang \u1edf ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh.
FullScreenDeniedNotDescendant=Y\u00eau c\u1ea7u ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec th\u00e0nh ph\u1ea7n y\u00eau c\u1ea7u kh\u00f4ng ph\u1ea3i l\u00e0 con c\u1ee7a th\u00e0nh ph\u1ea7n \u0111ang \u1edf ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n hinh.
FullScreenDeniedNotFocusedTab=Y\u00eau c\u1ea7u hi\u1ec7n to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i v\u00ec ph\u1ea7n t\u1eed y\u00eau c\u1ea7u kh\u00f4ng \u1edf trong th\u1ebb hi\u1ec7n h\u00e0nh.
FullScreenDeniedContentOnly=Y\u00eau c\u1ea7u ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh b\u1ecb t\u1eeb ch\u1ed1i do ph\u1ea7n t\u1eed y\u00eau c\u1ea7u n\u1eb1m trong chrome document v\u00e0 fullscreen API ch\u1ec9 \u0111\u01b0\u1ee3c c\u1ea5u h\u00ecnh cho n\u1ed9i dung.
RemovedFullScreenElement=Tho\u00e1t kh\u1ecfi ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh v\u00ec t\u00ednh n\u0103ng to\u00e0n m\u00e0n h\u00ecnh \u0111\u00e3 b\u1ecb lo\u1ea1i b\u1ecf.
FocusedWindowedPluginWhileFullScreen=Tho\u00e1t kh\u1ecfi ch\u1ebf \u0111\u1ed9 to\u00e0n m\u00e0n h\u00ecnh v\u00ec m\u1ed9t ph\u1ea7n m\u1edf r\u1ed9ng kh\u00f4ng to\u00e0n m\u00e0n h\u00ecnh \u0111\u00e3 \u0111\u01b0\u1ee3c ch\u1ecdn.
HTMLSyncXHRWarning=Vi\u1ec7c ph\u00e2n t\u00edch HTML trong XMLHttpRequest kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 \u1edf ch\u1ebf \u0111\u1ed9 \u0111\u1ed3ng b\u1ed9.
InvalidRedirectChannelWarning=Kh\u00f4ng th\u1ec3 chuy\u1ec3n h\u01b0\u1edbng \u0111\u1ebfn %S b\u1edfi v\u00ec k\u00eanh n\u00e0y kh\u00f4ng th\u1ec3 thi h\u00e0nh \u0111\u1ebfn nsIWritablePropertyBag2.
ResponseTypeSyncXHRWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh responseType c\u1ee7a XMLHttpRequest kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 \u1edf ch\u1ebf \u0111\u1ed9 \u0111\u1ed3ng b\u1ed9 trong ph\u1ea1m vi c\u1eeda s\u1ed5.
WithCredentialsSyncXHRWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh withCredentials c\u1ee7a XMLHttpRequest kh\u00f4ng c\u00f2n \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 \u1edf ch\u1ebf \u0111\u1ed9 \u0111\u1ed3ng b\u1ed9 trong ph\u1ea1m vi c\u1eeda s\u1ed5.
TimeoutSyncXHRWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh timeout c\u1ee7a XMLHttpRequest kh\u00f4ng c\u00f2n \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 \u1edf ch\u1ebf \u0111\u1ed9 \u0111\u1ed3ng b\u1ed9 trong ph\u1ea1m vi c\u1eeda s\u1ed5.
JSONCharsetWarning=S\u1eed d\u1ee5ng m\u00e3 h\u00f3a kh\u00f4ng ph\u1ea3i UTF-8 \u0111\u1ec3 nh\u1eadn JSON b\u1eb1ng XMLHttpRequest l\u00e0 vi ph\u1ea1m. Vi\u1ec7c gi\u1ea3i m\u00e3 JSON ch\u1ec9 h\u1ed7 tr\u1ee3 UTF-8.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=Kh\u00f4ng \u0111\u1ee7 b\u1ed9 nh\u1edb \u0111\u1ec3 l\u1ea5y l\u1ea1i m\u1eabu (resample) AudioBufferSourceNode \u0111\u1ec3 ph\u00e1t l\u1ea1i.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=Th\u00f4ng tin \u0111\u01b0\u1ee3c chuy\u1ec3n t\u1edbi decodeAudioData ch\u01b0a ki\u1ec3u n\u1ed9i dung kh\u00f4ng nh\u1eadn di\u00ean \u0111\u01b0\u1ee3c.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=C\u00f3 l\u1ed7i ch\u01b0a nh\u1eadn bi\u1ebft \u0111\u01b0\u1ee3c \u0111\u00e3 x\u1ea3y ra khi x\u1eed l\u00fd decodeAudioData.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=The buffer passed to decodeAudioData contains invalid content which cannot be decoded successfully.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=The buffer passed to decodeAudioData does not contain any audio.
MediaLoadExhaustedCandidates=Kh\u00f4ng th\u1ec3 t\u1ea3i v\u1ec1 c\u00e1c ngu\u1ed3n t\u00e0i nguy\u00ean. T\u1ea1m d\u1eebng t\u1ea3i.
MediaLoadSourceMissingSrc=ph\u1ea7n t\u1eed <source> kh\u00f4ng c\u00f3 thu\u1ed9c t\u00ednh "src". Ngu\u1ed3n media kh\u00f4ng t\u1ea3i \u0111\u01b0\u1ee3c.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=Tr\u1ea1ng th\u00e1i c\u1ee7a HTTP\: %1$S. Kh\u00f4ng t\u1ea3i \u0111\u01b0\u1ee3c media t\u1eeb %2$S.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=URI kh\u00f4ng h\u1ee3p l\u1ec7. Vi\u1ec7c t\u1ea3i t\u1eadp tin media t\u1eeb ngu\u1ed3n %S th\u1ea5t b\u1ea1i.
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute=\u0110\u1ecbnh d\u1ea1ng "%1$S" kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3. Vi\u1ec7c t\u1ea3i media t\u1eeb %2$S th\u1ea5t b\u1ea1i.
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched=Thu\u1ed9c t\u00ednh "media" c\u1ee7a "%1$S" kh\u00f4ng ph\u00f9 h\u1ee3p v\u1edbi m\u00f4i tr\u01b0\u1eddng. Vi\u1ec7c t\u1ea3i media t\u1eeb %2$S th\u1ea5t b\u1ea1i.
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType=M\u00e1y ch\u1ee7 kh\u00f4ng h\u1ed7 tr\u1ee3 HTTP "Content-Type" c\u1ee7a "%1$S". Kh\u00f4ng t\u1ea3i \u0111\u01b0\u1ee3c media t\u1eeb %2$S.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=T\u00e0i nguy\u00ean %S kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=Vi\u1ec7c d\u00f9ng thu\u1ed9c t\u00ednh trong code c\u1ee7a DOMException s\u1ebd b\u1ecb lo\u1ea1i b\u1ecf. S\u1eed d\u1ee5ng name \u0111\u1ec3 thay th\u1ebf.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=G\u1ecdi ra c\u00e1c \u0111\u1ed1i t\u01b0\u1ee3ng chrome JS m\u00e0 kh\u00f4ng c\u00f3 __exposedProps__ l\u00e0 kh\u00f4ng an to\u00e0n v\u00e0 kh\u00f4ng n\u00ean d\u00f9ng. Xem https\://developer.mozilla.org/en/XPConnect_wrappers \u0111\u1ec3 bi\u1ebft th\u00eam th\u00f4ng tin.
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=Mutation Events \u0111\u00e3 l\u1ed7i th\u1eddi, thay v\u00e0o \u0111\u00f3, h\u00e3y d\u00f9ng MutationObserver.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=Kh\u00f4ng n\u00ean d\u00f9ng \u0111\u1ed1i t\u01b0\u1ee3ng Components. \u0110\u1ed1i t\u01b0\u1ee3ng n\u00e0y s\u1eafp b\u1ecb lo\u1ea1i b\u1ecf.
PluginHangUITitle=C\u1ea3nh b\u00e1o\: plugin kh\u00f4ng \u0111\u00e1p \u1ee9ng
PluginHangUIMessage=%S c\u00f3 th\u1ec3 \u0111ang b\u1eadn, ho\u1eb7c \u0111\u00e3 b\u1ecb treo. B\u1ea1n c\u00f3 th\u1ec3 t\u1eaft plugin, ho\u1eb7c ti\u1ebfp t\u1ee5c \u0111\u1ee3i n\u1ebfu vi\u1ec7c x\u1eed l\u00fd ho\u00e0n t\u1ea5t.
PluginHangUIWaitButton=Ti\u1ebfp t\u1ee5c
PluginHangUIStopButton=T\u1eaft plugin
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning=Kh\u00f4ng n\u00ean d\u00f9ng 'mozHidden' v\u00e0 'mozVisibilityState'. S\u1eed d\u1ee5ng 'hidden' v\u00e0 'visibilityState' \u0111\u1ec3 thay th\u1ebf.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=L\u1eddi g\u1ecdi h\u00e0m detach() tr\u00ean NodeIterator kh\u00f4ng c\u00f2n c\u00f3 t\u00e1c d\u1ee5ng.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=Ignoring get or set of property that has [LenientThis] because the "this" object is incorrect.
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=Use of nsIDOMWindowUtils.getOuterWindowWithId() is deprecated.  Instead, use the nsIWindowMediator method of the same name.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=Use of getPreventDefault() is deprecated.  Use defaultPrevented instead.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=Use of getUserData() or setUserData() is deprecated.  Use WeakMap or element.dataset instead.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=Vi\u1ec7c d\u00f9ng Document.load() kh\u00f4ng \u0111\u01b0\u1ee3c t\u00e1n th\u00e0nh. \u0110\u1ec3 n\u00e2ng c\u1ea5p m\u00e3 c\u1ee7a b\u1ea1n, h\u00e3y d\u00f9ng \u0111\u1ed1i t\u01b0\u1ee3ng DOM XMLHttpRequest. \u0110\u1ecdc th\u00eam tr\u1ee3 gi\u00fap https\://developer.mozilla.org/en/XMLHttpRequest
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

