#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=No se pudo guardar %S, porque el archivo de origen no pudo ser le\u00eddo.\n\nProb\u00e1 de nuevo m\u00e1s tarde, o contact\u00e1 al administrador del servidor.
writeError=No se pudo guardar %S, porque ocurri\u00f3 un error desconocido. \n\nProb\u00e1 guardarlo en una ubicaci\u00f3n diferente.
launchError=No se pudo abrir %S, porque sucedi\u00f3 un error desconocido. \n\nProb\u00e1 guardarlo primero en una unidad y luego abrir el archivo.
diskFull=No hay suficiente espacio libre en la unidad para guardar %S. \n\nLiber\u00e1 espacio en la unidad y prob\u00e1 de nuevo, o intent\u00e1 guardarlo en otra unidad.
readOnly=No se pudo guardar %S, porque la unidad, la carpeta, o el archivo est\u00e1 protegido contra escritura.\n\nHabilit\u00e1 la escritura y prob\u00e1 de nuevo, o guardalo en una ubicaci\u00f3n distinta.
accessError=No se pudo guardar %S, porque no pod\u00e9s cambiar los contenidos de esa carpeta.\n\nCambi\u00e1 las propiedades de la carpeta, o intent\u00e1 guardarlo en un lugar distinto.
SDAccessErrorCardReadOnly=No se puede descargar el archivo porque la tarjeta SD est\u00e1 en uso.
SDAccessErrorCardMissing=No se puede descargar el archivo porque falta la tarjeta SD.
helperAppNotFound=%S no se puede abrir, porque la aplicaci\u00f3n asociada no existe. Cambi\u00e1 la asociaci\u00f3n en la configuraci\u00f3n.
noMemory=No hay memoria suficiente para completar la acci\u00f3n solicitada.\n\nCerr\u00e1 algunas aplicaciones y prob\u00e1 de nuevo.
title=Descargando %S
fileAlreadyExistsError=No se pudo guardar %S, porque ya existe un archivo con el mismo nombre que el directorio '_archivos'.\n\nIntent\u00e1 guardarlo en una ubicaci\u00f3n diferente.
fileNameTooLongError=No se pudo guardar %S, porque el nombre del archivo es muy largo.\n\nIntent\u00e1 guardarlo con un nombre m\u00e1s corto.

