#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=Alerta\: script n\u00e3o responde
KillScriptMessage=Um script desta p\u00e1gina pode estar em execu\u00e7\u00e3o ou parado de responder.\nVoc\u00ea pode interromp\u00ea-lo agora ou continuar para verificar se ele termina a execu\u00e7\u00e3o.
KillScriptWithDebugMessage=Um script desta p\u00e1gina pode estar em execu\u00e7\u00e3o ou parado de responder. Voc\u00ea pode interromp\u00ea-lo agora, abrir em um depurador ou continuar para verificar se ele termina a execu\u00e7\u00e3o.
KillScriptLocation=Script\:\n%S
StopScriptButton=Interromper script
DebugScriptButton=Depurar script
WaitForScriptButton=Continuar
DontAskAgain=&N\u00e3o perguntar de novo
JSURLLoadBlockedWarning=A tentativa de carregar uma URL javascript\: de um servidor\nem uma janela mostrando conte\u00fado de outro servidor foi\nbloqueada pelo gerenciador de seguran\u00e7a.
WindowCloseBlockedWarning=Scripts n\u00e3o t\u00eam permiss\u00e3o para fechar janelas que n\u00e3o foram abertas pelo script.
OnBeforeUnloadTitle=Tem certeza?
OnBeforeUnloadMessage=Esta p\u00e1gina quer saber se voc\u00ea deseja mesmo sair.\n\nInforma\u00e7\u00f5es fornecidas podem ser perdidas.
OnBeforeUnloadStayButton=Permanecer na p\u00e1gina
OnBeforeUnloadLeaveButton=Sair da p\u00e1gina
UnexpectedCanvasVariantStyle=canvas\: foi ignorada uma tentativa de definir strokeStyle ou fillStyle para um valor que n\u00e3o \u00e9 uma string, um CanvasGradient ou um CanvasPattern.
EmptyGetElementByIdParam=String vazia passada para getElementById().
LowMemoryTitle=Alerta\: mem\u00f3ria insuficiente
LowMemoryMessage=Um script desta p\u00e1gina foi interrompido devido a um estado de mem\u00f3ria insuficiente.
SpeculationFailed=Uma estrutura em \u00e1rvore n\u00e3o balanceada foi escrita atrav\u00e9s de document.write(), fazendo com que dados da rede fossem reprocessados. Mais informa\u00e7\u00f5es em https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing
DocumentWriteIgnored=Foi ignorada uma chamada para document.write() a partir de um script externo carregado assincronamente.
FormValidationTextTooLong=Por favor, diminua este texto para %S caracteres ou menos (no momento ele tem %S caracteres)
FormValidationValueMissing=Por favor, preencha este campo
FormValidationCheckboxMissing=Por favor, marque esta op\u00e7\u00e3o se deseja continuar
FormValidationRadioMissing=Por favor, selecione uma destas op\u00e7\u00f5es
FormValidationFileMissing=Por favor, selecione um arquivo
FormValidationSelectMissing=Por favor, selecione um item da lista
FormValidationInvalidEmail=Por favor, forne\u00e7a um endere\u00e7o de email
FormValidationInvalidURL=Por favor, forne\u00e7a um endere\u00e7o da internet
FormValidationPatternMismatch=Por favor, satisfa\u00e7a o formato requisitado
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=Por favor, satisfa\u00e7a o formato requisitado\: %S
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=Por favor, selecione um valor v\u00e1lido. Os dois valores v\u00e1lidos mais pr\u00f3ximos s\u00e3o %S e %S.
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=Por favor, selecione um valor v\u00e1lido. O valor v\u00e1lido mais pr\u00f3ximo \u00e9 %S.
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=O m\u00e9todo getAttributeNode() n\u00e3o deve mais ser usado. No lugar, use getAttribute().
SetAttributeNodeWarning=O m\u00e9todo setAttributeNode() n\u00e3o deve mais ser usado. No lugar, use setAttribute().
GetAttributeNodeNSWarning=O m\u00e9todo getAttributeNodeNS() n\u00e3o deve mais ser usado. No lugar, use getAttributeNS().
SetAttributeNodeNSWarning=O m\u00e9todo setAttributeNodeNS() n\u00e3o deve mais ser usado. No lugar, use setAttributeNS().
RemoveAttributeNodeWarning=O m\u00e9todo removeAttributeNode() n\u00e3o deve mais ser usado. No lugar, use removeAttribute().
CreateAttributeWarning=O m\u00e9todo document.createAttribute() n\u00e3o deve mais ser usado. No lugar, use element.setAttribute().
CreateAttributeNSWarning=O m\u00e9todo document.createAttributeNS() n\u00e3o deve mais ser usado. No lugar, use element.setAttributeNS().
OwnerElementWarning=A propriedade ownerElement de objetos Attr n\u00e3o deve mais ser usada.
NodeValueWarning=A propriedade nodeValue de objetos Attr n\u00e3o deve mais ser usada. No lugar, use a propriedade value.
TextContentWarning=A propriedade textContent de objetos Attr n\u00e3o deve mais ser usada. No lugar, use a propriedade value.
EnablePrivilegeWarning=O m\u00e9todo enablePrivilege n\u00e3o deve mais ser usado. No lugar, use c\u00f3digo que \u00e9 executado com privil\u00e9gios de sistema (como o c\u00f3digo de uma extens\u00e3o).
nsIJSONDecodeDeprecatedWarning=nsIJSON.decode n\u00e3o deve mais ser usado. No lugar, use JSON.parse.
nsIJSONEncodeDeprecatedWarning=nsIJSON.encode n\u00e3o deve mais ser usado. No lugar, use JSON.stringify.
nsIDOMWindowInternalWarning=nsIDOMWindowInternal n\u00e3o deve mais ser usado. No lugar, use nsIDOMWindow.
InputEncodingWarning=A propriedade inputEncoding n\u00e3o deve mais ser usada.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=Eventos MozBeforePaint n\u00e3o s\u00e3o mais suportados. Um argumento n\u00e3o nulo deve ser passado como callback a mozRequestAnimationFrame.
FullScreenDeniedBlocked=A permiss\u00e3o para tela inteira foi negada. A tela inteira foi bloqueada pelo usu\u00e1rio para este dom\u00ednio.
FullScreenDeniedDisabled=A permiss\u00e3o para tela inteira foi negada. A API de tela inteira est\u00e1 desativada nas prefer\u00eancias de usu\u00e1rio.
FullScreenDeniedFocusedPlugin=A permiss\u00e3o para tela inteira foi negada. Um windowed plugin est\u00e1 focado.
FullScreenDeniedHidden=A permiss\u00e3o para tela inteira foi negada. O documento n\u00e3o est\u00e1 mais vis\u00edvel.
FullScreenDeniedIframeNotAllowed=A permiss\u00e3o para tela inteira foi negada. Pelo menos um dos iframes presente no documento n\u00e3o possui um atributo \u201callowfullscreen\u201d.
FullScreenDeniedNotInputDriven=A permiss\u00e3o para tela inteira foi negada. Element.mozRequestFullScreen() n\u00e3o foi chamado a partir de um manipulador de curta dura\u00e7\u00e3o de evento gerado pelo usu\u00e1rio.
FullScreenDeniedNotInDocument=A permiss\u00e3o para tela inteira foi negada. O elemento que solitou n\u00e3o est\u00e1 mais no documento.
FullScreenDeniedMovedDocument=A permiss\u00e3o para tela inteira foi negada. O elemento que solitou est\u00e1 em outro documento.
FullScreenDeniedLostWindow=A permiss\u00e3o para tela inteira foi negada. N\u00e3o h\u00e1 mais janela.
FullScreenDeniedSubDocFullScreen=A permiss\u00e3o para tela inteira foi negada. Um subdocumento do documento que solicitou tela inteira j\u00e1 est\u00e1 em tela inteira.
FullScreenDeniedNotDescendant=A permiss\u00e3o para tela inteira foi negada. O elemento que solicitou n\u00e3o descende do elemento atualmente em tela inteira.
FullScreenDeniedNotFocusedTab=A permiss\u00e3o para tela inteira foi negada. O elemento que solicitou n\u00e3o est\u00e1 na aba atualmente selecionada.
FullScreenDeniedContentOnly=A permiss\u00e3o para tela inteira foi negada. O elemento que solicitou est\u00e1 no documento chrome. A API de tela inteira \u00e9 configurada somente para conte\u00fado.
RemovedFullScreenElement=Saindo do modo tela inteira. O elemento em tela inteira foi removido do documento.
FocusedWindowedPluginWhileFullScreen=Saindo do modo tela inteira. Um windowed plugin recebeu o foco.
HTMLSyncXHRWarning=O processamento HTML em XMLHttpRequest n\u00e3o \u00e9 suportado no modo s\u00edncrono.
InvalidRedirectChannelWarning=N\u00e3o foi poss\u00edvel redirecionar para %S. O canal n\u00e3o implementa nsIWritablePropertyBag2.
ResponseTypeSyncXHRWarning=O uso do atributo responseType de XMLHttpRequest n\u00e3o \u00e9 mais suportado no modo s\u00edncrono em contexto de janela.
WithCredentialsSyncXHRWarning=O uso do atributo withCredentials de XMLHttpRequest n\u00e3o \u00e9 mais suportado no modo s\u00edncrono em contexto de janela.
TimeoutSyncXHRWarning=O uso do atributo timeout de XMLHttpRequest n\u00e3o \u00e9 suportado no modo s\u00edncrono em contexto de janela.
JSONCharsetWarning=Foi feita uma tentativa de declarar uma codifica\u00e7\u00e3o diferente de UTF-8 para JSON recebido via XMLHttpRequest. Somente UTF-8 \u00e9 suportado para decodificar JSON.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=Mem\u00f3ria insuficiente para reamostrar AudioBufferSourceNode para reprodu\u00e7\u00e3o.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=O buffer passado a decodeAudioData possui um tipo de conte\u00fado desconhecido.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=Ocorreu um erro desconhecido no processamento de decodeAudioData.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=O buffer passado a decodeAudioData possui conte\u00fado inv\u00e1lido que n\u00e3o p\u00f4de ser decodificado com \u00eaxito.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=O buffer passado a decodeAudioData n\u00e3o possui \u00e1udio.
MediaLoadExhaustedCandidates=Houve falha no carregamento para todas as alternativas de m\u00eddia. Pausa no carregamento.
MediaLoadSourceMissingSrc=O elemento <source> n\u00e3o possui o atributo \u201csrc\u201d. Falha no carregamento da m\u00eddia.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=O carregamento HTTP falhou com o status %1$S. Falha no carregamento da m\u00eddia %2$S
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=URI inv\u00e1lida. Falha no carregamento da m\u00eddia %S
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute=O atributo \u201ctype\u201d especificado de \u201c%1$S\u201d n\u00e3o \u00e9 suportado. Falha no carregamento da m\u00eddia %2$S
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched=O atributo \u201cmedia\u201d especificado de \u201c%1$S\u201d n\u00e3o \u00e9 adequado ao ambiente. Falha no carregamento da m\u00eddia %2$S
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType=O \u201cContent-Type\u201d HTTP \u201c%1$S\u201d n\u00e3o \u00e9 suportado. Falha no carregamento da m\u00eddia %2$S
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=A m\u00eddia %S n\u00e3o p\u00f4de ser decodificada.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=A propriedade code de DOMException n\u00e3o deve mais ser usada. No lugar, use name.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=A exposi\u00e7\u00e3o de objetos JS de chrome no conte\u00fado sem __exposedProps__ \u00e9 insegura e n\u00e3o deve ser usada. Veja https\://developer.mozilla.org/en/XPConnect_wrappers para mais informa\u00e7\u00f5es.
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=Eventos Mutation n\u00e3o devem mais ser usados. No lugar, use MutationObserver.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=O objeto Components n\u00e3o deve mais ser usado. Ser\u00e1 exclu\u00eddo brevemente.
PluginHangUITitle=Alerta\: plugin n\u00e3o responde
PluginHangUIMessage=O %S pode estar em execu\u00e7\u00e3o ou parado de responder. Voc\u00ea pode interromper o plugin agora ou continuar para verificar se ele termina a execu\u00e7\u00e3o.
PluginHangUIWaitButton=Continuar
PluginHangUIStopButton=Interromper plugin
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning=\u201cmozHidden\u201d e \u201cmozVisibilityState\u201d n\u00e3o devem mais ser usados. No lugar, use os sem prefixo \u201chidden\u201d e \u201cvisibilityState\u201d.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=Chamadas para detach() em NodeIterator n\u00e3o produzem mais efeito.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=Ignorando o get ou set da propriedade que possui [LenientThis] porque o objeto \u201cthis\u201d \u00e9 incorreto.
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=O m\u00e9todo nsIDOMWindowUtils.getOuterWindowWithId() n\u00e3o deve mais ser usado. No lugar, use o m\u00e9todo de nsIWindowMediator de mesmo nome.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=O m\u00e9todo getPreventDefault() n\u00e3o deve mais ser usado. No lugar, use defaultPrevented.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=Os m\u00e9todos getUserData() ou setUserData() n\u00e3o devem mais ser usados. No lugar, use WeakMap ou element.dataset.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=Document.load() n\u00e3o deve mais ser usado. Para atualizar seu c\u00f3digo, use o objeto DOM XMLHttpRequest. Mais informa\u00e7\u00f5es em https\://developer.mozilla.org/en/XMLHttpRequest
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

