#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=%S kan inte sparas eftersom k\u00e4llfilen inte kunde l\u00e4sas.\n\nF\u00f6rs\u00f6k igen senare eller kontakta systemadministrat\u00f6ren.
writeError=%S kan inte sparas eftersom ett ok\u00e4nt fel intr\u00e4ffade.\n\nF\u00f6rs\u00f6k spara till en annan plats.
launchError=%S kan inte \u00f6ppnas eftersom ett ok\u00e4nt fel intr\u00e4ffade.\n\nF\u00f6rs\u00f6k spara filen till disk f\u00f6rst och sedan \u00f6ppna den.
diskFull=Det finns inte tillr\u00e4ckligt med utrymme p\u00e5 disken f\u00f6r att spara %S.\n\nTa bort on\u00f6diga filer fr\u00e5n disken och f\u00f6rs\u00f6k igen, eller f\u00f6rs\u00f6k spara till en annan plats.
readOnly=%S kan inte sparas eftersom disken, mappen eller filen \u00e4r skrivskyddad.\n\nTa bort skrivskyddet och f\u00f6rs\u00f6k igen, eller f\u00f6rs\u00f6k spara till en annan plats.
accessError=%S kan inte sparas eftersom du inte kan \u00e4ndra inneh\u00e5llet i den mappen.\n\n\u00c4ndra mappegenskaperna och f\u00f6rs\u00f6k igen, eller f\u00f6rs\u00f6k spara till en annan plats.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=%S kunde inte \u00f6ppnas eftersom det associerade hj\u00e4lpprogrammet inte finns. \u00c4ndra associationen i dina inst\u00e4llningar.
noMemory=Det finns inte tillr\u00e4ckligt med minne f\u00f6r att slutf\u00f6ra \u00e5tg\u00e4rden du beg\u00e4rt.\n\nAvsluta n\u00e5gra program och f\u00f6rs\u00f6k igen.
title=H\u00e4mtar %S
fileAlreadyExistsError=%S kan inte sparas eftersom en fil med samma namn som mappen \u201d-filer\u201d redan finns.\n\nF\u00f6rs\u00f6k spara till en annan plats.
fileNameTooLongError=%S kan inte sparas eftersom filnamnet \u00e4r f\u00f6r l\u00e5ngt.\n\nF\u00f6rs\u00f6k spara med ett kortare filnamn.

