#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL\:en \u00e4r ogiltig och kan inte \u00f6ppnas.
fileNotFound=Pale Moon kan inte hitta filen p\u00e5 %S.
dnsNotFound=Pale Moon kan inte hitta servern p\u00e5 %S.
protocolNotFound=Pale Moon vet inte hur den h\u00e4r adressen ska \u00f6ppnas eftersom protokollet (%S) inte \u00e4r associerat med n\u00e5got program.
connectionFailure=Pale Moon kan inte uppr\u00e4tta en anslutning till servern p\u00e5 %S.
netInterrupt=Anslutningen till %S avbr\u00f6ts under h\u00e4mtningen av sidan.
netTimeout=Servern p\u00e5 %S svarar inte.
redirectLoop=Pale Moon har uppt\u00e4ckt att servern dirigerar om f\u00f6rfr\u00e5gan om den h\u00e4r platsen p\u00e5 ett s\u00e4tt som om\u00f6jligg\u00f6r ett slutf\u00f6rande.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=F\u00f6r att visa sidan m\u00e5ste %S skicka information som kommer att upprepa en tidigare utf\u00f6rd \u00e5tg\u00e4rd (s\u00e5som en s\u00f6kning eller best\u00e4llningsbekr\u00e4ftelse).
resendButton.label=Skicka igen
unknownSocketType=Pale Moon kan inte kommunicera med servern.
netReset=Anslutningen till servern br\u00f6ts under h\u00e4mtningen av sidan.
notCached=Dokumentet \u00e4r inte l\u00e4ngre tillg\u00e4ngligt.
netOffline=Pale Moon \u00e4r f\u00f6r n\u00e4rvarande i nedkopplat l\u00e4ge och kan inte visa webbsidor.
isprinting=Dokumentet kan inte \u00e4ndras under utskrift eller f\u00f6rhandsgranskning.
deniedPortAccess=Den h\u00e4r adressen anv\u00e4nder en n\u00e4tverksport som normalt anv\u00e4nds f\u00f6r andra \u00e4ndam\u00e5l \u00e4n webbl\u00e4sning. Pale Moon har av s\u00e4kerhetssk\u00e4l avbrutit anslutningsf\u00f6rs\u00f6ket.
proxyResolveFailure=Pale Moon \u00e4r inst\u00e4lld p\u00e5 att anv\u00e4nda en proxyserver, men proxyn kunde inte hittas.
proxyConnectFailure=Pale Moon \u00e4r inst\u00e4lld p\u00e5 att anv\u00e4nda en proxyserver, men proxyn avvisade anslutningen.
contentEncodingError=Sidan kan inte visas eftersom den anv\u00e4nder en typ av komprimering som \u00e4r ogiltig eller som inte st\u00f6ds.
unsafeContentType=Sidan du f\u00f6rs\u00f6ker se kan inte visas eftersom den \u00e4r inlagd i en filtyp som kan vara farlig att \u00f6ppna. Kontakta webbplatsens \u00e4gare f\u00f6r att informera dem om detta problem.
externalProtocolTitle=Beg\u00e4ran om externt protokoll
externalProtocolPrompt=Ett externt program m\u00e5ste k\u00f6ras f\u00f6r att hantera %1$S-l\u00e4nkar.\n\n\nEfterfr\u00e5gad l\u00e4nk\:\n\n%2$S\n\nProgram\: %3$S\n\n\nOm du inte v\u00e4ntade dig denna beg\u00e4ran kan det vara ett f\u00f6rs\u00f6k att utnyttja svagheter i det externa programmet. Avbryt denna beg\u00e4ran om du inte \u00e4r s\u00e4ker p\u00e5 att den inte \u00e4r illasinnad.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Ok\u00e4nt>
externalProtocolChkMsg=Kom ih\u00e5g mitt val f\u00f6r alla l\u00e4nkar av den h\u00e4r typen.
externalProtocolLaunchBtn=K\u00f6r program
malwareBlocked=Platsen %S \u00e4r anm\u00e4ld som en skadlig webbplats och har d\u00e4rf\u00f6r blockerats enligt dina s\u00e4kerhetsinst\u00e4llningar.
phishingBlocked=Webbplatsen %S \u00e4r anm\u00e4ld som en webbf\u00f6rfalskning avsedd att lura av anv\u00e4ndare personliga eller finansiella uppgifter.
cspFrameAncestorBlocked=Den h\u00e4r sidan har en s\u00e4kerhetspolicy f\u00f6r inneh\u00e5ll som f\u00f6rhindrar den fr\u00e5n att inb\u00e4ddas p\u00e5 detta s\u00e4tt.
xssBlockMode=Den h\u00e4r sidan inneh\u00e5ller en XSS-attack som har blockerats av s\u00e4kerhetssk\u00e4l.
corruptedContentError=Sidan du f\u00f6rs\u00f6ker se kan inte visas p\u00e5 grund av att ett fel i data\u00f6verf\u00f6ringen uppt\u00e4cktes.
remoteXUL=Den h\u00e4r sidan anv\u00e4nder en teknik som inte l\u00e4ngre st\u00f6ds som standard av Pale Moon.

