#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Get ekki haft \u00f6rugg samskipti. Jafningi sty\u00f0ur ekki dulk\u00f3\u00f0um me\u00f0 miklum g\u00e6\u00f0um.
SSL_ERROR_US_ONLY_SERVER=Get ekki haft \u00f6rugg samskipti. Jafningi \u00fearfnast dulk\u00f3\u00f0unar me\u00f0 miklum g\u00e6\u00f0um sem er ekki stu\u00f0ningur fyrir.
SSL_ERROR_NO_CYPHER_OVERLAP=Get ekki haft \u00f6rugg samskipti vi\u00f0 jafningja\: Enginn sameiginleg dulk\u00f3\u00f0unar algr\u00edm.
SSL_ERROR_NO_CERTIFICATE=Finn ekki skilr\u00edki e\u00f0a lykil sem er nau\u00f0synlegur fyrir au\u00f0kenni.
SSL_ERROR_BAD_CERTIFICATE=Get ekki haft \u00f6rugg samskipti vi\u00f0 jafningja\: Skilr\u00edkjum jafningja var hafna\u00f0.
SSL_ERROR_UNUSED_5=\u00d3ekktur SSL k\u00f3\u00f0i.
SSL_ERROR_BAD_CLIENT=Net\u00fej\u00f3nninn f\u00e9kk g\u00f6llu\u00f0 g\u00f6gn fr\u00e1 bi\u00f0lara.
SSL_ERROR_BAD_SERVER=Bi\u00f0larinn f\u00e9kk g\u00f6llu\u00f0 g\u00f6gn fr\u00e1 net\u00fej\u00f3ni.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Ekki stu\u00f0ningur vi\u00f0 tegund skilr\u00edkis.
SSL_ERROR_UNSUPPORTED_VERSION=Jafningi er a\u00f0 nota \u00f3studda \u00fatg\u00e1fu af \u00feessum \u00f6ryggis samskiptareglum.
SSL_ERROR_UNUSED_10=\u00d3\u00feekktur SSL k\u00f3\u00f0i.
SSL_ERROR_WRONG_CERTIFICATE=Sannvottun \u00e1 bi\u00f0lara mist\u00f3kst\: einkalykill \u00ed gagnagrunni passar ekki vi\u00f0 dreifilykil \u00ed skilr\u00edkja grunni.
SSL_ERROR_BAD_CERT_DOMAIN=Get ekki haft \u00f6rugg samskipti vi\u00f0 sv\u00e6\u00f0i\: umbe\u00f0i\u00f0 l\u00e9n passar ekki vi\u00f0 skilr\u00edki net\u00fej\u00f3ns.
SSL_ERROR_POST_WARNING=\u00d3ekktur SSL k\u00f3\u00f0i.
SSL_ERROR_SSL2_DISABLED=Jafningi sty\u00f0ur a\u00f0eins SSL \u00fatg\u00e1fu 2, sem er \u00f3virk sta\u00f0bundin.
SSL_ERROR_BAD_MAC_READ=SSL f\u00e9kk g\u00f6gn me\u00f0 r\u00f6ngum sannvottunark\u00f3ta (MAC).
SSL_ERROR_BAD_MAC_ALERT=SSL jafningi l\u00e9t vita af r\u00f6ngum sannvottunark\u00f3ta (MAC).
SSL_ERROR_BAD_CERT_ALERT=SSL jafningi getur ekki sannreynt \u00feitt skilr\u00edki.
SSL_ERROR_REVOKED_CERT_ALERT=SSL jafningi hafna\u00f0i \u00fe\u00ednu skilr\u00edki \u00fev\u00ed \u00fea\u00f0 hefur veri\u00f0 afturkalla\u00f0.
SSL_ERROR_EXPIRED_CERT_ALERT=SSL jafningi hafna\u00f0i \u00fe\u00ednu skilr\u00edki \u00fev\u00ed \u00fea\u00f0 er \u00fatrunni\u00f0.
SSL_ERROR_SSL_DISABLED=Get ekki tengst\: SSL er \u00f3virkt.
SSL_ERROR_FORTEZZA_PQG=Get ekki tengst\: SSL jafningi er \u00e1 \u00f6\u00f0ru FORTEZZA l\u00e9ni.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Be\u00f0i\u00f0 var um \u00f3\u00feekkt SSL dulk\u00f3\u00f0unarkerfi.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Engin dulk\u00f3\u00f0unarkerfi finnast e\u00f0a eru virkar \u00ed \u00feessu forriti.
SSL_ERROR_BAD_BLOCK_PADDING=SSL f\u00e9kk g\u00f6gn me\u00f0 galla\u00f0ri blokk fyllingu.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL f\u00e9kk g\u00f6gn sem f\u00f3ru yfir h\u00e1marksst\u00e6r\u00f0.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL reyndi a\u00f0 senda g\u00f6gn sem f\u00f3ru yfir h\u00e1marksst\u00e6r\u00f0.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL f\u00e9kk g\u00f6llu\u00f0 hall\u00f3 skilabo\u00f0.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL f\u00e9kk g\u00f6llu\u00f0 hall\u00f3 skilabo\u00f0 fr\u00e1 bi\u00f0lara.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL f\u00e9kk g\u00f6llu\u00f0 hall\u00f3 skilabo\u00f0 fr\u00e1 net\u00fej\u00f3ni.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL f\u00e9kk g\u00f6llu\u00f0 skilr\u00edki fr\u00e1 skilabo\u00f0i.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL f\u00e9kk g\u00f6llu\u00f0 skilabo\u00f0 me\u00f0 lykli net\u00fej\u00f3ns.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL f\u00e9kk g\u00f6llu\u00f0 skilabo\u00f0 me\u00f0 bei\u00f0ni um skilr\u00edki.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL f\u00e9kk g\u00f6llu\u00f0 hall\u00f3 b\u00fai\u00f0 skilabo\u00f0 fr\u00e1 net\u00fej\u00f3ni.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL f\u00e9kk g\u00f6llu\u00f0 skilabo\u00f0 me\u00f0 vottun \u00e1 skilr\u00edki.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL f\u00e9kk g\u00f6llu\u00f0 skilabo\u00f0 me\u00f0 lyklaskiptum bi\u00f0lara.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL f\u00e9kk g\u00f6llu\u00f0 endaskilabo\u00f0.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL f\u00e9kk g\u00f6llu\u00f0 skilabo\u00f0 fyrir skiptingu \u00e1 dulk\u00f3\u00f0un.
SSL_ERROR_RX_MALFORMED_ALERT=SSL f\u00e9kk g\u00f6llu\u00f0 a\u00f0v\u00f6runarskilabo\u00f0.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL f\u00e9kk g\u00f6llu\u00f0 handsala skilabo\u00f0.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL f\u00e9kk g\u00f6llu\u00f0 forritsg\u00f6gn.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL f\u00e9kk \u00f3v\u00e6nt hall\u00f3 skilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL f\u00e9kk \u00f3v\u00e6nt hall\u00f3 bi\u00f0laraskilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL f\u00e9kk \u00f3v\u00e6nt hall\u00f3 net\u00fej\u00f3nsskilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL f\u00e9kk \u00f3v\u00e6nt skilr\u00edkja skilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL f\u00e9kk \u00f3v\u00e6nt skilabo\u00f0 fyrir skiptingu \u00e1 lykli net\u00fej\u00f3ns.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL f\u00e9kk \u00f3v\u00e6nt skilr\u00edkja skilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL f\u00e9kk \u00f3v\u00e6nt endaskilabo\u00f0 fr\u00e1 net\u00fej\u00f3ni.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL f\u00e9kk \u00f3v\u00e6nt vottunarskilabo\u00f0 fyrir skilr\u00edki.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL f\u00e9kk \u00f3v\u00e6nt lyklaskipta skilabo\u00f0 fr\u00e1 bi\u00f0lara.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL f\u00e9kk \u00f3v\u00e6nt endaskilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL f\u00e9kk \u00f3v\u00e6nt skilabo\u00f0 fyrir skiptingu \u00e1 dulk\u00f3\u00f0un.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL f\u00e9kk \u00f3v\u00e6nt a\u00f0v\u00f6runarskilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL f\u00e9kk \u00f3v\u00e6nt handsala skilabo\u00f0.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL f\u00e9kk \u00f3v\u00e6nt forritsg\u00f6gn.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL f\u00e9kk g\u00f6gn me\u00f0 \u00f3\u00feekktri gagna tegund.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL f\u00e9kk handsala skilabo\u00f0 me\u00f0 \u00f3\u00feekktri skilabo\u00f0a tegund.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL f\u00e9kk a\u00f0v\u00f6runarskilabo\u00f0 me\u00f0 \u00f3\u00feekktri a\u00f0v\u00f6runarl\u00fdsingu.
SSL_ERROR_CLOSE_NOTIFY_ALERT=SSL jafningi loka\u00f0i tengingu.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=SSL jafningi bj\u00f3st ekki vi\u00f0 \u00feeim skilabo\u00f0um sem hann f\u00e9kk.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=SSL jafningi gat ekki afpakka\u00f0 \u00feau SSL g\u00f6gn sem hann f\u00e9kk.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=SSL jafningi gat ekki sam\u00feykkt \u00e1s\u00e6ttanlegar breytur fyrir \u00f6ryggi.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=SSL jafningi hafna\u00f0i skilabo\u00f0um vegna \u00f3\u00e1s\u00e6ttanlegra gagna.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=SSL jafningi sty\u00f0ur ekki skilr\u00edki fyrir m\u00f3ttekna tegund.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=SSL jafningi lenti \u00ed \u00f3skilgreindum vandam\u00e1lum me\u00f0 skilr\u00edki\u00f0 sem hann f\u00e9kk.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL f\u00e9kk villu \u00ed slembit\u00f6lugjafa.
SSL_ERROR_SIGN_HASHES_FAILURE=Get ekki undirskrifa\u00f0 g\u00f6gn sem eru nau\u00f0synleg til a\u00f0 sannvotta skilr\u00edki\u00f0 \u00feitt.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL gat ekki afpakka\u00f0 dreifilykli fr\u00e1 skilr\u00edki jafningja.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=\u00d3\u00feekkt villa vi\u00f0 me\u00f0h\u00f6ndlun skiptingu \u00e1 lykli SSL net\u00fej\u00f3ns.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=\u00d3\u00feekkt villa vi\u00f0 a\u00f0 me\u00f0h\u00f6ndla skiptingu \u00e1 lykli SSL bi\u00f0lara.
SSL_ERROR_ENCRYPTION_FAILURE=Dulk\u00f3\u00f0unar algr\u00edm bila\u00f0i fyrir vali\u00f0 dulk\u00f3\u00f0unarkerfi.
SSL_ERROR_DECRYPTION_FAILURE=Afk\u00f3\u00f0unar algr\u00edm bila\u00f0i fyrir vali\u00f0 dulk\u00f3\u00f0unarkerfi.
SSL_ERROR_SOCKET_WRITE_FAILURE=Villa vi\u00f0 a\u00f0 skrifa dulk\u00f3\u00f0u\u00f0 g\u00f6gn \u00e1 undirliggjandi tengingu.
SSL_ERROR_MD5_DIGEST_FAILURE=MD5 summufall mist\u00f3kst.
SSL_ERROR_SHA_DIGEST_FAILURE=SHA-1 summufall mist\u00f3kst.
SSL_ERROR_MAC_COMPUTATION_FAILURE=MAC \u00fatreikningur mist\u00f3kst.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Gat ekki b\u00fai\u00f0 til samhverfan lykil.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Gat ekki n\u00e1\u00f0 \u00fat samhverfum lykli fr\u00e1 lyklaskilabo\u00f0um bi\u00f0lara.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=SSL net\u00fej\u00f3nn reyndi a\u00f0 nota innlendan dreifilykil me\u00f0 \u00fatfluttu dulk\u00f3\u00f0unarkerfi.
SSL_ERROR_IV_PARAM_FAILURE=PKCS11 k\u00f3\u00f0a mist\u00f3kst a\u00f0 \u00fe\u00fd\u00f0a IV \u00ed breytu.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Gat ekki frumstillt vali\u00f0 dulk\u00f3\u00f0unarkerfi.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Bi\u00f0lara t\u00f3kst ekki a\u00f0 b\u00faa til lotulykla fyrir SSL lotu.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Net\u00fej\u00f3nn er ekki me\u00f0 neinn lykil fyrir lyklaskiptinga algr\u00edm.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=PKCS\#11 t\u00e1kn var sett inn e\u00f0a fjarl\u00e6gt \u00e1 me\u00f0an a\u00f0ger\u00f0 var \u00ed gangi.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Ekkert PKCS\#11 t\u00e1kn fannst til a\u00f0 framkv\u00e6ma nau\u00f0synlega a\u00f0ger\u00f0.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Get ekki haft \u00f6rugg samskipti vi\u00f0 jafningja\: engin \u00fej\u00f6ppunaralgr\u00edm eru sameiginleg.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Get ekki hafi\u00f0 n\u00fdtt SSL handsal fyrr en n\u00faverandi handsal er b\u00fai\u00f0.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=T\u00f3k \u00e1 m\u00f3ti r\u00f6ngum dulritu\u00f0um handsala gildum fr\u00e1 jafningja.
SSL_ERROR_CERT_KEA_MISMATCH=Ekki er h\u00e6gt a\u00f0 nota skilr\u00edki me\u00f0 vali\u00f0 lyklaskipta algr\u00edm.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Engin vottunarst\u00f6\u00f0 er treyst fyrir SSL bi\u00f0lara sannvottun.
SSL_ERROR_SESSION_NOT_FOUND=SSL lotu n\u00famer bi\u00f0lara fannst ekki \u00ed skyndiminni net\u00fej\u00f3ns.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Jafningi gat ekki dulr\u00e1\u00f0i\u00f0 m\u00f3ttekin SSL skilabo\u00f0.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Jafningi m\u00f3tt\u00f3k SSL skilabo\u00f0 sem var st\u00e6rri en leyfilegt er.
SSL_ERROR_UNKNOWN_CA_ALERT=Jafningi \u00feekkir ekki og treystir ekki \u00fea\u00f0 CA sem gat \u00fat \u00feitt skilr\u00edki.
SSL_ERROR_ACCESS_DENIED_ALERT=Jafningi t\u00f3k \u00e1 m\u00f3ti gildu skilr\u00edki, en a\u00f0gangur var ekki leyf\u00f0ur.
SSL_ERROR_DECODE_ERROR_ALERT=Jafningi gat ekki afk\u00f3ta\u00f0 SSL handsala skilabo\u00f0.
SSL_ERROR_DECRYPT_ERROR_ALERT=Jafningi tilkynnti a\u00f0 sannvottun undirskriftar e\u00f0a lyklaskipti mist\u00f3kust.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Jafningi tilkynnti a\u00f0 samningur v\u00e6ri ekki \u00ed samr\u00e6mi vi\u00f0 \u00fatflutningsreglur.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Jafningi tilkynnti \u00f3samh\u00e6fa e\u00f0a \u00f3studda \u00fatg\u00e1fu af samskiptareglum.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Net\u00fej\u00f3nn \u00fearfnast dulritunara\u00f0fer\u00f0a sem eru me\u00f0 meira \u00f6ryggi en \u00feeir sem bi\u00f0lari sty\u00f0ur.
SSL_ERROR_INTERNAL_ERROR_ALERT=Jafningi tilkynnti a\u00f0 upp kom innri villa.
SSL_ERROR_USER_CANCELED_ALERT=Jafningjanotanda h\u00e6tti vi\u00f0 handsal.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Jafningi leyfir ekki a\u00f0 endursami\u00f0 s\u00e9 um SSL \u00f6ryggisbreytur.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Skyndiminni SSL net\u00fej\u00f3ns er ekki stillt og ekki \u00f3virkt fyrir \u00feessa tengingu.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=SSL jafningi sty\u00f0ur ekki umbe\u00f0na TSL hall\u00f3 vi\u00f0b\u00f3t.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=SSL jafningi gat ekki n\u00e1\u00f0i \u00ed \u00feitt skilr\u00edki fr\u00e1 URL.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=SSL jafningi hefur ekki nein skilr\u00edki fyrir umbe\u00f0i\u00f0 DNS nafn.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=SSL jafningi gat ekki fengi\u00f0 OSCSP svar fyrir sitt skilr\u00edki.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=SSL jafningi tilkynnti galla\u00f0 gildi fyrir dulritun.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL t\u00f3k \u00e1 m\u00f3ti \u00f3v\u00e6ntum skilabo\u00f0um um n\u00fdja lotu.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL t\u00f3k \u00e1 m\u00f3ti g\u00f6llu\u00f0um skilabo\u00f0um um n\u00fdja lotu.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL t\u00f3k \u00e1 m\u00f3ti \u00fejappa\u00f0ri f\u00e6rslu sem t\u00f3kst ekki a\u00f0 af\u00fejappa.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=N\u00fdjar samningavi\u00f0r\u00e6\u00f0ur eru ekki leyf\u00f0ar \u00e1 \u00feessari SSL tengingu.
SSL_ERROR_UNSAFE_NEGOTIATION=Jafningi reyndi eldri tegund (hugsanlega \u00f3\u00f6ruggt) af handsali.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL t\u00f3k \u00e1 m\u00f3ti \u00f3v\u00e6ntri \u00f3\u00fejappa\u00f0ri f\u00e6rslu.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL t\u00f3k \u00e1 m\u00f3ti veikum skammt\u00edma Diffie-Hellman lykli \u00ed lyklaskilabo\u00f0um fr\u00e1 net\u00fej\u00f3ni.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL t\u00f3k \u00e1 m\u00f3ti \u00f3gildum NPN aukag\u00f6gnum.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=SSL eiginleiki er ekki studdur fyrir SSL 2.0 tengingar.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=SSL eiginleiki er ekki studdur fyrir net\u00fej\u00f3na.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=SSL eiginleiki er ekki studdur fyrir bi\u00f0lara.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=I/\u00da villa var\u00f0 \u00ed vottun \u00e1 \u00f6ryggisheimild.
SEC_ERROR_LIBRARY_FAILURE=bilun \u00ed \u00f6ryggissafni.
SEC_ERROR_BAD_DATA=\u00f6ryggissafn\: T\u00f3k \u00e1 m\u00f3ti g\u00f6llu\u00f0um g\u00f6gnum.
SEC_ERROR_OUTPUT_LEN=\u00f6ryggissafn\: villa \u00ed lengd \u00fattaks.
SEC_ERROR_INPUT_LEN=\u00f6ryggissafn f\u00e9kk villu \u00ed lengd \u00e1 inntaki.
SEC_ERROR_INVALID_ARGS=\u00f6ryggissafn\: Rangar breytur.
SEC_ERROR_INVALID_ALGORITHM=\u00f6ryggissafn\: rangt algr\u00edm.
SEC_ERROR_INVALID_AVA=\u00f6ryggissafn \: rangt AVA.
SEC_ERROR_INVALID_TIME=T\u00edma strengur me\u00f0 \u00f3gilt sni\u00f0.
SEC_ERROR_BAD_DER=\u00f6ryggissafn\: DER-k\u00f3\u00f0u\u00f0 skilabo\u00f0 forma\u00f0 rangt.
SEC_ERROR_BAD_SIGNATURE=Skilr\u00edki jafningja inniheldur vitlausa undirskrift.
SEC_ERROR_EXPIRED_CERTIFICATE=Skilr\u00edki jafningja er \u00fatrunni\u00f0.
SEC_ERROR_REVOKED_CERTIFICATE=Skilr\u00edki jafningja hefur veri\u00f0 afturkalla\u00f0.
SEC_ERROR_UNKNOWN_ISSUER=\u00datgefandi skilr\u00edkja jafningja er ekki \u00feekktur.
SEC_ERROR_BAD_KEY=Dreifilykill jafningja er rangur.
SEC_ERROR_BAD_PASSWORD=Innslegi\u00f0 \u00f6ryggislykilor\u00f0 er rangt.
SEC_ERROR_RETRY_PASSWORD=N\u00fdtt lykilor\u00f0 slegi\u00f0 rangt inn.  Reyndu aftur.
SEC_ERROR_NO_NODELOCK=\u00f6ryggissafn \: ekkert nodelock.
SEC_ERROR_BAD_DATABASE=\u00f6ryggissafn\: galla\u00f0ur gagnagrunnur.
SEC_ERROR_NO_MEMORY=\u00f6ryggissafn\: villa \u00ed minnis\u00fathlutun.
SEC_ERROR_UNTRUSTED_ISSUER=\u00datgefandi skilr\u00edkja jafningja hefur veri\u00f0 merktur sem ekki treystandi af notanda.
SEC_ERROR_UNTRUSTED_CERT=Skilr\u00edki jafningja hefur veri\u00f0 merkt sem ekki treystandi af notanda.
SEC_ERROR_DUPLICATE_CERT=Skilr\u00edki er \u00feegar til gagnagrunni.
SEC_ERROR_DUPLICATE_CERT_NAME=Ni\u00f0urhala\u00f0 nafn skilr\u00edkis er \u00feegar til \u00ed gagnagrunni.
SEC_ERROR_ADDING_CERT=Villa vi\u00f0 a\u00f0 b\u00e6ta skilr\u00edki \u00ed gagnagrunn.
SEC_ERROR_FILING_KEY=Villa vi\u00f0 a\u00f0 skr\u00e1 lykil fyrir \u00feetta skilr\u00edki.
SEC_ERROR_NO_KEY=Einkalykill skilr\u00edkis fannst ekki \u00ed lyklagrunni
SEC_ERROR_CERT_VALID=\u00deetta skilr\u00edki er gilt.
SEC_ERROR_CERT_NOT_VALID=\u00deetta skilr\u00edki er \u00f3gilt.
SEC_ERROR_CERT_NO_RESPONSE=Skilr\u00edkjasafn\: Ekkert svar
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=\u00datgefandi skilr\u00edkis er \u00fatrunninn.  Athuga\u00f0u klukkuna \u00e1 t\u00f6lvunni.
SEC_ERROR_CRL_EXPIRED=CRL fyrir \u00fatgefanda er \u00fatrunninn.  Uppf\u00e6r\u00f0u \u00fea\u00f0 e\u00f0a athuga\u00f0u klukkuna \u00e1 t\u00f6lvunni.
SEC_ERROR_CRL_BAD_SIGNATURE=CRL fyrir \u00fatgefanda inniheldur vitlausa undirskrift.
SEC_ERROR_CRL_INVALID=N\u00fdtt CRL er me\u00f0 \u00f3gilt sni\u00f0.
SEC_ERROR_EXTENSION_VALUE_INVALID=Vi\u00f0b\u00f3targildi skilr\u00edkis er g\u00f6llu\u00f0.
SEC_ERROR_EXTENSION_NOT_FOUND=Vi\u00f0b\u00f3tar skilr\u00edki fannst ekki.
SEC_ERROR_CA_CERT_INVALID=\u00datgefandi skilr\u00edkis er \u00f3gildur.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Skilyr\u00f0i \u00e1 sl\u00f3\u00f0arlengd skilr\u00edkis er rangt.
SEC_ERROR_CERT_USAGES_INVALID=Notkunarsv\u00e6\u00f0i skilr\u00edkis er rangt.
SEC_INTERNAL_ONLY=**A\u00d0EINS innri eining**
SEC_ERROR_INVALID_KEY=Lykill sty\u00f0ur ekki umbe\u00f0na a\u00f0ger\u00f0.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Skilr\u00edki inniheldur \u00f3\u00feekkta mikilv\u00e6ga vi\u00f0b\u00f3t.
SEC_ERROR_OLD_CRL=N\u00fdtt CRL er ekki n\u00fdrra en n\u00faverandi.
SEC_ERROR_NO_EMAIL_CERT=Ekki dulk\u00f3\u00f0a\u00f0 e\u00f0a undirskrifa\u00f0\: \u00fe\u00fa hefur ekki enn\u00fe\u00e1 t\u00f6lvup\u00f3sts skilr\u00edki.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Ekki dulk\u00f3\u00f0a\u00f0\: \u00fe\u00fa hefur ekki skilr\u00edki fyrir hvern einstakan vi\u00f0takanda.
SEC_ERROR_NOT_A_RECIPIENT=Get ekki dulr\u00e1\u00f0i\u00f0\: \u00fe\u00fa ert ekki vi\u00f0takandi, e\u00f0a einkalykill og skilr\u00edki sem passar fannst ekki.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Get ekki dulr\u00e1\u00f0i\u00f0\: dulk\u00f3\u00f0unarlykil algr\u00edm passar ekki vi\u00f0 \u00feitt skilr\u00edki.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Vottun undirskriftar mist\u00f3kst\: engin undirskrift fannst, of margar fundust, e\u00f0a \u00f3gild e\u00f0a g\u00f6llu\u00f0 g\u00f6gn.
SEC_ERROR_UNSUPPORTED_KEYALG=\u00d3stutt e\u00f0a \u00f3\u00feekkt lykla algr\u00edm.
SEC_ERROR_DECRYPTION_DISALLOWED=Get ekki dulr\u00e1\u00f0i\u00f0\: dulk\u00f3\u00f0un notar \u00f3leyfilegt algr\u00edm e\u00f0a lyklast\u00e6r\u00f0.
XP_SEC_FORTEZZA_BAD_CARD=Fortezza kort er ekki frumstillt r\u00e9tt.  Fjarl\u00e6g\u00f0u \u00fea\u00f0 og skila\u00f0u til baka til \u00fatgefanda.
XP_SEC_FORTEZZA_NO_CARD=Ekkert Fortezza kort fannst
XP_SEC_FORTEZZA_NONE_SELECTED=Ekkert Fortezza kort vali\u00f0
XP_SEC_FORTEZZA_MORE_INFO=Veldu pers\u00f3nuleika fyrir meiri uppl\u00fdsingar
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Pers\u00f3nuleiki fannst ekki
XP_SEC_FORTEZZA_NO_MORE_INFO=Engar meiri uppl\u00fdsingar um \u00feennan pers\u00f3nuleika
XP_SEC_FORTEZZA_BAD_PIN=\u00d3gilt pin leynin\u00famer
XP_SEC_FORTEZZA_PERSON_ERROR=Get ekki frumstillt Fortezza pers\u00f3nuleika.
SEC_ERROR_NO_KRL=Fann ekkert KRL fyrir skilr\u00edki \u00feessa vefsv\u00e6\u00f0is.
SEC_ERROR_KRL_EXPIRED=KRL fyrir skilr\u00edki vefsv\u00e6\u00f0is er \u00fatrunninn.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL fyrir skilr\u00edki \u00feessa vefsv\u00e6\u00f0is inniheldur ranga undirskrift.
SEC_ERROR_REVOKED_KEY=Skilr\u00edkjalykill vefsv\u00e6\u00f0is hefur veri\u00f0 afturkalla\u00f0ur.
SEC_ERROR_KRL_INVALID=N\u00fdtt KRL er \u00e1 \u00f3gildu sni\u00f0i.
SEC_ERROR_NEED_RANDOM=\u00f6ryggissafn\: vantar slembi g\u00f6gn.
SEC_ERROR_NO_MODULE=\u00f6ryggissafn\: engin \u00f6ryggiseining getur framkv\u00e6mt valda a\u00f0ger\u00f0.
SEC_ERROR_NO_TOKEN=Ekkert \u00f6ryggiskort fannst e\u00f0a t\u00f3ki er ekki til, \u00fearfnast frumstillingar, e\u00f0a hefur veri\u00f0 fjarl\u00e6g\u00f0ur.
SEC_ERROR_READ_ONLY=\u00f6ryggissafn\: gagnagrunnur er a\u00f0eins lesanlegur.
SEC_ERROR_NO_SLOT_SELECTED=Engin rauf e\u00f0a t\u00f3ki valin.
SEC_ERROR_CERT_NICKNAME_COLLISION=Skilr\u00edki me\u00f0 sama au\u00f0kenni er \u00feegar til.
SEC_ERROR_KEY_NICKNAME_COLLISION=Lykill me\u00f0 sama vi\u00f0urnefni er \u00feegar til.
SEC_ERROR_SAFE_NOT_CREATED=villa vi\u00f0 a\u00f0 b\u00faa til \u00f6ruggan hlut
SEC_ERROR_BAGGAGE_NOT_CREATED=villa vi\u00f0 a\u00f0 b\u00faa til farangurshlut
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Gat ekki fjarl\u00e6gt umbj\u00f3\u00f0anda
XP_JAVA_DELETE_PRIVILEGE_ERROR=Get ekki eytt s\u00e9rr\u00e9ttindunum
XP_JAVA_CERT_NOT_EXISTS_ERROR=Umbj\u00f3\u00f0andi er ekki me\u00f0 skilr\u00edki
SEC_ERROR_BAD_EXPORT_ALGORITHM=Nau\u00f0synlegt algr\u00edm er ekki leyft.
SEC_ERROR_EXPORTING_CERTIFICATES=Villa vi\u00f0 a\u00f0 flytja \u00fat skilr\u00edki.
SEC_ERROR_IMPORTING_CERTIFICATES=Villa vi\u00f0 a\u00f0 flytja inn skilr\u00edki.
SEC_ERROR_PKCS12_DECODING_PFX=Get ekki flutt inn.  Afk\u00f3tunarvilla.  Skr\u00e1 er \u00f3l\u00f6gleg.
SEC_ERROR_PKCS12_INVALID_MAC=Get ekki flutt inn.  \u00d3l\u00f6glegt MAC.  Vitlaust lykilor\u00f0 e\u00f0a skemmd skr\u00e1.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Get ekki flutt inn.  Ekki stu\u00f0ningur vi\u00f0 MAC algr\u00edm.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Get ekki flutt inn.  A\u00f0eins er stu\u00f0ningur vi\u00f0 \u00e1rei\u00f0anleika lykilor\u00f0s og fri\u00f0helgis ham.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Get ekki flutt inn.  Skr\u00e1arger\u00f0 er skemmd.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Get ekki flutt inn.  Enginn stu\u00f0ningur vi\u00f0 dulk\u00f3\u00f0unar algr\u00edm.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Get ekki flutt inn.  Enginn stu\u00f0ningur vi\u00f0 \u00fatg\u00e1fu skr\u00e1ar.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Get ekki flutt inn.  Vitlaust fri\u00f0helgis lykilor\u00f0.
SEC_ERROR_PKCS12_CERT_COLLISION=Get ekki flutt inn.  Sama au\u00f0kenni er \u00feegar til \u00ed gagnagrunni.
SEC_ERROR_USER_CANCELLED=Notandi \u00fdtti \u00e1 h\u00e6tta vi\u00f0.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Ekki flutt inn, er \u00feegar til \u00ed gagnagrunni.
SEC_ERROR_MESSAGE_SEND_ABORTED=P\u00f3stur ekki sendur.
SEC_ERROR_INADEQUATE_KEY_USAGE=Notkunarm\u00f6guleikar skilr\u00edkjalykils er ekki n\u00e6gjanlegur fyrir a\u00f0ger\u00f0.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tegund skilr\u00edkis hefur ekki veri\u00f0 sam\u00feykkt fyrir forrit.
SEC_ERROR_CERT_ADDR_MISMATCH=Heimilisfang \u00ed undirskrift skilr\u00edkis passar ekki vi\u00f0 heimilisfang \u00ed skilabo\u00f0ahaus.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Get ekki flutt inn.  Villa vi\u00f0 a\u00f0 flytja inn leynilykil.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Get ekki flutt inn.  Villa vi\u00f0 a\u00f0 flytja inn skilr\u00edkjake\u00f0ju.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Get ekki flutt \u00fat.  Finn ekki skilr\u00edki eftir lykli e\u00f0a au\u00f0kenni.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Get ekki flutt \u00fat.  Einkalykill fannst ekki.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Get ekki flutt \u00fat.  Get ekki skrifa\u00f0 \u00ed \u00fatflutta skr\u00e1.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Get ekki flutt inn.  Get ekki lesi\u00f0 innflutta skr\u00e1.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Get ekki flutt \u00fat.  Lyklagagnagrunnur er skemmdur e\u00f0a horfinn.
SEC_ERROR_KEYGEN_FAIL=Get ekki b\u00fai\u00f0 til Dreifilykil/Einkalykla par.
SEC_ERROR_INVALID_PASSWORD=Innslegi\u00f0 lykilor\u00f0 er \u00f3gilt.  Veldu anna\u00f0 lykilor\u00f0.
SEC_ERROR_RETRY_OLD_PASSWORD=Gamla lykilor\u00f0i\u00f0 slegi\u00f0 inn vitlaust. Reyndu aftur.
SEC_ERROR_BAD_NICKNAME=Au\u00f0kenni skilr\u00edkis er \u00feegar \u00ed notkun.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Jafningi FORTEZZA ke\u00f0ja inniheldur skilr\u00edki sem er ekki FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Ekki er h\u00e6gt a\u00f0 flytja vi\u00f0kv\u00e6man lykil \u00ed nau\u00f0synlega rauf.
SEC_ERROR_JS_INVALID_MODULE_NAME=\u00d3l\u00f6glegt nafn \u00e1 einingu.
SEC_ERROR_JS_INVALID_DLL=Rangur sl\u00f3\u00f0i/skr\u00e1arnafn \u00e1 einingu
SEC_ERROR_JS_ADD_MOD_FAILURE=Get ekki sett upp einingu
SEC_ERROR_JS_DEL_MOD_FAILURE=Get ekki eytt \u00f6ryggiseiningu
SEC_ERROR_OLD_KRL=N\u00fdr KRL er ekki n\u00fdrri en n\u00faverandi.
SEC_ERROR_CKL_CONFLICT=N\u00fdr CKL er me\u00f0 annann \u00fatgefanda en n\u00faverandi CKL. Ey\u00f0i n\u00faverandi CKL.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Vottunarst\u00f6\u00f0 \u00feessa skilr\u00edkis hefur ekki leyfi til a\u00f0 gefa \u00fat skilr\u00edki me\u00f0 \u00feessu nafni.
SEC_ERROR_KRL_NOT_YET_VALID=Lykill afturk\u00f6llunarlista skilr\u00edkja fyrir \u00feetta skilr\u00edki er ekki enn\u00fe\u00e1 gilt.
SEC_ERROR_CRL_NOT_YET_VALID=Afturk\u00f6llunarlisti skilr\u00edkja fyrir \u00feetta skilr\u00edki er ekki enn\u00fe\u00e1 gilt.
SEC_ERROR_UNKNOWN_CERT=Umbe\u00f0i\u00f0 skilr\u00edki fannst ekki.
SEC_ERROR_UNKNOWN_SIGNER=Skilr\u00edki undirskriftar fannst ekki.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Sta\u00f0setning net\u00fej\u00f3ns fyrir st\u00f6\u00f0u skilr\u00edkis er me\u00f0 r\u00f6ngu sni\u00f0i.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Ekki er h\u00e6gt a\u00f0 afk\u00f3\u00f0a OCSP svar; \u00fea\u00f0 er af \u00f3\u00feekktri tegund.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=OCSP \u00fej\u00f3nn skila\u00f0i \u00f3v\u00e6ntum/\u00f3gildum HTTP g\u00f6gnum.
SEC_ERROR_OCSP_MALFORMED_REQUEST=OCSP \u00fej\u00f3nn tilkynnti a\u00f0 bei\u00f0nin v\u00e6ri g\u00f6llu\u00f0 e\u00f0a \u00e1 r\u00f6ngu sni\u00f0i.
SEC_ERROR_OCSP_SERVER_ERROR=OCSP \u00fej\u00f3nn f\u00e9kk innri villu.
SEC_ERROR_OCSP_TRY_SERVER_LATER=OCSP \u00fej\u00f3nn m\u00e6lir me\u00f0 \u00fev\u00ed a\u00f0 reyna aftur.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=OCSP \u00fej\u00f3nn \u00fearfnast undirskriftar fyrir \u00feessa bei\u00f0ni.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=OCSP \u00fej\u00f3nn neitar \u00feessari bei\u00f0ni vegna \u00feess a\u00f0 h\u00fan er \u00f3heimil.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=OCSP \u00fej\u00f3nn skila\u00f0i \u00f3\u00feekktri st\u00f6\u00f0u.
SEC_ERROR_OCSP_UNKNOWN_CERT=OCSP \u00fej\u00f3nn er ekki me\u00f0 st\u00f6\u00f0u fyrir skilr\u00edki\u00f0.
SEC_ERROR_OCSP_NOT_ENABLED=\u00de\u00fa ver\u00f0ur a\u00f0 virkja OCSP \u00e1\u00f0ur en \u00fe\u00fa keyrir \u00feessa a\u00f0ger\u00f0.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=\u00de\u00fa ver\u00f0ur a\u00f0 setja sj\u00e1lfgefinn OCSP svaranda \u00e1\u00f0ur en \u00fe\u00fa framkv\u00e6mir \u00feessa a\u00f0ger\u00f0.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Svar fr\u00e1 OCSP \u00fej\u00f3ni var galla\u00f0 e\u00f0a me\u00f0 r\u00f6ngu sni\u00f0i.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Undirskrifari OCSP svars hefur ekki leyfi til a\u00f0 gefa st\u00f6\u00f0u skilr\u00edkis.
SEC_ERROR_OCSP_FUTURE_RESPONSE=OCSP svar er ekki enn\u00fe\u00e1 gilt (inniheldur dagsetningu sem er \u00ed framt\u00ed\u00f0inni).
SEC_ERROR_OCSP_OLD_RESPONSE=OCSP svar inniheldur g\u00f6gn sem eru \u00fatrunninn.
SEC_ERROR_DIGEST_NOT_FOUND=CMS e\u00f0a PKCS \#7 summa fannst ekki \u00ed undirskrifu\u00f0um skilabo\u00f0um.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=CMS e\u00f0a PKCS \#7 skilabo\u00f0ategund er ekki studd.
SEC_ERROR_MODULE_STUCK=Ekki var h\u00e6gt a\u00f0 fjarl\u00e6gja PKCS \#11 einingu \u00fear sem h\u00fan er enn\u00fe\u00e1 \u00ed notkun.
SEC_ERROR_BAD_TEMPLATE=Get ekki afk\u00f3\u00f0a\u00f0 ASN.1 g\u00f6gn. Skilgreint sni\u00f0m\u00e1t var rangt.
SEC_ERROR_CRL_NOT_FOUND=Ekkert CRL fannst sem passa\u00f0i.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=\u00de\u00fa ert a\u00f0 reyna a\u00f0 flytja inn skilr\u00edki sem er me\u00f0 sama \u00fatgefanda/ra\u00f0n\u00famer og skilr\u00edki sem fyrir er, en er samt ekki sama skilr\u00edki.
SEC_ERROR_BUSY=Ekki var h\u00e6gt a\u00f0 sl\u00f6kkva \u00e1 NSS. Hlutir eru enn \u00ed notkun.
SEC_ERROR_EXTRA_INPUT=DER-k\u00f3\u00f0u\u00f0 skilabo\u00f0 innihalda aukalega \u00f3notu\u00f0 g\u00f6gn.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=\u00d3studdur sporger ferill.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=\u00d3studdur sporger ferill punkta form.
SEC_ERROR_UNRECOGNIZED_OID=\u00d3\u00feekkt au\u00f0kenni hlutar.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=\u00d3gilt OCSP skilr\u00edkisundirskrift \u00ed OCSP svari.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Skilr\u00edki hefur veri\u00f0 afturkalla\u00f0 \u00ed afturk\u00f6llunarlista \u00fatgefanda.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=\u00datgefandi OCSP svaranda tilkynnti a\u00f0 skilr\u00edki hef\u00f0i veri\u00f0 afturkalla\u00f0.
SEC_ERROR_CRL_INVALID_VERSION=Afturk\u00f6llunarlisti \u00fatgefanda er me\u00f0 \u00f3\u00feekkt \u00fatg\u00e1fun\u00famer.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=V1 afturk\u00f6llunarlisti \u00fatgefanda inniheldur nau\u00f0synlega vi\u00f0b\u00f3t.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=V2 afturk\u00f6llunarlisti \u00fatgefanda inniheldur \u00f3\u00feekkta nau\u00f0synlega vi\u00f0b\u00f3t.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=\u00d3\u00feekkt skilgreining \u00e1 tegund hlutar.
SEC_ERROR_INCOMPATIBLE_PKCS11=PKCS \#11 rekill br\u00fdtur h\u00f6nnunarl\u00fdsingu \u00e1 \u00f3samr\u00fdmanlegan h\u00e1tt.
SEC_ERROR_NO_EVENT=Engin n\u00fd atbur\u00f0arrauf er til sta\u00f0ar n\u00fana.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL er \u00feegar til.
SEC_ERROR_NOT_INITIALIZED=NSS hefur ekki veri\u00f0 frumstillt.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=A\u00f0ger\u00f0 mist\u00f3kst \u00fear sem PKCS\#11 t\u00f3ki er ekki innskr\u00e1\u00f0ur.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Skilgreint skilr\u00edki fyrir OCSP svaranda er rangt.
SEC_ERROR_OCSP_BAD_SIGNATURE=OCSP svar er me\u00f0 \u00f3gilda undirskrift.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Leit \u00e1 sannreyningu skilr\u00edkis er fyrir utan leitartakm\u00f6rk
SEC_ERROR_INVALID_POLICY_MAPPING=Regluv\u00f6rpun inniheldur anypolicy
SEC_ERROR_POLICY_VALIDATION_FAILED=Skilr\u00edkjake\u00f0ja uppfyllir ekki reglupr\u00f3fun
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=\u00d3\u00feekkt sta\u00f0setningartegund \u00ed skilr\u00edki AIA vi\u00f0b\u00f3t
SEC_ERROR_BAD_HTTP_RESPONSE=Net\u00fej\u00f3nn skila\u00f0i g\u00f6llu\u00f0u HTTP svari
SEC_ERROR_BAD_LDAP_RESPONSE=Net\u00fej\u00f3nn skila\u00f0i g\u00f6llu\u00f0u LDAP svari
SEC_ERROR_FAILED_TO_ENCODE_DATA=Gat ekki umbreytt g\u00f6gnum me\u00f0 ASN1 k\u00f3\u00f0ara
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Rangar uppl\u00fdsingar fyrir a\u00f0gangssta\u00f0setningu \u00ed skilr\u00edkjavi\u00f0b\u00f3t
SEC_ERROR_LIBPKIX_INTERNAL=Libpkix innri villa kom upp \u00feegar veri\u00f0 var a\u00f0 sannreyna skilr\u00edki.
SEC_ERROR_PKCS11_GENERAL_ERROR=PKCS \#11 eining skila\u00f0i CKR_GENERAL_ERROR, sem gefur til kynna a\u00f0 \u00f3afturkr\u00e6f villa hafi komi\u00f0 upp.
SEC_ERROR_PKCS11_FUNCTION_FAILED=PKCS \#11 eining skila\u00f0i CKR_FUNCTION_FAILED, sem gefur til kynna a\u00f0 ekki t\u00f3kst a\u00f0 framkv\u00e6ma vi\u00f0komandi a\u00f0ger\u00f0.  Hugsanlega tekst a\u00f0ger\u00f0in aftur ef h\u00fan er endurtekin.
SEC_ERROR_PKCS11_DEVICE_ERROR=PKCS \#11 eining skila\u00f0i CKR_DEVICE_ERROR, sem gefur til kynna a\u00f0 upp hafi komi\u00f0 vandam\u00e1l me\u00f0 t\u00f3ka e\u00f0a rauf.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=\u00d3\u00feekktar uppl\u00fdsingar fyrir a\u00f0gangsa\u00f0ger\u00f0 \u00ed skilr\u00edkjavi\u00f0b\u00f3t.
SEC_ERROR_CRL_IMPORT_FAILED=Villa vi\u00f0 a\u00f0 reyna a\u00f0 flytja inn CRL.
SEC_ERROR_EXPIRED_PASSWORD=Lykilor\u00f0i\u00f0 er \u00fatrunni\u00f0.
SEC_ERROR_LOCKED_PASSWORD=Lykilor\u00f0 er l\u00e6st.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=\u00d3\u00feekkt PKCS \#11 villa.
SEC_ERROR_BAD_CRL_DP_URL=\u00d3gilt e\u00f0a \u00f3stutt URL \u00ed CRL dreifingarnafni.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Skilr\u00edki\u00f0 var undirrita\u00f0 af undirskriftar algr\u00edmi sem er \u00f3virkt vegna \u00feess a\u00f0 \u00fea\u00f0 er ekki \u00f6ruggt.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

