#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=O endere\u00e7o (URL) n\u00e3o \u00e9 v\u00e1lido e n\u00e3o pode ser carregado.
fileNotFound=O Pale Moon n\u00e3o conseguiu localizar o arquivo %S.
dnsNotFound=O Pale Moon n\u00e3o conseguiu localizar %S.
protocolNotFound=O Pale Moon n\u00e3o sabe como abrir este endere\u00e7o.\nO protocolo \u201c%S\u201d n\u00e3o est\u00e1 associado a nenhum aplicativo.
connectionFailure=O Pale Moon n\u00e3o conseguiu estabelecer uma conex\u00e3o com o servidor %S.
netInterrupt=A conex\u00e3o para %S foi interrompida durante o carregamento da p\u00e1gina.
netTimeout=O servidor %S demorou muito para responder.
redirectLoop=O Pale Moon detectou que o pedido para este endere\u00e7o n\u00e3o ser\u00e1 conclu\u00eddo devido \u00e0 forma que o servidor o est\u00e1 redirecionando.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Para exibir esta p\u00e1gina, o %S precisa enviar informa\u00e7\u00f5es que repetir\u00e3o qualquer a\u00e7\u00e3o efetuada anteriormente (como uma pesquisa ou confirma\u00e7\u00e3o de compra).
resendButton.label=Reenviar
unknownSocketType=O Pale Moon n\u00e3o sabe como comunicar-se com este servidor.
netReset=A conex\u00e3o para o servidor foi reiniciada durante o carregamento da p\u00e1gina.
notCached=Este documento n\u00e3o est\u00e1 mais dispon\u00edvel.
netOffline=O Pale Moon est\u00e1 no modo offline e n\u00e3o pode navegar na web.
isprinting=Este documento n\u00e3o pode ser modificado durante a impress\u00e3o ou visualizar impress\u00e3o.
deniedPortAccess=Este endere\u00e7o especifica uma porta de rede geralmente usada para prop\u00f3sitos que n\u00e3o a navega\u00e7\u00e3o web. Para sua prote\u00e7\u00e3o, o Pale Moon cancelou o pedido.
proxyResolveFailure=O Pale Moon est\u00e1 configurado para usar um servidor proxy que n\u00e3o p\u00f4de ser localizado.
proxyConnectFailure=O Pale Moon est\u00e1 configurado para usar um servidor proxy que est\u00e1 recusando conex\u00f5es.
contentEncodingError=A p\u00e1gina que voc\u00ea est\u00e1 tentando abrir n\u00e3o pode ser exibida porque usa uma forma n\u00e3o suportada ou inv\u00e1lida de compacta\u00e7\u00e3o.
unsafeContentType=A p\u00e1gina que voc\u00ea est\u00e1 tentando abrir n\u00e3o pode ser exibida porque est\u00e1 contida em um tipo de arquivo que pode n\u00e3o ser seguro abrir. Por favor, contate os respons\u00e1veis pelo site para inform\u00e1-los deste problema.
externalProtocolTitle=Solicita\u00e7\u00e3o de protocolo externo
externalProtocolPrompt=Um aplicativo precisa ser executado para abrir endere\u00e7os \u201c%1$S\:\u201d.\n\n\nEndere\u00e7o\:\n\n%2$S\n\nAplicativo\: %3$S\n\n\nSe este pedido n\u00e3o era esperado ent\u00e3o pode ser uma tentativa de explorar uma falha do aplicativo solicitado. Cancele se n\u00e3o puder certificar-se de que ele n\u00e3o \u00e9 mal-intencionado.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Desconhecido>
externalProtocolChkMsg=Memorizar a decis\u00e3o para os endere\u00e7os deste tipo
externalProtocolLaunchBtn=Executar aplicativo
malwareBlocked=O site %S foi considerado um foco de ataques e foi bloqueado de acordo com as suas prefer\u00eancias de seguran\u00e7a.
phishingBlocked=O site %S foi considerado uma falsifica\u00e7\u00e3o criada para enganar usu\u00e1rios e conseguir informa\u00e7\u00f5es pessoais ou financeiras.
cspFrameAncestorBlocked=Esta p\u00e1gina possui uma pol\u00edtica de seguran\u00e7a de conte\u00fado que a impede de ser integrada desta forma.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=A p\u00e1gina que voc\u00ea est\u00e1 tentando abrir n\u00e3o p\u00f4de ser exibida porque foi detectado um erro na transmiss\u00e3o.
remoteXUL=Esta p\u00e1gina usa uma tecnologia n\u00e3o suportada que est\u00e1, por padr\u00e3o, indispon\u00edvel no Pale Moon.

