#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Impossible de communiquer en mode s\u00e9curis\u00e9. Le pair ne g\u00e8re pas le chiffrement de haut niveau.
SSL_ERROR_US_ONLY_SERVER=Impossible de communiquer en mode s\u00e9curis\u00e9. Le pair requiert un chiffrement de haut niveau qui n'est pas g\u00e9r\u00e9.
SSL_ERROR_NO_CYPHER_OVERLAP=Impossible de communiquer en mode s\u00e9curis\u00e9 avec le pair\u00a0\: aucun algorithme de chiffrement en commun.
SSL_ERROR_NO_CERTIFICATE=Impossible de trouver le certificat ou la cl\u00e9 n\u00e9cessaire \u00e0 l'authentification.
SSL_ERROR_BAD_CERTIFICATE=Impossible de communiquer en mode s\u00e9curis\u00e9 avec le pair\u00a0\: le certificat du pair a \u00e9t\u00e9 rejet\u00e9.
SSL_ERROR_UNUSED_5=Code d'erreur SSL non reconnu.
SSL_ERROR_BAD_CLIENT=Le serveur a rencontr\u00e9 des donn\u00e9es incorrectes en provenance du client.
SSL_ERROR_BAD_SERVER=Le client a rencontr\u00e9 des donn\u00e9es incorrectes en provenance du serveur.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Type de certificat non g\u00e9r\u00e9.
SSL_ERROR_UNSUPPORTED_VERSION=Le pair utilise une version non g\u00e9r\u00e9e du protocole de s\u00e9curit\u00e9.
SSL_ERROR_UNUSED_10=Code d'erreur SSL non reconnu.
SSL_ERROR_WRONG_CERTIFICATE=L'authentification du client a \u00e9chou\u00e9\u00a0\: la cl\u00e9 priv\u00e9e dans la base de donn\u00e9es des cl\u00e9s ne correspond pas \u00e0 la cl\u00e9 publique dans la base de donn\u00e9es des certificats.
SSL_ERROR_BAD_CERT_DOMAIN=Impossible de communiquer en mode s\u00e9curis\u00e9 avec le pair\u00a0\: le nom de domaine demand\u00e9 ne correspond pas au certificat du serveur.
SSL_ERROR_POST_WARNING=Code d'erreur SSL non reconnu.
SSL_ERROR_SSL2_DISABLED=Le pair ne g\u00e8re que la version 2 de SSL, qui est d\u00e9sactiv\u00e9e localement.
SSL_ERROR_BAD_MAC_READ=SSL a re\u00e7u un enregistrement avec un code d'authentification de message incorrect.
SSL_ERROR_BAD_MAC_ALERT=Le pair SSL signale un code d'authentification de message incorrect.
SSL_ERROR_BAD_CERT_ALERT=Le pair SSL ne peut pas v\u00e9rifier votre certificat.
SSL_ERROR_REVOKED_CERT_ALERT=Le pair SSL a rejet\u00e9 votre certificat car celui-ci est r\u00e9voqu\u00e9.
SSL_ERROR_EXPIRED_CERT_ALERT=Le pair SSL a rejet\u00e9 votre certificat car celui-ci a expir\u00e9.
SSL_ERROR_SSL_DISABLED=Impossible de se connecter\u00a0\: SSL est d\u00e9sactiv\u00e9.
SSL_ERROR_FORTEZZA_PQG=Impossible de se connecter\u00a0\: le pair SSL est dans un autre domaine FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Une suite de chiffrement SSL inconnue a \u00e9t\u00e9 demand\u00e9e.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Aucune suite de chiffrement n'est pr\u00e9sente et activ\u00e9e dans ce programme.
SSL_ERROR_BAD_BLOCK_PADDING=SSL a re\u00e7u un enregistrement avec un mauvais remplissage de bloc.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL a re\u00e7u un enregistrement qui d\u00e9passe la longueur maximale autoris\u00e9e.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL a essay\u00e9 d'envoyer un enregistrement d\u00e9passant la taille maximale autoris\u00e9e.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Hello Request\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Client Hello\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Server Hello\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Certificate\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Server Key Exchange\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Certificate Request\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Server Hello Done\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Certificate Verify\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Client Key Exchange\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Finished\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL a re\u00e7u un enregistrement \u00ab\u00a0Change Cipher Spec\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_ALERT=SSL a re\u00e7u un enregistrement \u00ab\u00a0Alert\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL a re\u00e7u un enregistrement \u00ab\u00a0Handshake\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL a re\u00e7u un enregistrement \u00ab\u00a0Application Data\u00a0\u00bb malform\u00e9.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Hello Request\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Client Hello\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Server Hello\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Certificate\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Server Key Exchange\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Certificate Request\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Server Hello Done\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Certificate Verify\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Client Key Exchange\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0Finished\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL a re\u00e7u un enregistrement \u00ab\u00a0Change Cipher Spec\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL a re\u00e7u un enregistrement \u00ab\u00a0Alert\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL a re\u00e7u un enregistrement \u00ab\u00a0Handshake\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL a re\u00e7u un enregistrement \u00ab\u00a0Application Data\u00a0\u00bb inattendu.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL a re\u00e7u un enregistrement avec un type de contenu inconnu.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL a re\u00e7u un message d'\u00e9tablissement de liaison avec un type de message inconnu.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL a re\u00e7u un enregistrement d'alerte avec une description d'alerte inconnue.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Le pair SSL a ferm\u00e9 cette connexion.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Le pair SSL ne s'attendait pas \u00e0 recevoir le message d'\u00e9tablissement de liaison qu'il a re\u00e7u.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=La pair SSL n'a pas r\u00e9ussi \u00e0 d\u00e9compresser un enregistrement SSL qu'il a re\u00e7u.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=Le pair SSL n'a pas r\u00e9ussi \u00e0 n\u00e9gocier un jeu de param\u00e8tres de s\u00e9curit\u00e9 acceptable.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Le pair SSL a rejet\u00e9 un message d'\u00e9tablissement de liaison \u00e0 cause d'un contenu inacceptable.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Le pair SSL ne g\u00e8re pas le type des certificats qu'il a re\u00e7us.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Le pair SSL a eu un probl\u00e8me non sp\u00e9cifi\u00e9 avec le certificat qu'il a re\u00e7u.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL a rencontr\u00e9 un \u00e9chec de son g\u00e9n\u00e9rateur de nombres al\u00e9atoires.
SSL_ERROR_SIGN_HASHES_FAILURE=Impossible de signer num\u00e9riquement les donn\u00e9es requises pour v\u00e9rifier votre certificat.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL n'a pas pu extraire la cl\u00e9 publique du certificat du pair.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=\u00c9chec non sp\u00e9cifi\u00e9 lors du traitement de l'\u00e9tablissement de liaison \u00ab\u00a0SSL Server Key Exchange\u00a0\u00bb.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=\u00c9chec non sp\u00e9cifi\u00e9 lors du traitement de l'\u00e9tablissement de liaison \u00ab\u00a0SSL Client Key Exchange\u00a0\u00bb.
SSL_ERROR_ENCRYPTION_FAILURE=L'algorithme de chiffrement de donn\u00e9es en volume a \u00e9chou\u00e9 pour la suite de chiffrement s\u00e9lectionn\u00e9e.
SSL_ERROR_DECRYPTION_FAILURE=L'algorithme de d\u00e9chiffrement de donn\u00e9es en volume a \u00e9chou\u00e9 pour la suite de chiffrement s\u00e9lectionn\u00e9e.
SSL_ERROR_SOCKET_WRITE_FAILURE=La tentative d'\u00e9criture de donn\u00e9es chiffr\u00e9es vers l'interface de connexion sous-jacente a \u00e9chou\u00e9.
SSL_ERROR_MD5_DIGEST_FAILURE=La fonction de pr\u00e9traitement MD5 a \u00e9chou\u00e9.
SSL_ERROR_SHA_DIGEST_FAILURE=La fonction de pr\u00e9traitement SHA-1 a \u00e9chou\u00e9.
SSL_ERROR_MAC_COMPUTATION_FAILURE=Le calcul MAC a \u00e9chou\u00e9.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=\u00c9chec de cr\u00e9ation du contexte de cl\u00e9s sym\u00e9triques.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=\u00c9chec de l'extraction de la cl\u00e9 sym\u00e9trique dans le message \u00ab\u00a0Client Key Exchange\u00a0\u00bb.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Le serveur SSL a tent\u00e9 d'utiliser une cl\u00e9 publique nationale avec une suite de chiffrement destin\u00e9e \u00e0 l'exportation.
SSL_ERROR_IV_PARAM_FAILURE=Le code PKCS11 a \u00e9chou\u00e9 lors de la traduction d'un IV en param\u00e8tre.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=\u00c9chec de l'initialisation de la suite de chiffrement s\u00e9lectionn\u00e9e.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Le client n'a pas r\u00e9ussi \u00e0 g\u00e9n\u00e9rer de cl\u00e9s de session pour la session SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Le serveur n'a pas de cl\u00e9 pour l'algorithme d'\u00e9change de cl\u00e9s utilis\u00e9.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=Le jeton PKCS\#11 a \u00e9t\u00e9 ins\u00e9r\u00e9 ou supprim\u00e9 pendant qu'une op\u00e9ration \u00e9tait en cours.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Aucun jeton PKCS\#11 n'a \u00e9t\u00e9 trouv\u00e9 pour accomplir une op\u00e9ration requise.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Impossible de communiquer en mode s\u00e9curis\u00e9 avec le pair\u00a0\: aucun algorithme de compression en commun.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Impossible d'initialiser un autre \u00e9tablissement de liaison SSL tant que celui en cours n'est pas termin\u00e9.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=R\u00e9ception de valeurs d'empreintes num\u00e9riques incorrectes lors de l'\u00e9tablissement de liaison avec le pair.
SSL_ERROR_CERT_KEA_MISMATCH=Le certificat fourni ne peut \u00eatre utilis\u00e9 avec l'algorithme d'\u00e9change de cl\u00e9s s\u00e9lectionn\u00e9.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Aucune autorit\u00e9 de certification n'est \u00e9prouv\u00e9e pour l'authentification client SSL.
SSL_ERROR_SESSION_NOT_FOUND=L'identifiant de session SSL du client n'a pas \u00e9t\u00e9 trouv\u00e9 dans le cache de session du serveur.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Le pair n'a pas pu d\u00e9chiffrer un enregistrement SSL qu'il a re\u00e7u.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Le pair a re\u00e7u un enregistrement SSL plus long que la taille permise.
SSL_ERROR_UNKNOWN_CA_ALERT=Le pair ne reconna\u00eet pas l'autorit\u00e9 de certification qui a d\u00e9livr\u00e9 votre certificat et ne lui fait pas confiance.
SSL_ERROR_ACCESS_DENIED_ALERT=Le pair a re\u00e7u un certificat valable mais l'acc\u00e8s a \u00e9t\u00e9 refus\u00e9.
SSL_ERROR_DECODE_ERROR_ALERT=Le pair n'a pas pu d\u00e9coder un message d'\u00e9tablissement de liaison SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=Le pair signale un \u00e9chec de la v\u00e9rification de signature ou de l'\u00e9change de cl\u00e9s.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Le pair signale une n\u00e9gociation qui n'est pas en conformit\u00e9 avec les lois sur l'exportation.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Le pair signale une version de protocole non compatible ou non g\u00e9r\u00e9e.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Le serveur requiert des chiffrements plus s\u00fbrs que ceux g\u00e9r\u00e9s par le client.
SSL_ERROR_INTERNAL_ERROR_ALERT=Le pair signale qu'il a eu une erreur interne.
SSL_ERROR_USER_CANCELED_ALERT=L'utilisateur pair a annul\u00e9 l'\u00e9tablissement de liaison.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Le pair ne permet pas la ren\u00e9gociation des param\u00e8tres de s\u00e9curit\u00e9 SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Le cache du serveur SSL n'est pas configur\u00e9 et n'est pas d\u00e9sactiv\u00e9 pour cette interface de connexion.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Le pair SSL ne g\u00e8re pas l'extension \u00ab\u00a0TLS Hello\u00a0\u00bb requise.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Le pair SSL n'a pas pu obtenir votre certificat \u00e0 partir de l'URL fournie.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Le pair SSL n'a pas de certificat pour le nom DNS demand\u00e9.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Le pair SSL n'a pas pu obtenir de r\u00e9ponse OCSP pour son certificat.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Le pair SSL signale une valeur d'empreinte num\u00e9rique de certificat incorrecte.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0New Session Ticket\u00a0\u00bb inattendu.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL a re\u00e7u un message d'\u00e9tablissement de liaison \u00ab\u00a0New Session Ticket\u00a0\u00bb mal form\u00e9.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL a re\u00e7u un enregistrement compress\u00e9 qu'il n'a pas pu d\u00e9compresser.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=La ren\u00e9gociation n'est pas autoris\u00e9e sur cette interface de connexion SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=Le pair a essay\u00e9 un \u00e9tablissement de liaison obsol\u00e8te (potentiellement vuln\u00e9rable).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL a re\u00e7u un enregistrement non-compress\u00e9 inattendu.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL a re\u00e7u une cl\u00e9 Diffie-Hellman \u00e9ph\u00e9m\u00e8re faible dans le message d'\u00e9tablissement de liaison \u00ab\u00a0Server Key Exchange\u00a0\u00bb.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL a re\u00e7u des donn\u00e9es d'extension NPN invalides.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Fonctionnalit\u00e9 SSL non g\u00e9r\u00e9e pour les connexions SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Fonctionnalit\u00e9 SSL non g\u00e9r\u00e9e pour les serveurs.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Fonctionnalit\u00e9 SSL non g\u00e9r\u00e9e pour les clients.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Une erreur d'entr\u00e9e/sortie est survenue pendant l'autorisation de s\u00e9curit\u00e9.
SEC_ERROR_LIBRARY_FAILURE=\u00c9chec de la biblioth\u00e8que de s\u00e9curit\u00e9.
SEC_ERROR_BAD_DATA=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: donn\u00e9es incorrectes re\u00e7ues.
SEC_ERROR_OUTPUT_LEN=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: erreur de longueur des donn\u00e9es en sortie.
SEC_ERROR_INPUT_LEN=La biblioth\u00e8que de s\u00e9curit\u00e9 a rencontr\u00e9 une erreur de longueur des donn\u00e9es en entr\u00e9e.
SEC_ERROR_INVALID_ARGS=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: arguments invalides.
SEC_ERROR_INVALID_ALGORITHM=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: algorithme non valable.
SEC_ERROR_INVALID_AVA=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: AVA non valable.
SEC_ERROR_INVALID_TIME=Cha\u00eene temporelle mal format\u00e9e.
SEC_ERROR_BAD_DER=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: message encod\u00e9 en DER mal format\u00e9.
SEC_ERROR_BAD_SIGNATURE=Le certificat du pair a une signature non valable.
SEC_ERROR_EXPIRED_CERTIFICATE=Le certificat du pair a expir\u00e9.
SEC_ERROR_REVOKED_CERTIFICATE=Le certificat du pair a \u00e9t\u00e9 r\u00e9voqu\u00e9.
SEC_ERROR_UNKNOWN_ISSUER=L'autorit\u00e9 de d\u00e9livrance du certificat du pair n'est pas reconnue.
SEC_ERROR_BAD_KEY=La cl\u00e9 publique du pair est non valable.
SEC_ERROR_BAD_PASSWORD=Le mot de passe de s\u00e9curit\u00e9 saisi est incorrect.
SEC_ERROR_RETRY_PASSWORD=Le nouveau mot de passe a \u00e9t\u00e9 saisi de mani\u00e8re incorrecte. Merci de r\u00e9essayer.
SEC_ERROR_NO_NODELOCK=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: aucun verrou de n\u0153ud.
SEC_ERROR_BAD_DATABASE=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: mauvaise base de donn\u00e9es.
SEC_ERROR_NO_MEMORY=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: \u00e9chec d'allocation m\u00e9moire.
SEC_ERROR_UNTRUSTED_ISSUER=L'autorit\u00e9 de d\u00e9livrance du certificat du pair a \u00e9t\u00e9 marqu\u00e9e comme non digne de confiance par l'utilisateur.
SEC_ERROR_UNTRUSTED_CERT=Le certificat du pair a \u00e9t\u00e9 marqu\u00e9 comme non digne de confiance par l'utilisateur.
SEC_ERROR_DUPLICATE_CERT=Le certificat existe d\u00e9j\u00e0 dans votre base de donn\u00e9es.
SEC_ERROR_DUPLICATE_CERT_NAME=Le nom du certificat t\u00e9l\u00e9charg\u00e9 existe d\u00e9j\u00e0 dans votre base de donn\u00e9es.
SEC_ERROR_ADDING_CERT=Erreur lors de l'ajout d'un certificat \u00e0 la base de donn\u00e9es.
SEC_ERROR_FILING_KEY=Erreur lors de l'ajout de cl\u00e9 pour ce certificat.
SEC_ERROR_NO_KEY=La cl\u00e9 priv\u00e9e pour ce certificat n'a pas \u00e9t\u00e9 trouv\u00e9e dans la base de donn\u00e9es des cl\u00e9s.
SEC_ERROR_CERT_VALID=Ce certificat est valable.
SEC_ERROR_CERT_NOT_VALID=Ce certificat n'est pas valable.
SEC_ERROR_CERT_NO_RESPONSE=Biblioth\u00e8que de certificat\u00a0\: pas de r\u00e9ponse
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Le certificat de l'autorit\u00e9 de d\u00e9livrance du certificat a expir\u00e9. V\u00e9rifier la date et l'heure de votre syst\u00e8me.
SEC_ERROR_CRL_EXPIRED=La liste de certificats r\u00e9voqu\u00e9s pour l'autorit\u00e9 de d\u00e9livrance du certificat a expir\u00e9. La mettre \u00e0 jour ou v\u00e9rifier la date et l'heure de votre syst\u00e8me.
SEC_ERROR_CRL_BAD_SIGNATURE=La liste de certificats r\u00e9voqu\u00e9s pour l'autorit\u00e9 de d\u00e9livrance du certificat a une signature non valable.
SEC_ERROR_CRL_INVALID=La nouvelle liste de certificats r\u00e9voqu\u00e9s n'est pas d'un format valable.
SEC_ERROR_EXTENSION_VALUE_INVALID=La valeur de l'extension du certificat n'est pas valable.
SEC_ERROR_EXTENSION_NOT_FOUND=Extension du certificat introuvable.
SEC_ERROR_CA_CERT_INVALID=Le certificat de l'autorit\u00e9 de d\u00e9livrance n'est pas valable.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=La contrainte de longueur du chemin du certificat n'est pas valable.
SEC_ERROR_CERT_USAGES_INVALID=Le champ \u00ab\u00a0utilisations\u00a0\u00bb du certificat n'est pas valable.
SEC_INTERNAL_ONLY=**Module interne SEULEMENT**
SEC_ERROR_INVALID_KEY=La cl\u00e9 ne g\u00e8re pas l'op\u00e9ration demand\u00e9e.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Le certificat contient une extension critique inconnue.
SEC_ERROR_OLD_CRL=La date de p\u00e9remption de la nouvelle liste de certificats r\u00e9voqu\u00e9s n'est pas ult\u00e9rieure \u00e0 celle de la liste en cours.
SEC_ERROR_NO_EMAIL_CERT=Non chiffr\u00e9 ou sign\u00e9\u00a0\: encore aucun certificat de courriel.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Non chiffr\u00e9\u00a0\: encore aucun certificat pour chacun des destinataires.
SEC_ERROR_NOT_A_RECIPIENT=Impossible de d\u00e9chiffrer\u00a0\: non destinataire ou le certificat et la cl\u00e9 priv\u00e9e correspondants n'ont pas \u00e9t\u00e9 trouv\u00e9s.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Impossible de d\u00e9chiffrer\u00a0\: l'algorithme de chiffrement de cl\u00e9 ne correspond pas \u00e0 votre certificat.
SEC_ERROR_PKCS7_BAD_SIGNATURE=La v\u00e9rification de signature a \u00e9chou\u00e9\u00a0\: aucun signataire, trop de signataires ou donn\u00e9es corrompues ou incorrectes.
SEC_ERROR_UNSUPPORTED_KEYALG=Algorithme de cl\u00e9 non g\u00e9r\u00e9 ou inconnu.
SEC_ERROR_DECRYPTION_DISALLOWED=Impossible de d\u00e9chiffrer\u00a0\: chiffr\u00e9 en utilisant un algorithme ou une taille de cl\u00e9 non autoris\u00e9s.
XP_SEC_FORTEZZA_BAD_CARD=La carte Fortezza n'a pas \u00e9t\u00e9 initialis\u00e9e correctement. La retirer et la renvoyer \u00e0 votre distributeur.
XP_SEC_FORTEZZA_NO_CARD=Aucune carte Fortezza n'a \u00e9t\u00e9 trouv\u00e9e
XP_SEC_FORTEZZA_NONE_SELECTED=Aucune carte Fortezza n'a \u00e9t\u00e9 s\u00e9lectionn\u00e9e
XP_SEC_FORTEZZA_MORE_INFO=S\u00e9lectionner une personnalit\u00e9 pour en obtenir plus d'informations
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Personnalit\u00e9 non trouv\u00e9e
XP_SEC_FORTEZZA_NO_MORE_INFO=Aucune autre information sur cette personnalit\u00e9
XP_SEC_FORTEZZA_BAD_PIN=Code Pin non valable
XP_SEC_FORTEZZA_PERSON_ERROR=Impossible d'initialiser les personnalit\u00e9s Fortezza.
SEC_ERROR_NO_KRL=Aucune liste de cl\u00e9s r\u00e9voqu\u00e9es pour le certificat de ce site n'a \u00e9t\u00e9 trouv\u00e9e.
SEC_ERROR_KRL_EXPIRED=La liste de cl\u00e9s r\u00e9voqu\u00e9es pour le certificat de ce site a expir\u00e9.
SEC_ERROR_KRL_BAD_SIGNATURE=La liste de cl\u00e9s r\u00e9voqu\u00e9es pour le certificat de ce site a une signature non valable.
SEC_ERROR_REVOKED_KEY=La cl\u00e9 pour le certificat de ce site a \u00e9t\u00e9 r\u00e9voqu\u00e9e.
SEC_ERROR_KRL_INVALID=La nouvelle liste de cl\u00e9s r\u00e9voqu\u00e9es a un format non valable.
SEC_ERROR_NEED_RANDOM=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: donn\u00e9es al\u00e9atoires n\u00e9cessaires.
SEC_ERROR_NO_MODULE=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: aucun module de s\u00e9curit\u00e9 ne peut r\u00e9aliser l'op\u00e9ration demand\u00e9e.
SEC_ERROR_NO_TOKEN=La carte ou le jeton de s\u00e9curit\u00e9 n'existe pas, n'est pas encore initialis\u00e9 ou a \u00e9t\u00e9 retir\u00e9.
SEC_ERROR_READ_ONLY=Biblioth\u00e8que de s\u00e9curit\u00e9\u00a0\: base de donn\u00e9es en lecture seule.
SEC_ERROR_NO_SLOT_SELECTED=Aucun slot ou jeton n'a \u00e9t\u00e9 s\u00e9lectionn\u00e9.
SEC_ERROR_CERT_NICKNAME_COLLISION=Un certificat avec le m\u00eame pseudo existe d\u00e9j\u00e0.
SEC_ERROR_KEY_NICKNAME_COLLISION=Une cl\u00e9 avec le m\u00eame pseudo existe d\u00e9j\u00e0.
SEC_ERROR_SAFE_NOT_CREATED=Erreur lors de la cr\u00e9ation d'un objet s\u00e9curis\u00e9
SEC_ERROR_BAGGAGE_NOT_CREATED=Erreur lors de la cr\u00e9ation d'un objet valise
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Impossible de supprimer le principal
XP_JAVA_DELETE_PRIVILEGE_ERROR=Impossible de supprimer le privil\u00e8ge
XP_JAVA_CERT_NOT_EXISTS_ERROR=Ce principal n'a pas de certificat
SEC_ERROR_BAD_EXPORT_ALGORITHM=L'algorithme requis n'est pas autoris\u00e9.
SEC_ERROR_EXPORTING_CERTIFICATES=Erreur lors de la tentative d'exportation des certificats.
SEC_ERROR_IMPORTING_CERTIFICATES=Erreur lors de la tentative d'importation des certificats.
SEC_ERROR_PKCS12_DECODING_PFX=Importation impossible. Erreur de d\u00e9codage. Fichier non valable.
SEC_ERROR_PKCS12_INVALID_MAC=Importation impossible. MAC non valable. Mot de passe incorrect ou fichier corrompu.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Importation impossible. Algorithme MAC non g\u00e9r\u00e9.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Importation impossible. Seuls les modes int\u00e9grit\u00e9 de mot de passe et vie priv\u00e9e sont g\u00e9r\u00e9s.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Importation impossible. La structure du fichier est corrompue.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Importation impossible. Algorithme de chiffrement non g\u00e9r\u00e9.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Importation impossible. Version de fichier non g\u00e9r\u00e9e.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Importation impossible. Mot de passe de vie priv\u00e9e incorrect.
SEC_ERROR_PKCS12_CERT_COLLISION=Importation impossible. Le m\u00eame pseudo existe d\u00e9j\u00e0 dans la base de donn\u00e9es.
SEC_ERROR_USER_CANCELLED=L'utilisateur a annul\u00e9 l'op\u00e9ration.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Non import\u00e9 car d\u00e9j\u00e0 dans la base de donn\u00e9es.
SEC_ERROR_MESSAGE_SEND_ABORTED=Le message n'a pas \u00e9t\u00e9 envoy\u00e9.
SEC_ERROR_INADEQUATE_KEY_USAGE=Utilisation de la cl\u00e9 de certificat inappropri\u00e9e pour cette op\u00e9ration.
SEC_ERROR_INADEQUATE_CERT_TYPE=Type de certificat non approuv\u00e9 pour l'application.
SEC_ERROR_CERT_ADDR_MISMATCH=L'adresse dans le certificat de signature ne correspond pas \u00e0 celle figurant dans les ent\u00eates de messages.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Importation impossible. Erreur lors de la tentative d'importation de la cl\u00e9 priv\u00e9e.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Importation impossible. Erreur lors de la tentative d'importation de la cha\u00eene de certificat.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Exportation impossible. Impossible de localiser le certificat ou la cl\u00e9 par son pseudo.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Exportation impossible. La cl\u00e9 priv\u00e9e n'a pas \u00e9t\u00e9 trouv\u00e9e.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Exportation impossible. Impossible d'\u00e9crire le fichier d'exportation.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Exportation impossible. Impossible de lire le fichier d'importation.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Exportation impossible. La base de donn\u00e9es des cl\u00e9s est corrompue ou effac\u00e9e.
SEC_ERROR_KEYGEN_FAIL=Impossible de g\u00e9n\u00e9rer la paire de cl\u00e9s publique/priv\u00e9e.
SEC_ERROR_INVALID_PASSWORD=Le mot de passe saisi n'est pas valable. Merci d'en choisir un autre.
SEC_ERROR_RETRY_OLD_PASSWORD=L'ancien mot de passe n'a pas \u00e9t\u00e9 saisi correctement. Merci de r\u00e9essayer.
SEC_ERROR_BAD_NICKNAME=Ce pseudo de certificat est d\u00e9j\u00e0 utilis\u00e9.
SEC_ERROR_NOT_FORTEZZA_ISSUER=La cha\u00eene FORTEZZA du pair a un certificat non FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Une cl\u00e9 sensible n'a pas pu \u00eatre d\u00e9plac\u00e9e dans le slot o\u00f9 elle \u00e9tait requise.
SEC_ERROR_JS_INVALID_MODULE_NAME=Nom de module non valable.
SEC_ERROR_JS_INVALID_DLL=Chemin/fichier de module non valable
SEC_ERROR_JS_ADD_MOD_FAILURE=Ajout de module impossible
SEC_ERROR_JS_DEL_MOD_FAILURE=Suppression de module impossible
SEC_ERROR_OLD_KRL=La nouvelle liste de cl\u00e9s r\u00e9voqu\u00e9es n'a pas une date de p\u00e9remption ult\u00e9rieure \u00e0 celle en cours d'utilisation.
SEC_ERROR_CKL_CONFLICT=La nouvelle liste de cl\u00e9s compromises provient d'une autorit\u00e9 diff\u00e9rente de celle en cours d'utilisation. Supprimer la liste en cours d'utilisation.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=L'autorit\u00e9 de certification pour ce certificat n'est pas autoris\u00e9 \u00e0 d\u00e9livrer un certificat avec ce nom.
SEC_ERROR_KRL_NOT_YET_VALID=La liste de cl\u00e9s r\u00e9voqu\u00e9es pour ce certificat n'est pas encore valable.
SEC_ERROR_CRL_NOT_YET_VALID=La liste de certificats r\u00e9voqu\u00e9s pour ce certificat n'est pas encore valable.
SEC_ERROR_UNKNOWN_CERT=Le certificat demand\u00e9 n'a pas \u00e9t\u00e9 trouv\u00e9.
SEC_ERROR_UNKNOWN_SIGNER=Le signataire du certificat n'a pas \u00e9t\u00e9 trouv\u00e9.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=L'emplacement pour le serveur de statut de certificats a un format non valable.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=La r\u00e9ponse OCSP ne peut pas \u00eatre totalement d\u00e9cod\u00e9e\u00a0; elle est d'un type inconnu.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Le serveur OCSP a renvoy\u00e9 des donn\u00e9es HTTP inattendues/invalides.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Le serveur OCSP a trouv\u00e9 que la requ\u00eate \u00e9tait corrompue ou mal form\u00e9e.
SEC_ERROR_OCSP_SERVER_ERROR=Le serveur OCSP a rencontr\u00e9 une erreur interne.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Le serveur OCSP sugg\u00e8re de r\u00e9essayer plus tard.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Le serveur OCSP requiert une signature sur cette requ\u00eate.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Le serveur OCSP a refus\u00e9 cette requ\u00eate car elle n'est pas autoris\u00e9e.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Le serveur OCSP a renvoy\u00e9 un statut inconnu.
SEC_ERROR_OCSP_UNKNOWN_CERT=Le serveur OCSP n'a pas de statut pour le certificat.
SEC_ERROR_OCSP_NOT_ENABLED=OCSP doit \u00eatre activ\u00e9 avant d'effectuer cette op\u00e9ration.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Le r\u00e9pondeur OCSP par d\u00e9faut doit \u00eatre d\u00e9fini avant d'effectuer cette op\u00e9ration.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=La r\u00e9ponse du serveur OCSP \u00e9tait corrompue ou mal form\u00e9e.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Le signataire de la r\u00e9ponse OCSP n'est pas autoris\u00e9 \u00e0 donner de statut pour ce certificat.
SEC_ERROR_OCSP_FUTURE_RESPONSE=La r\u00e9ponse OCSP n'est pas encore valable (elle contient une date future).
SEC_ERROR_OCSP_OLD_RESPONSE=La r\u00e9ponse OCSP contient des informations obsol\u00e8tes.
SEC_ERROR_DIGEST_NOT_FOUND=Le pr\u00e9traitement CMS ou PKCS \#7 n'a pas \u00e9t\u00e9 trouv\u00e9 dans le message sign\u00e9.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Le type de message CMS ou PKCS \#7 n'est pas g\u00e9r\u00e9.
SEC_ERROR_MODULE_STUCK=Le module PKCS \#11 ne peut pas \u00eatre supprim\u00e9 car il est encore utilis\u00e9.
SEC_ERROR_BAD_TEMPLATE=Impossible de d\u00e9coder les donn\u00e9es ASN.1 data. Le mod\u00e8le sp\u00e9cifi\u00e9 \u00e9tait non valable.
SEC_ERROR_CRL_NOT_FOUND=Aucune liste de certificats r\u00e9voqu\u00e9s correspondante n'a \u00e9t\u00e9 trouv\u00e9e.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Vous essayez d'importer un certificat ayant la m\u00eame autorit\u00e9/num\u00e9ro de s\u00e9rie qu'un certificat existant, mais ce n'est pas le m\u00eame certificat.
SEC_ERROR_BUSY=NSS ne peut pas s'arr\u00eater. Des objets sont en cours d'utilisation.
SEC_ERROR_EXTRA_INPUT=Un message encod\u00e9 en DER contenait des donn\u00e9es suppl\u00e9mentaires non utilis\u00e9es.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Courbe elliptique non g\u00e9r\u00e9e.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Courbe elliptique formulaire non g\u00e9r\u00e9e.
SEC_ERROR_UNRECOGNIZED_OID=Identifiant d'objet non reconnu.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Certificat de signature OCSP non valable dans la r\u00e9ponse OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Le certificat est r\u00e9voqu\u00e9 dans la liste de certificats r\u00e9voqu\u00e9s de l'autorit\u00e9.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Le r\u00e9pondeur OCSP de l'autorit\u00e9 signale que le certificat est r\u00e9voqu\u00e9.
SEC_ERROR_CRL_INVALID_VERSION=La liste de certificats r\u00e9voqu\u00e9s de l'autorit\u00e9 a un num\u00e9ro de version inconnu.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=La liste de certificats r\u00e9voqu\u00e9s V1 de l'autorit\u00e9 a une extension critique.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=La liste de certificats r\u00e9voqu\u00e9s V2 de l'autorit\u00e9 a une extension critique inconnue.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Type d'objet inconnu sp\u00e9cifi\u00e9.
SEC_ERROR_INCOMPATIBLE_PKCS11=Le pilote PKCS \#11 viole les sp\u00e9cifications d'une mani\u00e8re incompatible.
SEC_ERROR_NO_EVENT=Aucun nouvel \u00e9v\u00e8nement de slot n'est disponible pour le moment.
SEC_ERROR_CRL_ALREADY_EXISTS=La liste de certificats r\u00e9voqu\u00e9s existe d\u00e9j\u00e0.
SEC_ERROR_NOT_INITIALIZED=NSS n'est pas initialis\u00e9.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=L'op\u00e9ration a \u00e9chou\u00e9 car le jeton PKCS\#11 n'est pas connect\u00e9.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Le certificat du r\u00e9pondant OCSP configur\u00e9 est non valable.
SEC_ERROR_OCSP_BAD_SIGNATURE=La signature de la r\u00e9ponse OCSP est non valable.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=La recherche de validation de certificat est en dehors des limites de recherche
SEC_ERROR_INVALID_POLICY_MAPPING=Le mappage de strat\u00e9gie d'un certificat contient la valeur inappropri\u00e9e \u00ab\u00a0anypolicy\u00a0\u00bb
SEC_ERROR_POLICY_VALIDATION_FAILED=Un certificat a sp\u00e9cifi\u00e9 une strat\u00e9gie qui n'a pas pu \u00eatre valid\u00e9e en utilisant une quelconque cha\u00eene de certification
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Type d'emplacement inconnu dans l'extension de certificat AIA
SEC_ERROR_BAD_HTTP_RESPONSE=Le serveur a renvoy\u00e9 une mauvaise r\u00e9ponse HTTP
SEC_ERROR_BAD_LDAP_RESPONSE=Le serveur a renvoy\u00e9 une mauvaise r\u00e9ponse LDAP
SEC_ERROR_FAILED_TO_ENCODE_DATA=\u00c9chec de l'encodage de donn\u00e9es avec l'encodeur ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Mauvaise information d'emplacement d'acc\u00e8s dans l'extension de certificat
SEC_ERROR_LIBPKIX_INTERNAL=Une erreur interne libpkix est survenue pendant la validation de certificat.
SEC_ERROR_PKCS11_GENERAL_ERROR=Un module PKCS \#11 a renvoy\u00e9 CKR_GENERAL_ERROR, indiquant qu'une erreur irr\u00e9cup\u00e9rable est survenue.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Un module PKCS \#11 a renvoy\u00e9 CKR_FUNCTION_FAILED, indiquant que la fonction demand\u00e9e ne pouvait \u00eatre r\u00e9alis\u00e9e. Essayer \u00e0 nouveau la m\u00eame op\u00e9ration pourrait fonctionner.
SEC_ERROR_PKCS11_DEVICE_ERROR=Un module PKCS \#11 a renvoy\u00e9 CKR_DEVICE_ERROR, indiquant qu'un probl\u00e8me avec le jeton ou le slot est survenu.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=M\u00e9thode d'acc\u00e8s \u00e0 l'information inconnue dans l'extension de certificat.
SEC_ERROR_CRL_IMPORT_FAILED=Erreur lors de la tentative d'importation d'une liste de r\u00e9vocation de certificat (CRL).
SEC_ERROR_EXPIRED_PASSWORD=Le mot de passe a expir\u00e9.
SEC_ERROR_LOCKED_PASSWORD=Le mot de passe est verrouill\u00e9.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Erreur PKCS \#11 inconnue.
SEC_ERROR_BAD_CRL_DP_URL=URL non valable ou non g\u00e9r\u00e9e dans un point de distribution CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Le certificat a \u00e9t\u00e9 sign\u00e9 \u00e0 l'aide d'un algorithme de signature qui est d\u00e9sactiv\u00e9 pour son manque de s\u00fbret\u00e9.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

