#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=\u0627\u0644\u0645\u0633\u0627\u0631 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d \u0648 \u062a\u0639\u0630\u0631 \u062a\u062d\u0645\u064a\u0644\u0647.
fileNotFound=\u0644\u0627 \u064a\u0633\u062a\u0637\u064a\u0639 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0623\u0646 \u064a\u062c\u062f \u0627\u0644\u0645\u0644\u0641\u0651 \u0641\u064a %S.
dnsNotFound=\u0644\u0627 \u064a\u0633\u062a\u0637\u064a\u0639 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0623\u0646 \u064a\u062c\u062f \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0639\u0646\u062f %S.
protocolNotFound=\u0644\u0627 \u064a\u0639\u0631\u0641 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0643\u064a\u0641 \u064a\u0641\u062a\u062d \u0647\u0630\u0627 \u0627\u0644\u0639\u0646\u0648\u0627\u0646\u060c \u0644\u0623\u0646\u0651 \u0627\u0644\u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 (%S) \u063a\u064a\u0631 \u0645\u0631\u062a\u0628\u0637 \u0628\u0623\u064a\u0651 \u0628\u0631\u0646\u0627\u0645\u062c.
connectionFailure=\u0644\u0627 \u064a\u0633\u062a\u0637\u064a\u0639 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0623\u0646 \u064a\u0624\u0633\u0651\u0633 \u0627\u062a\u0635\u0627\u0644\u064b\u0627 \u0628\u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0639\u0646\u062f %S.
netInterrupt=\u0642\u064f\u0648\u0637\u0639 \u0627\u0644\u0627\u062a\u0635\u0627\u0644 \u0628\u200d %S \u0623\u062b\u0646\u0627\u0621 \u062a\u062d\u0645\u064a\u0644 \u0627\u0644\u0635\u0641\u062d\u0629.
netTimeout=\u064a\u0633\u062a\u063a\u0631\u0642 \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0639\u0646\u062f %S \u0627\u0644\u0643\u062b\u064a\u0631 \u0645\u0646 \u0627\u0644\u0648\u0642\u062a \u0644\u064a\u0633\u062a\u062c\u064a\u0628.
redirectLoop=\u0648\u062c\u062f \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0623\u0646 \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u064a\u0639\u064a\u062f \u062a\u0648\u062c\u064a\u0647 \u0627\u0644\u0637\u0644\u0628 \u0628\u0634\u0643\u0644 \u062a\u0639\u0630\u0631 \u0645\u0639\u0647 \u0623\u0646 \u064a\u0643\u062a\u0645\u0644.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=\u0644\u0639\u0631\u0636 \u0647\u0630\u0647 \u0627\u0644\u0635\u0641\u062e\u0629\u060c \u064a\u062c\u0628 \u0623\u0646 \u064a\u064f\u0631\u0633\u0644 %S \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0627\u0644\u062a\u064a \u0633\u062a\u0643\u0631\u0631 \u0623\u064a \u0625\u062c\u0631\u0627\u0621 (\u0645\u062b\u0644 \u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0627\u0644\u0628\u062d\u062b \u0623\u0648 \u0627\u0644\u0637\u0644\u0628) \u062a\u0645 \u0645\u064f\u0633\u0628\u0642\u064b\u0627.
resendButton.label=\u0623\u0639\u0650\u062f \u0627\u0644\u0625\u0631\u0633\u0627\u0644
unknownSocketType=\u0644\u0627 \u064a\u0639\u0631\u0641 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0643\u064a\u0641 \u064a\u062a\u0635\u0644 \u0628\u0627\u0644\u062e\u0627\u062f\u0648\u0645.
netReset=\u0635\u064f\u0641\u0651\u0650\u0631 \u0627\u0644\u0627\u062a\u0635\u0627\u0644 \u0628\u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0623\u062b\u0646\u0627\u0621 \u062a\u062d\u0645\u064a\u0644 \u0627\u0644\u0635\u0651\u0641\u062d\u0629.
notCached=\u0647\u0630\u0627 \u0627\u0644\u0645\u0633\u062a\u0646\u062f \u0644\u0645 \u064a\u0639\u062f \u0645\u062a\u0627\u062d\u064b\u0627.
netOffline=\u064a\u0639\u0645\u0644 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u062d\u0627\u0644\u064a\u064b\u0627 \u0628\u0627\u0644\u0648\u0636\u0639 \u062f\u0648\u0646 \u0627\u062a\u0635\u0627\u0644 \u0648\u0644\u0627 \u064a\u0645\u0643\u0646\u0647 \u062a\u0635\u0641\u062d \u0627\u0644\u0648\u0650\u0628.
isprinting=\u0644\u0627 \u064a\u0645\u0643\u0646 \u062a\u063a\u064a\u064a\u0631 \u0627\u0644\u0645\u0633\u062a\u0646\u062f \u0623\u062b\u0646\u0627\u0621 \u0627\u0644\u0637\u0628\u0627\u0639\u0629 \u0623\u0648 \u0645\u0639\u0627\u064a\u0646\u0629 \u0627\u0644\u0637\u0628\u0627\u0639\u0629.
deniedPortAccess=\u064a\u0633\u062a\u062e\u062f\u0645 \u0647\u0630\u0627 \u0627\u0644\u0639\u0646\u0648\u0627\u0646 \u0645\u0646\u0641\u0630 \u0634\u0628\u0643\u0629 \u0645\u0633\u062a\u062e\u062f\u0645 \u0639\u0627\u062f\u0629 \u0644\u0623\u063a\u0631\u0627\u0636 \u063a\u064a\u0631 \u062a\u0635\u0641\u0651\u062d \u0627\u0644\u0648\u0650\u0628. \u0623\u0644\u063a\u0649 \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0627\u0644\u0637\u0644\u0628 \u0644\u062d\u0645\u0627\u064a\u062a\u0643.
proxyResolveFailure=\u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0645\u0636\u0628\u0648\u0637 \u0644\u064a\u0633\u062a\u062e\u062f\u0645 \u062e\u0627\u062f\u0648\u0645\u064b\u0627 \u0648\u0633\u064a\u0637\u064b\u0627 \u062a\u0639\u0630\u0631 \u0625\u064a\u062c\u0627\u062f\u0647.
proxyConnectFailure=\u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0645\u0636\u0628\u0648\u0637 \u0644\u064a\u0633\u062a\u062e\u062f\u0645 \u062e\u0627\u062f\u0648\u0645\u064b\u0627 \u0648\u0633\u064a\u0637\u064b\u0627 \u064a\u0631\u0641\u0636 \u0627\u0644\u0627\u062a\u0635\u0627\u0644\u0627\u062a.
contentEncodingError=\u0627\u0644\u0635\u0641\u062d\u0629 \u0627\u0644\u062a\u064a \u062a\u062d\u0627\u0648\u0644 \u0632\u064a\u0627\u0631\u062a\u0647\u0627 \u0644\u0627 \u064a\u0645\u0643\u0646 \u0639\u0631\u0636\u0647\u0627 \u0644\u0623\u0646\u0647\u0627 \u062a\u0633\u062a\u062e\u062f\u0645 \u0646\u0648\u0639\u064b\u0627 \u062e\u0637\u0623 \u0623\u0648 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645 \u0645\u0646 \u0627\u0644\u0636\u063a\u0637.
unsafeContentType=\u0627\u0644\u0635\u0641\u062d\u0629 \u0627\u0644\u062a\u064a \u062a\u062d\u0627\u0648\u0644 \u0632\u064a\u0627\u0631\u062a\u0647\u0627 \u0644\u0627 \u064a\u0645\u0643\u0646 \u0639\u0631\u0636\u0647\u0627 \u0644\u0623\u0646\u0647\u0627 \u062a\u062d\u062a\u0648\u064a \u0645\u0644\u0641\u0627 \u0645\u0646 \u0646\u0648\u0639 \u0642\u062f \u0644\u0627 \u064a\u0643\u0648\u0646 \u0645\u0646 \u0627\u0644\u0622\u0645\u0646 \u062d\u0641\u0638\u0647 \u0644\u0641\u062a\u062d\u0647. \u0645\u0646 \u0641\u0636\u0644\u0643 \u0627\u062a\u0635\u0644 \u0628\u0645\u0627\u0644\u0643\u064a \u0627\u0644\u0645\u0648\u0642\u0639 \u0644\u0625\u0635\u0644\u0627\u062d \u0647\u0630\u0627.
externalProtocolTitle=\u0637\u0644\u0628 \u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 \u062e\u0627\u0631\u062c\u064a
externalProtocolPrompt=\u064a\u062c\u0628 \u062a\u0634\u063a\u064a\u0644 \u062a\u0637\u0628\u064a\u0642 \u062e\u0627\u0631\u062c\u064a \u0644\u0645\u0639\u0627\u0644\u062c\u0629 \u0648\u0635\u0644\u0627\u062a %1$S\:. \u0627\u0644\u0648\u0635\u0644\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629\:\n\n\n%2$S\n\u0627\u0644\u062a\u0637\u0628\u064a\u0642\: %3$S\n\n\n\u0625\u0630\u0627 \u0644\u0645 \u062a\u062a\u0648\u0642\u0651\u0639 \u0647\u0630\u0627 \u0627\u0644\u0637\u0651\u0644\u0628\u060c \u0642\u062f \u062a\u0643\u0648\u0646 \u0647\u0630\u0647 \u0645\u062d\u0627\u0648\u0644\u0629 \u0644\u0627\u0633\u062a\u063a\u0644\u0627\u0644 \u0636\u0639\u0641 \u0641\u064a \u0627\u0644\u0628\u0631\u0646\u0627\u0645\u062c \u0627\u0644\u0622\u062e\u0631. \u0623\u0644\u063a\u0650 \u0627\u0644\u0637\u0651\u0644\u0628 \u0625\u0644\u0627 \u0625\u0630\u0627 \u0643\u0646\u062a \u0645\u062a\u0623\u0643\u062f\u064b\u0627 \u0623\u0646\u0647 \u063a\u064a\u0631 \u062e\u0628\u064a\u062b.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\u0645\u062c\u0647\u0648\u0644>
externalProtocolChkMsg=\u062a\u0630\u0643\u0651\u0631 \u0627\u062e\u062a\u064a\u0627\u0631\u064a \u0644\u0643\u0644 \u0627\u0644\u0648\u0635\u0644\u0627\u062a \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0641\u0626\u0629.
externalProtocolLaunchBtn=\u0634\u063a\u0651\u0644 \u0627\u0644\u062a\u0637\u0628\u064a\u0642
malwareBlocked=\u0623\u064f\u0628\u0644\u0650\u063a \u0639\u0646 \u0623\u0646 \u0627\u0644\u0645\u0648\u0642\u0639 %S \u0645\u0648\u0642\u0639 \u0647\u062c\u0648\u0645 \u0648\u0645\u064f\u0646\u0639 \u0628\u0646\u0627\u0621 \u0639\u0644\u0649 \u062a\u0641\u0636\u064a\u0644\u0627\u062a \u0627\u0644\u0623\u0645\u0646.
phishingBlocked=\u0623\u064f\u0628\u0644\u0650\u063a \u0639\u0646 \u0623\u0646 \u0627\u0644\u0645\u0648\u0642\u0639 %S \u0645\u0648\u0642\u0639 \u062e\u062f\u0627\u0639 \u0645\u0635\u0645\u0645 \u0644\u062e\u062f\u0627\u0639 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645\u064a\u0646 \u0644\u064a\u0643\u0634\u0641\u0648\u0627 \u0645\u0639\u0644\u0648\u0645\u0627\u062a\u0647\u0645 \u0627\u0644\u0634\u062e\u0635\u064a\u0629 \u0648\u0627\u0644\u0645\u0627\u0644\u064a\u0629.
cspFrameAncestorBlocked=\u0633\u064a\u0627\u0633\u0629 \u0623\u0645\u0646 \u0645\u062d\u062a\u0648\u0649 \u0647\u0630\u0647 \u0627\u0644\u0635\u0641\u062d\u0629 \u062a\u0645\u0646\u0639\u0647\u0627 \u0645\u0646 \u0623\u0646 \u062a\u0643\u0648\u0646 \u0645\u0636\u0645\u0651\u0646\u0629 \u0628\u0647\u0630\u0627 \u0627\u0644\u0634\u0643\u0644.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=\u062a\u0639\u0630\u0631 \u0639\u0631\u0636 \u0627\u0644\u0635\u0641\u062d\u0629 \u0627\u0644\u062a\u064a \u062a\u0631\u064a\u062f \u0645\u0634\u0627\u0647\u062f\u062a\u0647\u0627 \u0628\u0633\u0628\u0628 \u0627\u0643\u062a\u0634\u0627\u0641 \u062e\u0637\u0623 \u0627\u062b\u0646\u0627\u0621 \u0646\u0642\u0644 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a.
remoteXUL=\u0647\u0630\u0647 \u0627\u0644\u0635\u0641\u062d\u0629 \u062a\u0633\u062a\u062e\u062f\u0645 \u062a\u0642\u0646\u064a\u0629 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0644\u0645 \u062a\u0639\u062f \u0645\u062a\u0627\u062d\u0629 \u0641\u064a \u0641\u064e\u064a\u064e\u0631\u0641\u064f\u0643\u0633 \u0628\u0634\u0643\u0644 \u0645\u0628\u062f\u0626\u064a.

