#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=Datoteka %S nije mogla biti spremljena, jer izvori\u0161na datoteka nije mogla biti pro\u010ditana.\n\nPoku\u0161ajte ponovno kasnije ili kontaktirajte administratora poslu\u017eitelja.
writeError=Datoteka %S nije mogla biti spremljena jer je do\u0161lo do nepoznate gre\u0161ke.\n\nPoku\u0161ajte datoteku spremiti na drugu lokaciju.
launchError=Datoteka %S nije mogla biti otvorena jer je do\u0161lo do nepoznate gre\u0161ke.\n\nPoku\u0161ajte datoteku spremiti na disk, te je zatim otvoriti.
diskFull=Na disku nema dovoljno prostora za spremanje %S.\n\nUklonite nepotrebne datoteke s diska ili poku\u0161ajte spremiti datoteku na drugu lokaciju.
readOnly=Datoteka %S nije mogla biti spremljena, jer je disk, direktorij ili datoteka ozna\u010dena samo za \u010ditanje.\n\nOmogu\u0107ite zapisivanje na disk i poku\u0161ajte ponovno ili poku\u0161ajte spremiti datoteku na drugu lokaciju.
accessError=Datoteka %S nije mogla biti spremljena jer ne mo\u017eete mijenjati sadr\u017eaj tog direktorija.\n\nPromijenite postavke direktorija i poku\u0161ajte ponovno ili poku\u0161ajte spremiti datoteku na drugu lokaciju.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=Datoteka %S nije mogla biti otvorena jer zadana pomo\u0107na aplikacija ne postoji. Promijenite zadanu aplikaciju za ovu vrstu datoteke u va\u0161im postavkama.
noMemory=Akcija koju ste zatra\u017eili ne mo\u017ee biti dovr\u0161ena zbog nedostatka memorije.\n\nZatvorite neke aplikacije i poku\u0161ajte ponovno.
title=Preuzimanje %S
fileAlreadyExistsError=Datoteka %S nije mogla biti spremljena jer datoteka s istim nazivom ve\u0107 postoji u '_files' direktoriju.\n\nPoku\u0161ajte datoteku spremiti na drugu lokaciju.
fileNameTooLongError=Datoteka %S nije mogla biti spremljena jer je njezin naziv preduga\u010dak.\n\nPoku\u0161ajte datoteku spremiti pod kra\u0107im nazivom.

