#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=Az URL \u00e9rv\u00e9nytelen, nem lehet bet\u00f6lteni.
fileNotFound=A Pale Moon nem tal\u00e1lja a f\u00e1jlt a(z) %S helyen.
dnsNotFound=A Pale Moon nem tal\u00e1lja a kiszolg\u00e1l\u00f3t a(z) %S helyen.
protocolNotFound=A Pale Moon nem tudja, hogy kell ezt a c\u00edmet megnyitni, mert a protokoll (%S) nincs egyetlen programhoz sem hozz\u00e1rendelve.
connectionFailure=A Pale Moon nem k\u00e9pes kapcsolatot l\u00e9tes\u00edteni a(z) %S helyen l\u00e9v\u0151 kiszolg\u00e1l\u00f3val.
netInterrupt=A kapcsolat a(z) %S hellyel megszakadt az oldal bet\u00f6lt\u00e9se k\u00f6zben.
netTimeout=A(z) %S helyen l\u00e9v\u0151 kiszolg\u00e1l\u00f3 t\u00fal hossz\u00fa ideig nem v\u00e1laszol.
redirectLoop=A Pale Moon azt \u00e9szlelte, hogy a kiszolg\u00e1l\u00f3 olyan m\u00f3don ir\u00e1ny\u00edtja \u00e1t a k\u00e9r\u00e9st, hogy az soha nem fog teljes\u00fclni.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Az oldal megjelen\u00edt\u00e9s\u00e9hez a %Snak olyan inform\u00e1ci\u00f3kat kell k\u00fcldenie, amelyek megism\u00e9telnek egy kor\u00e1bbi m\u0171veletet (p\u00e9ld\u00e1ul egy keres\u00e9st vagy egy rendel\u00e9s meger\u0151s\u00edt\u00e9s\u00e9t).
resendButton.label=\u00dajrak\u00fcld\u00e9s
unknownSocketType=A Pale Moon nem tudja, hogy kommunik\u00e1ljon a kiszolg\u00e1l\u00f3val.
netReset=A kiszolg\u00e1l\u00f3hoz val\u00f3 kapcsolat alaphelyzetbe \u00e1llt az oldal let\u00f6lt\u00e9se k\u00f6zben.
notCached=Ez a dokumentum nem \u00e9rhet\u0151 el t\u00f6bb\u00e9.
netOffline=A Pale Moon jelenleg kapcsolat n\u00e9lk\u00fcli m\u00f3dban van, \u00e9s nem tudja a webet b\u00f6ng\u00e9szni.
isprinting=A dokumentum nem v\u00e1ltozhat meg nyomtat\u00e1s k\u00f6zben vagy nyomtat\u00e1si k\u00e9p k\u00e9sz\u00edt\u00e9se k\u00f6zben.
deniedPortAccess=Ez a c\u00edm olyan h\u00e1l\u00f3zati portot haszn\u00e1l, amelyet \u00e1ltal\u00e1ban a webb\u00f6ng\u00e9sz\u00e9st\u0151l elt\u00e9r\u0151 c\u00e9lra szoktak haszn\u00e1lni. A Pale Moon megszak\u00edtotta ezt a lek\u00e9r\u00e9st az \u00d6n v\u00e9delme \u00e9rdek\u00e9ben.
proxyResolveFailure=A Pale Moon proxykiszolg\u00e1l\u00f3 haszn\u00e1lat\u00e1ra lett be\u00e1ll\u00edtva, \u00e1m az nem tal\u00e1lhat\u00f3.
proxyConnectFailure=A Pale Moon proxykiszolg\u00e1l\u00f3 haszn\u00e1lat\u00e1ra lett be\u00e1ll\u00edtva, \u00e1m az visszautas\u00edtja a kapcsolatot.
contentEncodingError=A megtekinteni k\u00edv\u00e1nt oldal nem jelen\u00edthet\u0151 meg, mert \u00e9rv\u00e9nytelen vagy nem t\u00e1mogatott t\u00f6m\u00f6r\u00edt\u00e9st haszn\u00e1l.
unsafeContentType=A megtekinteni k\u00edv\u00e1nt oldal nem jelen\u00edthet\u0151 meg, mert olyan f\u00e1jlt\u00edpust tartalmaz, amelyet nem biztons\u00e1gos megnyitni. \u00c9rtes\u00edtse a webhely tulajdonosait err\u0151l a probl\u00e9m\u00e1r\u00f3l.
externalProtocolTitle=K\u00fcls\u0151 protokoll k\u00e9r\u00e9se
externalProtocolPrompt=A %1$S\: t\u00edpus\u00fa hivatkoz\u00e1sok kezel\u00e9s\u00e9hez k\u00fcls\u0151 alkalmaz\u00e1st kell elind\u00edtani.\n\n\nA k\u00e9rt hivatkoz\u00e1s\:\n\n%2$S\n\nAlkalmaz\u00e1s\: %3$S\n\n\nHa nem sz\u00e1m\u00edtott erre a k\u00e9r\u00e9sre, akkor ez lehet, hogy egy t\u00e1mad\u00e1si k\u00eds\u00e9rlet, amely a m\u00e1sik programban megl\u00e9v\u0151 sebezhet\u0151s\u00e9get akarja kihaszn\u00e1lni. Csak akkor fogadja el a k\u00e9r\u00e9st, ha biztos benne, hogy nem rosszindulat\u00fa t\u00e1mad\u00e1sr\u00f3l van sz\u00f3.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Ismeretlen>
externalProtocolChkMsg=V\u00e1laszt\u00e1s megjegyz\u00e9se az \u00f6sszes ilyen t\u00edpus\u00fa hivatkoz\u00e1shoz.
externalProtocolLaunchBtn=Alkalmaz\u00e1s ind\u00edt\u00e1sa
malwareBlocked=A(z) %S c\u00edmen m\u0171k\u00f6d\u0151 webhelyr\u0151l bejelent\u00e9s \u00e9rkezett, hogy t\u00e1mad\u00f3 webhely, ez\u00e9rt a biztons\u00e1gi be\u00e1ll\u00edt\u00e1sok alapj\u00e1n a b\u00f6ng\u00e9sz\u0151 a hozz\u00e1f\u00e9r\u00e9st nem enged\u00e9lyezi.
phishingBlocked=A(z) %S oldalt a bejelent\u00e9sek szerint az\u00e9rt hozt\u00e1k l\u00e9tre, hogy a felhaszn\u00e1l\u00f3kt\u00f3l szem\u00e9lyes vagy p\u00e9nz\u00fcgyi adatokat csaljanak ki.
cspFrameAncestorBlocked=Az oldal tartalombiztons\u00e1gi ir\u00e1nyelve megtiltja, hogy ezen a m\u00f3don be\u00e1gyazz\u00e1k.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=A megtekinteni k\u00edv\u00e1nt oldal nem jelen\u00edthet\u0151 meg, mert hiba t\u00f6rt\u00e9nt az adat\u00e1tvitel k\u00f6zben.
remoteXUL=Ez az oldal nem t\u00e1mogatott technol\u00f3gi\u00e1t haszn\u00e1l, amely m\u00e1r nem \u00e9rhet\u0151 el az alapki\u00e9p\u00edt\u00e9sben.

