#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Nie je mo\u017en\u00e9 bezpe\u010dne sa pripoji\u0165. Partner nepodporuje prvotriedne \u0161ifrovanie.
SSL_ERROR_US_ONLY_SERVER=Nie je mo\u017en\u00e9 bezpe\u010dne komunikova\u0165. Partner vy\u017eaduje prvotriedne \u0161ifrovanie, ktor\u00e9 nie je podporovan\u00e9.
SSL_ERROR_NO_CYPHER_OVERLAP=S partnerom nie je mo\u017en\u00e9 bezpe\u010dne komunikova\u0165\: \u017eiadny spolo\u010dn\u00fd \u0161ifrovac\u00ed algoritmus.
SSL_ERROR_NO_CERTIFICATE=Nie je mo\u017en\u00e9 n\u00e1js\u0165 certifik\u00e1t alebo k\u013e\u00fa\u010d potrebn\u00fd na overenie.
SSL_ERROR_BAD_CERTIFICATE=S partnerom nie je mo\u017en\u00e9 bezpe\u010dne komunikova\u0165\: certifik\u00e1t partnera bol odmietnut\u00fd.
SSL_ERROR_UNUSED_5=Nerozpoznan\u00fd k\u00f3d chyby protokolu SSL.
SSL_ERROR_BAD_CLIENT=Server zistil nespr\u00e1vne \u00fadaje od klienta.
SSL_ERROR_BAD_SERVER=Klient zistil nespr\u00e1vne \u00fadaje zo servera.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Nepodporovan\u00fd typ certifik\u00e1tu.
SSL_ERROR_UNSUPPORTED_VERSION=Partner pou\u017e\u00edva nepodporovan\u00fa verziu bezpe\u010dnostn\u00e9ho protokolu.
SSL_ERROR_UNUSED_10=Nerozpoznan\u00fd k\u00f3d chyby protokolu SSL.
SSL_ERROR_WRONG_CERTIFICATE=Overenie klienta sa nepodarilo\: priv\u00e1tny k\u013e\u00fa\u010d v datab\u00e1ze k\u013e\u00fa\u010dov nezodpoved\u00e1 verejn\u00e9mu k\u013e\u00fa\u010du v datab\u00e1ze certifik\u00e1tov.
SSL_ERROR_BAD_CERT_DOMAIN=S partnerom nie je mo\u017en\u00e9 bezpe\u010dne komunikova\u0165\: po\u017eadovan\u00fd n\u00e1zov dom\u00e9ny nezodpoved\u00e1 certifik\u00e1tu servera.
SSL_ERROR_POST_WARNING=Nerozpoznan\u00fd k\u00f3d chyby protokolu SSL.
SSL_ERROR_SSL2_DISABLED=Partner podporuje len protokol SSL vo verzii 2, ktor\u00e1 je lok\u00e1lne zak\u00e1zan\u00e1.
SSL_ERROR_BAD_MAC_READ=Protokol SSL prijal z\u00e1znam s nespr\u00e1vnym overovac\u00edm k\u00f3dom spr\u00e1vy.
SSL_ERROR_BAD_MAC_ALERT=Partner protokolu SSL hl\u00e1si nespr\u00e1vny overovac\u00ed k\u00f3d spr\u00e1vy.
SSL_ERROR_BAD_CERT_ALERT=Partner protokolu SSL nem\u00f4\u017ee overi\u0165 v\u00e1\u0161 certifik\u00e1t.
SSL_ERROR_REVOKED_CERT_ALERT=Partner protokolu SSL odmietol v\u00e1\u0161 certifik\u00e1t ako odvolan\u00fd.
SSL_ERROR_EXPIRED_CERT_ALERT=Partner protokolu SSL odmietol v\u00e1\u0161 certifik\u00e1t, preto\u017ee jeho platnos\u0165 uplynula.
SSL_ERROR_SSL_DISABLED=Nie je mo\u017en\u00e9 pripoji\u0165 sa\: protokol SSL je zak\u00e1zan\u00fd.
SSL_ERROR_FORTEZZA_PQG=Nie je mo\u017en\u00e9 pripoji\u0165 sa\: partner protokolu SSL je \u010fal\u0161ia dom\u00e9na typu FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Po\u017eadoval sa nezn\u00e1my \u0161ifrovac\u00ed bal\u00edk protokolu SSL.
SSL_ERROR_NO_CIPHERS_SUPPORTED=V programe nie s\u00fa pr\u00edtomn\u00e9 a povolen\u00e9 \u017eiadne \u0161ifrovacie bal\u00edky.
SSL_ERROR_BAD_BLOCK_PADDING=Protokol SSL prijal z\u00e1znam s nespr\u00e1vne vyplnen\u00fdm blokom.
SSL_ERROR_RX_RECORD_TOO_LONG=Protokol SSL prijal z\u00e1znam, ktor\u00fd presahuje maxim\u00e1lnu povolen\u00fa d\u013a\u017eku.
SSL_ERROR_TX_RECORD_TOO_LONG=Protokol SSL sa pok\u00fasil odosla\u0165 z\u00e1znam, ktor\u00fd presahuje maxim\u00e1lnu povolen\u00fa d\u013a\u017eku.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Hello Request.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Client Hello.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Server Hello.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Certificate.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Server Key Exchange.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Certificate Request.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Server Hello Done.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Certificate Verify.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Client Key Exchange.
SSL_ERROR_RX_MALFORMED_FINISHED=Protokol SSL prijal nespr\u00e1vnu inicializa\u010dn\u00fa spr\u00e1vu Finished.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=Protokol SSL prijal nespr\u00e1vny z\u00e1znam Change Cipher Spec.
SSL_ERROR_RX_MALFORMED_ALERT=Protokol SSL prijal nespr\u00e1vny z\u00e1znam Alert.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=Protokol SSL prijal nespr\u00e1vny z\u00e1znam Handshake.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=Protokol SSL prijal nespr\u00e1vny z\u00e1znam Application Data.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Hello Request.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Client Hello.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Server Hello.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Certificate.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Server Key Exchange.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Certificate Request.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Server Hello Done.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Certificate Verify.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Client Key Exchange.
SSL_ERROR_RX_UNEXPECTED_FINISHED=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Finished.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=Protokol SSL prijal neo\u010dak\u00e1van\u00fa inicializa\u010dn\u00fa spr\u00e1vu Change Cipher Spec.
SSL_ERROR_RX_UNEXPECTED_ALERT=Protokol SSL prijal neo\u010dak\u00e1van\u00fd z\u00e1znam Alert.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=Protokol SSL prijal neo\u010dak\u00e1van\u00fd z\u00e1znam Handshake.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=Protokol SSL prijal neo\u010dak\u00e1van\u00fd z\u00e1znam Application Data.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=Protokol SSL prijal z\u00e1znam s nezn\u00e1mym typom obsahu.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=Protokol SSL prijal inicializa\u010dn\u00fa spr\u00e1vu nezn\u00e1meho typu.
SSL_ERROR_RX_UNKNOWN_ALERT=Protokol SSL prijal v\u00fdstra\u017en\u00fd z\u00e1znam s nezn\u00e1mym popisom v\u00fdstrahy.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Partner protokolu SSL ukon\u010dil pripojenie.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Partner protokolu SSL neo\u010dak\u00e1val prijatie spr\u00e1vy inicializ\u00e1tora.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=Partner protokolu SSL nemohol \u00faspe\u0161ne dekomprimova\u0165 prijat\u00fd z\u00e1znam protokolu SSL.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=Partner protokolu SSL nemohol vyjedna\u0165 prijate\u013en\u00fd s\u00fabor bezpe\u010dnostn\u00fdch parametrov.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Partner protokolu SSL odmietol kv\u00f4li neprijate\u013en\u00e9mu obsahu spr\u00e1vu inicializ\u00e1tora.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Partner protokolu SSL nepodporuje typ prijat\u00e9ho certifik\u00e1tu.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Partner protokolu SSL m\u00e1 nejak\u00fd neur\u010dit\u00fd probl\u00e9m s prijat\u00fdm certifik\u00e1tom.
SSL_ERROR_GENERATE_RANDOM_FAILURE=Protokol SSL zaznamenal chybu svojho gener\u00e1tora n\u00e1hodn\u00fdch \u010d\u00edsiel.
SSL_ERROR_SIGN_HASHES_FAILURE=Nie je mo\u017en\u00e9 digit\u00e1lne podp\u00edsa\u0165 \u00fadaje potrebn\u00e9 na overenie certifik\u00e1tu.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=Protokol SSL nemohol z certifik\u00e1tu partnera extrahova\u0165 verejn\u00fd k\u013e\u00fa\u010d.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Neur\u010dit\u00e1 chyba po\u010das spracovania inicializ\u00e1tora SSL Server Key Exchange.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Neur\u010dit\u00e1 chyba po\u010das spracovania inicializ\u00e1tora SSL Client Key Exchange.
SSL_ERROR_ENCRYPTION_FAILURE=Chyba algoritmu za\u0161ifrovania hromadn\u00fdch \u00fadajov vo vybranom \u0161ifrovacom bal\u00edku.
SSL_ERROR_DECRYPTION_FAILURE=Chyba algoritmu de\u0161ifrovania hromadn\u00fdch \u00fadajov vo vybranom \u0161ifrovacom bal\u00edku.
SSL_ERROR_SOCKET_WRITE_FAILURE=Chyba pri pokuse o z\u00e1pis \u0161ifrovan\u00fdch \u00fadajov do z\u00e1kladn\u00e9ho socketu.
SSL_ERROR_MD5_DIGEST_FAILURE=Chyba funkcie extraktu MD5.
SSL_ERROR_SHA_DIGEST_FAILURE=Chyba funkcie extraktu SHA-1.
SSL_ERROR_MAC_COMPUTATION_FAILURE=Chyba v\u00fdpo\u010dtu MAC.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Chyba pri vytv\u00e1ran\u00ed kontextu symetrick\u00e9ho k\u013e\u00fa\u010da.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Chyba pri rozbalen\u00ed symetrick\u00e9ho k\u013e\u00fa\u010da v spr\u00e1ve Client Key Exchange.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Server SSL sa pok\u00fasil pou\u017ei\u0165 verejn\u00fd k\u013e\u00fa\u010d dom\u00e1ceho typu s exportom \u0161ifrovacieho bal\u00edka.
SSL_ERROR_IV_PARAM_FAILURE=K\u00f3du PKCS11 sa nepodarilo prelo\u017ei\u0165 IV na parameter.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Inicializ\u00e1cia vybran\u00e9ho \u0161ifrovacieho bal\u00edka sa nepodarila.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Klientovi sa nepodarilo vygenerova\u0165 k\u013e\u00fa\u010de rel\u00e1cie protokolu SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Server nem\u00e1 k\u013e\u00fa\u010d pre vysk\u00fa\u0161an\u00fd algoritmus v\u00fdmeny k\u013e\u00fa\u010da.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=V priebehu oper\u00e1cie bol vlo\u017een\u00fd alebo odstr\u00e1nen\u00fd token PKCS\#11.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Pri vykon\u00e1van\u00ed po\u017eadovanej oper\u00e1cie sa nena\u0161iel \u017eiadny token PKCS\#11.
SSL_ERROR_NO_COMPRESSION_OVERLAP=S partnerom nie je mo\u017en\u00e9 bezpe\u010dne komunikova\u0165\: \u017eiadny spolo\u010dn\u00fd algoritmus kompresie.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Nie je mo\u017en\u00e9 inicializova\u0165 \u010fal\u0161ie pripojenie protokolu SSL, k\u00fdm nebude s\u00fa\u010dasn\u00e9 pripojenie ukon\u010den\u00e9.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Prijat\u00e9 nespr\u00e1vne hodnoty transform\u00e1cie od partnera.
SSL_ERROR_CERT_KEA_MISMATCH=Poskytnut\u00fd certifik\u00e1t nemo\u017eno pou\u017ei\u0165 s vybran\u00fdm algoritmom v\u00fdmeny k\u013e\u00fa\u010da.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Na overenie klienta protokolu SSL nie je d\u00f4veryhodn\u00e1 certifika\u010dn\u00e1 autorita.
SSL_ERROR_SESSION_NOT_FOUND=Identifik\u00e1cia rel\u00e1cie klienta protokolu SSL sa vo vyrovn\u00e1vacej pam\u00e4ti rel\u00e1cie na serveri nena\u0161la.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Partner nemohol de\u0161ifrova\u0165 prijat\u00fd z\u00e1znam protokolu SSL.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Partner prijal z\u00e1znam protokolu, ktor\u00fd je dlh\u0161\u00ed, ako je povolen\u00e9.
SSL_ERROR_UNKNOWN_CA_ALERT=Partner nerozpozn\u00e1va a d\u00f4veruje CA, ktor\u00fd vydal v\u00e1\u0161 certifik\u00e1t.
SSL_ERROR_ACCESS_DENIED_ALERT=Partner prijal platn\u00fd certifik\u00e1t, ale pr\u00edstup bol odmietnut\u00fd.
SSL_ERROR_DECODE_ERROR_ALERT=Partner nem\u00f4\u017ee dek\u00f3dova\u0165 spr\u00e1vu inicializ\u00e1tora protokolu SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=Partner hl\u00e1si chybu overenia podpisu alebo v\u00fdmeny k\u013e\u00fa\u010da.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Partner hl\u00e1si realizovanie spojenia, ktor\u00e9 nie je v s\u00falade s exportn\u00fdmi predpismi.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Partner hl\u00e1si nekompatibiln\u00fa alebo nepodporovan\u00fa verziu protokolu.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Server vy\u017eaduje bezpe\u010dnej\u0161ie \u0161ifrovanie, ne\u017e je klientom podporovan\u00e9.
SSL_ERROR_INTERNAL_ERROR_ALERT=Partner hl\u00e1si, \u017ee do\u0161lo k internej chybe.
SSL_ERROR_USER_CANCELED_ALERT=Pou\u017e\u00edvate\u013e partnera zru\u0161il spojenie.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Partner nepovo\u013euje opakovan\u00e9 realizovanie spojenia bezpe\u010dnostn\u00fdch parametrov protokolu SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Vyrovn\u00e1vacia pam\u00e4\u0165 servera SSL nie je nakonfigurovan\u00e1 a nie je pre tento socket zak\u00e1zan\u00e1.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Partner protokolu SSL nepodporuje po\u017eadovan\u00e9 roz\u0161\u00edrenie TLS hello.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Partner protokolu SSL nem\u00f4\u017ee z dodanej adresy z\u00edska\u0165 v\u00e1\u0161 certifik\u00e1t.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Partner protokolu SSL nem\u00e1 certifik\u00e1t pre po\u017eadovan\u00fd n\u00e1zov DNS.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Partner protokolu SSL nemohol z\u00edska\u0165 odozvu OCSP pre svoj certifik\u00e1t.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Partner protokolu SSL hl\u00e1si nespr\u00e1vnu hodnotu transform\u00e1cie certifik\u00e1tu.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=Protokol SSL prijal neo\u010dak\u00e1van\u00fa synchroniza\u010dn\u00fa spr\u00e1vu New Session Ticket.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=Protokol SSL prijal po\u0161koden\u00fa synchroniza\u010dn\u00fa spr\u00e1vu New Session Ticket.
SSL_ERROR_DECOMPRESSION_FAILURE=Protokol SSL prijal komprimovan\u00fd z\u00e1znam, ktor\u00fd nie je mo\u017en\u00e9 dekomprimova\u0165.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Vyjedn\u00e1vanie nie je na tomto sockete SSL povolen\u00e9.
SSL_ERROR_UNSAFE_NEGOTIATION=Partner sa pok\u00fasil o zastaran\u00fa (potenci\u00e1lne zranite\u013en\u00fa) synchroniz\u00e1ciu.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=Protokol SSL prijal neo\u010dak\u00e1van\u00fd dekomprimovan\u00fd z\u00e1znam.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=Protokol SSL prijal v handshake spr\u00e1ve Server Key Exchange slab\u00fd kr\u00e1tkodob\u00fd k\u013e\u00fa\u010d Diffie-Hellman.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=Protokol SSL prijal neplatn\u00e9 \u00fadaje roz\u0161\u00edrenia NPN.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Funkcia protokolu SSL nie je podporovan\u00e1 pre pripojenia SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Funkcia protokolu SSL nie je podporovan\u00e1 pre servery.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Funkcia protokolu SSL nie je podporovan\u00e1 pre klientov.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Po\u010das bezpe\u010dnostn\u00e9ho overenia do\u0161lo k chybe vstupu a v\u00fdstupu.
SEC_ERROR_LIBRARY_FAILURE=chyba bezpe\u010dnostnej kni\u017enice.
SEC_ERROR_BAD_DATA=bezpe\u010dnostn\u00e1 kni\u017enica\: prijat\u00e9 nespr\u00e1vne \u00fadaje.
SEC_ERROR_OUTPUT_LEN=bezpe\u010dnostn\u00e1 kni\u017enica\: chyba d\u013a\u017eky v\u00fdstupu.
SEC_ERROR_INPUT_LEN=bezpe\u010dnostn\u00e1 kni\u017enica zaznamenala chybu d\u013a\u017eky vstupu.
SEC_ERROR_INVALID_ARGS=bezpe\u010dnostn\u00e1 kni\u017enica\: neplatn\u00e9 parametre.
SEC_ERROR_INVALID_ALGORITHM=bezpe\u010dnostn\u00e1 kni\u017enica\: neplatn\u00fd algoritmus.
SEC_ERROR_INVALID_AVA=bezpe\u010dnostn\u00e1 kni\u017enica\: neplatn\u00e9 AVA.
SEC_ERROR_INVALID_TIME=Nespr\u00e1vne form\u00e1tovan\u00fd \u010dasov\u00fd re\u0165azec.
SEC_ERROR_BAD_DER=bezpe\u010dnostn\u00e1 kni\u017enica\: nespr\u00e1vne form\u00e1tovan\u00e1 spr\u00e1va s k\u00f3dovan\u00edm typu DER.
SEC_ERROR_BAD_SIGNATURE=Certifik\u00e1t partnera obsahuje neplatn\u00fd podpis.
SEC_ERROR_EXPIRED_CERTIFICATE=Platnos\u0165 certifik\u00e1tu partnera uplynula.
SEC_ERROR_REVOKED_CERTIFICATE=Certifik\u00e1t partnera bol odvolan\u00fd.
SEC_ERROR_UNKNOWN_ISSUER=Vydavate\u013e certifik\u00e1tu partnera nie je rozpoznan\u00fd.
SEC_ERROR_BAD_KEY=Verejn\u00fd k\u013e\u00fa\u010d partnera nie je platn\u00fd.
SEC_ERROR_BAD_PASSWORD=Zadan\u00e9 bezpe\u010dnostn\u00e9 heslo je nespr\u00e1vne.
SEC_ERROR_RETRY_PASSWORD=Nov\u00e9 heslo bolo zadan\u00e9 nespr\u00e1vne. Sk\u00faste to znova.
SEC_ERROR_NO_NODELOCK=bezpe\u010dnostn\u00e1 kni\u017enica\: \u017eiadny uzlov\u00fd z\u00e1mok.
SEC_ERROR_BAD_DATABASE=bezpe\u010dnostn\u00e1 kni\u017enica\: nespr\u00e1vna datab\u00e1za.
SEC_ERROR_NO_MEMORY=bezpe\u010dnostn\u00e1 kni\u017enica\: chyba pridelenia pam\u00e4te.
SEC_ERROR_UNTRUSTED_ISSUER=Vydavate\u013e certifik\u00e1tu partnera bol pou\u017e\u00edvate\u013eom ozna\u010den\u00fd ako ned\u00f4veryhodn\u00fd.
SEC_ERROR_UNTRUSTED_CERT=Certifik\u00e1t partnera bol pou\u017e\u00edvate\u013eom ozna\u010den\u00fd ako ned\u00f4veryhodn\u00fd.
SEC_ERROR_DUPLICATE_CERT=Certifik\u00e1t u\u017e v datab\u00e1ze existuje.
SEC_ERROR_DUPLICATE_CERT_NAME=Prevzat\u00fd n\u00e1zov certifik\u00e1tu je duplicitn\u00fd s in\u00fdm n\u00e1zvom nach\u00e1dzaj\u00facim sa v datab\u00e1ze.
SEC_ERROR_ADDING_CERT=Chyba pri prid\u00e1van\u00ed certifik\u00e1tu do datab\u00e1zy.
SEC_ERROR_FILING_KEY=Chyba pri zara\u010fovan\u00ed k\u013e\u00fa\u010da k certifik\u00e1tu.
SEC_ERROR_NO_KEY=Priv\u00e1tny k\u013e\u00fa\u010d pre tento certifik\u00e1t nemo\u017eno v datab\u00e1ze k\u013e\u00fa\u010dov n\u00e1js\u0165.
SEC_ERROR_CERT_VALID=Certifik\u00e1t je platn\u00fd.
SEC_ERROR_CERT_NOT_VALID=Certifik\u00e1t je neplatn\u00fd.
SEC_ERROR_CERT_NO_RESPONSE=Kni\u017enica certifik\u00e1tov\: \u017eiadna odpove\u010f
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Platnos\u0165 certifik\u00e1tu vydavate\u013ea certifik\u00e1tov uplynula. Skontrolujte syst\u00e9mov\u00fd d\u00e1tum a \u010das.
SEC_ERROR_CRL_EXPIRED=Platnos\u0165 CRL vydavate\u013ea certifik\u00e1tu uplynula. Aktualizujte ho alebo skontrolujte syst\u00e9mov\u00fd d\u00e1tum a \u010das.
SEC_ERROR_CRL_BAD_SIGNATURE=CRL vydavate\u013ea certifik\u00e1tu obsahuje neplatn\u00fd podpis.
SEC_ERROR_CRL_INVALID=Nov\u00e9 CRL m\u00e1 neplatn\u00fd form\u00e1t.
SEC_ERROR_EXTENSION_VALUE_INVALID=Hodnota roz\u0161\u00edrenia certifik\u00e1tu je neplatn\u00e1.
SEC_ERROR_EXTENSION_NOT_FOUND=Roz\u0161\u00edrenie certifik\u00e1tu sa nena\u0161lo.
SEC_ERROR_CA_CERT_INVALID=Vydavate\u013e certifik\u00e1tu je neplatn\u00fd.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Obmedzenie d\u013a\u017eky cesty k certifik\u00e1tu je neplatn\u00e9.
SEC_ERROR_CERT_USAGES_INVALID=Pole pou\u017eit\u00ed certifik\u00e1tu je neplatn\u00e9.
SEC_INTERNAL_ONLY=**LEN intern\u00fd modul**
SEC_ERROR_INVALID_KEY=K\u013e\u00fa\u010d nepodporuje po\u017eadovan\u00fa oper\u00e1ciu.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Certifik\u00e1t obsahuje nezn\u00e1me rizikov\u00e9 roz\u0161\u00edrenie.
SEC_ERROR_OLD_CRL=Nov\u00e9 CRL nie je star\u0161ie ne\u017e aktu\u00e1lne.
SEC_ERROR_NO_EMAIL_CERT=Ne\u0161ifrovan\u00e9 alebo nepodp\u00edsan\u00e9\: nem\u00e1te zatia\u013e e-mailov\u00fd certifik\u00e1t.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Ne\u0161ifrovan\u00e9\: nem\u00e1te certifik\u00e1ty pre ka\u017ed\u00e9ho pr\u00edjemcu.
SEC_ERROR_NOT_A_RECIPIENT=Nie je mo\u017en\u00e9 de\u0161ifrova\u0165\: nie ste pr\u00edjemca, alebo sa nena\u0161iel zodpovedaj\u00faci certifik\u00e1t a priv\u00e1tny k\u013e\u00fa\u010d.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Nie je mo\u017en\u00e9 de\u0161ifrova\u0165\: algoritmus \u0161ifrovacieho k\u013e\u00fa\u010da nezodpoved\u00e1 certifik\u00e1tu.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Overenie podpisu sa nepodarilo\: nena\u0161iel sa podpisuj\u00faci, na\u0161lo sa pr\u00edli\u0161 ve\u013ea podpisuj\u00facich, \u00fadaje s\u00fa nespr\u00e1vne alebo po\u0161koden\u00e9.
SEC_ERROR_UNSUPPORTED_KEYALG=Nepodporovan\u00fd alebo nezn\u00e1my algoritmus k\u013e\u00fa\u010da.
SEC_ERROR_DECRYPTION_DISALLOWED=Nie je mo\u017en\u00e9 de\u0161ifrova\u0165\: za\u0161ifrovan\u00e9 pomocou nepovolen\u00e9ho algoritmu alebo nepovolenej ve\u013ekosti k\u013e\u00fa\u010da.
XP_SEC_FORTEZZA_BAD_CARD=Karta Fortezza nebola spr\u00e1vne inicializovan\u00e1. Vyberte ju a vr\u00e1\u0165te jej vydavate\u013eovi.
XP_SEC_FORTEZZA_NO_CARD=Nena\u0161la sa \u017eiadna karta Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=Nie je vybran\u00e1 \u017eiadna karta Fortezza
XP_SEC_FORTEZZA_MORE_INFO=Vyberte osobu, o ktorej chcete zisti\u0165 \u010fal\u0161ie inform\u00e1cie
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Osoba sa nena\u0161la
XP_SEC_FORTEZZA_NO_MORE_INFO=Nie s\u00fa \u017eiadne inform\u00e1cie o tejto osobe
XP_SEC_FORTEZZA_BAD_PIN=Neplatn\u00fd k\u00f3d PIN
XP_SEC_FORTEZZA_PERSON_ERROR=Nie je mo\u017en\u00e9 inicializova\u0165 osoby Fortezza.
SEC_ERROR_NO_KRL=Pre certifik\u00e1t tejto str\u00e1nky sa nena\u0161lo \u017eiadne KRL.
SEC_ERROR_KRL_EXPIRED=Uplynula platnos\u0165 KRL pre certifik\u00e1t tejto str\u00e1nky.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL pre certifik\u00e1t tejto str\u00e1nky obsahuje neplatn\u00fd podpis.
SEC_ERROR_REVOKED_KEY=K\u013e\u00fa\u010d pre certifik\u00e1t tejto str\u00e1nky bol odvolan\u00fd.
SEC_ERROR_KRL_INVALID=Nov\u00e9 KRL m\u00e1 neplatn\u00fd form\u00e1t.
SEC_ERROR_NEED_RANDOM=bezpe\u010dnostn\u00e1 kni\u017enica\: s\u00fa potrebn\u00e9 n\u00e1hodn\u00e9 \u00fadaje.
SEC_ERROR_NO_MODULE=bezpe\u010dnostn\u00e1 kni\u017enica\: \u017eiadny bezpe\u010dnostn\u00fd modul nem\u00f4\u017ee vykona\u0165 po\u017eadovan\u00fa oper\u00e1ciu.
SEC_ERROR_NO_TOKEN=Bezpe\u010dnostn\u00e1 karta alebo token neexistuj\u00fa, vy\u017eaduj\u00fa inicializ\u00e1ciu alebo boli odstr\u00e1nen\u00e9.
SEC_ERROR_READ_ONLY=bezpe\u010dnostn\u00e1 kni\u017enica\: datab\u00e1za je len na \u010d\u00edtanie.
SEC_ERROR_NO_SLOT_SELECTED=Nebola vybran\u00e1 \u017eiadna z\u00e1suvka ani token.
SEC_ERROR_CERT_NICKNAME_COLLISION=Certifik\u00e1t s rovnak\u00fdm n\u00e1zvom u\u017e existuje.
SEC_ERROR_KEY_NICKNAME_COLLISION=K\u013e\u00fa\u010d s rovnak\u00fdm n\u00e1zvom u\u017e existuje.
SEC_ERROR_SAFE_NOT_CREATED=chyba po\u010das vytv\u00e1rania bezpe\u010dn\u00e9ho objektu
SEC_ERROR_BAGGAGE_NOT_CREATED=chyba po\u010das vytv\u00e1rania objektu zariadenia
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Nie je mo\u017en\u00e9 odstr\u00e1ni\u0165 predstavite\u013ea
XP_JAVA_DELETE_PRIVILEGE_ERROR=Nie je mo\u017en\u00e9 odstr\u00e1ni\u0165 pr\u00e1vo
XP_JAVA_CERT_NOT_EXISTS_ERROR=Tento predstavite\u013e nem\u00e1 certifik\u00e1t
SEC_ERROR_BAD_EXPORT_ALGORITHM=Po\u017eadovan\u00fd algoritmus nie je povolen\u00fd.
SEC_ERROR_EXPORTING_CERTIFICATES=Chyba po\u010das pokusu o export certifik\u00e1tov.
SEC_ERROR_IMPORTING_CERTIFICATES=Chyba po\u010das pokusu o import certifik\u00e1tov.
SEC_ERROR_PKCS12_DECODING_PFX=Import nie je mo\u017en\u00fd. Chyba dek\u00f3dovania. S\u00fabor nie je platn\u00fd.
SEC_ERROR_PKCS12_INVALID_MAC=Import nie je mo\u017en\u00fd. Neplatn\u00e9 MAC. Nespr\u00e1vne heslo alebo je s\u00fabor po\u0161koden\u00fd.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Import nie je mo\u017en\u00fd. Algoritmus MAC nie je podporovan\u00fd.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Import nie je mo\u017en\u00fd. Podporovan\u00e1 je len integrita hesla a re\u017eimov s\u00fakromia.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Import nie je mo\u017en\u00fd. \u0160trukt\u00fara s\u00faboru je po\u0161koden\u00e1.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Import nie je mo\u017en\u00fd. Algoritmus \u0161ifrovania nie je podporovan\u00fd.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Import nie je mo\u017en\u00fd. Verzia s\u00faboru nie je podporovan\u00e1.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Import nie je mo\u017en\u00fd. Nespr\u00e1vne heslo s\u00fakromia.
SEC_ERROR_PKCS12_CERT_COLLISION=Import nie je mo\u017en\u00fd. Rovnak\u00e1 prez\u00fdvka u\u017e v datab\u00e1ze existuje.
SEC_ERROR_USER_CANCELLED=Pou\u017e\u00edvate\u013e stla\u010dil tla\u010didlo Zru\u0161i\u0165.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Neimportovan\u00e9, u\u017e je v datab\u00e1ze.
SEC_ERROR_MESSAGE_SEND_ABORTED=Spr\u00e1va nebola odoslan\u00e1.
SEC_ERROR_INADEQUATE_KEY_USAGE=Pou\u017eitie certifika\u010dn\u00e9ho k\u013e\u00fa\u010da nezodpoved\u00e1 po\u017eadovanej oper\u00e1cii.
SEC_ERROR_INADEQUATE_CERT_TYPE=Typ certifik\u00e1tu nie je pre aplik\u00e1ciu schv\u00e1len\u00fd.
SEC_ERROR_CERT_ADDR_MISMATCH=Adresa v podp\u00edsanom certifik\u00e1te nezodpoved\u00e1 adrese v hlavi\u010dk\u00e1ch spr\u00e1vy.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Import nie je mo\u017en\u00fd. Chyba pri pokuse o import priv\u00e1tneho k\u013e\u00fa\u010da.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Import nie je mo\u017en\u00fd. Chyba pri pokuse o import re\u0165azca certifik\u00e1tu.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Export nie je mo\u017en\u00fd. Nie je mo\u017en\u00e9 vyh\u013eada\u0165 certifik\u00e1t alebo k\u013e\u00fa\u010d pod\u013ea prez\u00fdvky.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Export nie je mo\u017en\u00fd. Priv\u00e1tny k\u013e\u00fa\u010d nie je mo\u017en\u00e9 vyh\u013eada\u0165 a exportova\u0165.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Export nie je mo\u017en\u00fd. Nie je mo\u017en\u00e9 zap\u00edsa\u0165 s\u00fabor exportu.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Import nie je mo\u017en\u00fd. Nie je mo\u017en\u00e9 \u010d\u00edta\u0165 s\u00fabor importu.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Export nie je mo\u017en\u00fd. Datab\u00e1za k\u013e\u00fa\u010dov je po\u0161koden\u00e1 alebo odstr\u00e1nen\u00e1.
SEC_ERROR_KEYGEN_FAIL=Nie je mo\u017en\u00e9 generova\u0165 p\u00e1rovan\u00fd verejn\u00fd alebo priv\u00e1tny k\u013e\u00fa\u010d.
SEC_ERROR_INVALID_PASSWORD=Zadan\u00e9 heslo je neplatn\u00e9. Vyberte in\u00e9.
SEC_ERROR_RETRY_OLD_PASSWORD=Star\u00e9 heslo nie je zadan\u00e9 spr\u00e1vne. Sk\u00faste to znova.
SEC_ERROR_BAD_NICKNAME=Prez\u00fdvka certifik\u00e1tu sa u\u017e pou\u017e\u00edva.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Re\u0165azec FORTEZZA partnera obsahuje certifik\u00e1t in\u00e9ho typu ne\u017e FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Pr\u00edslu\u0161n\u00fd k\u013e\u00fa\u010d nie je mo\u017en\u00e9 presun\u00fa\u0165 do z\u00e1suvky, v ktorej je vy\u017eadovan\u00fd.
SEC_ERROR_JS_INVALID_MODULE_NAME=Neplatn\u00fd n\u00e1zov modulu.
SEC_ERROR_JS_INVALID_DLL=Neplatn\u00e1 cesta k modulu alebo n\u00e1zov s\u00faboru
SEC_ERROR_JS_ADD_MOD_FAILURE=Modul nie je mo\u017en\u00e9 prida\u0165
SEC_ERROR_JS_DEL_MOD_FAILURE=Modul nie je mo\u017en\u00e9 odstr\u00e1ni\u0165
SEC_ERROR_OLD_KRL=Nov\u00e9 KRL nie je star\u0161ie ne\u017e aktu\u00e1lne.
SEC_ERROR_CKL_CONFLICT=Nov\u00e9 CKL m\u00e1 in\u00e9ho vydavate\u013ea ne\u017e aktu\u00e1lne CKL. Odstr\u00e1\u0148te s\u00fa\u010dasn\u00e9 CKL.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Certifika\u010dn\u00e1 autorita tohto certifik\u00e1tu nem\u00e1 povolenie na vydanie certifik\u00e1tu s t\u00fdmto n\u00e1zvom.
SEC_ERROR_KRL_NOT_YET_VALID=Zoznam odvolania k\u013e\u00fa\u010dov tohto certifik\u00e1tu zatia\u013e nie je platn\u00fd.
SEC_ERROR_CRL_NOT_YET_VALID=Zoznam odvolania k\u013e\u00fa\u010dov tohto certifik\u00e1tu zatia\u013e nie je platn\u00fd.
SEC_ERROR_UNKNOWN_CERT=Po\u017eadovan\u00fd certifik\u00e1t nie je mo\u017en\u00e9 n\u00e1js\u0165.
SEC_ERROR_UNKNOWN_SIGNER=Certifik\u00e1t podpisuj\u00faceho nie je mo\u017en\u00e9 n\u00e1js\u0165.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Adresa servera stavu certifik\u00e1tu m\u00e1 neplatn\u00fd form\u00e1t.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Odozvu OCSP nie je mo\u017en\u00e9 \u00faplne dek\u00f3dova\u0165, je nezn\u00e1meho typu.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Server OCSP vr\u00e1til neo\u010dak\u00e1van\u00e9 alebo neplatn\u00e9 \u00fadaje HTTP.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Server OCSP zistil, \u017ee po\u017eiadavka bude po\u0161koden\u00e1 alebo m\u00e1 nespr\u00e1vny form\u00e1t.
SEC_ERROR_OCSP_SERVER_ERROR=Server OCSP zaznamenal intern\u00fa chybu.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Server OCSP navrhuje sk\u00fasi\u0165 to nesk\u00f4r znova.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Server OCSP vy\u017eaduje k tejto po\u017eiadavke podpis.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Server OCSP odmietol t\u00fato po\u017eiadavku ako neoveren\u00fa.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Server OCSP odpovedal, \u017ee stav nie je mo\u017en\u00e9 rozpozna\u0165.
SEC_ERROR_OCSP_UNKNOWN_CERT=Server OCSP nem\u00e1 stav certifik\u00e1tu.
SEC_ERROR_OCSP_NOT_ENABLED=Pred vykonan\u00edm tejto oper\u00e1cie je potrebn\u00e9 povoli\u0165 OCSP.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Pred vykonan\u00edm tejto oper\u00e1cie je potrebn\u00e9 nastavi\u0165 predvolen\u00fd modul odpovede OCSP.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Odozva zo servera OCSP bola po\u0161koden\u00e1 alebo m\u00e1 nespr\u00e1vny form\u00e1t.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Podpisuj\u00faci odozvy OCSP nem\u00e1 overenie na z\u00edskanie stavu tohto certifik\u00e1tu.
SEC_ERROR_OCSP_FUTURE_RESPONSE=Odozva OCSP zatia\u013e nie je platn\u00e1 (obsahuje d\u00e1tum, ktor\u00fd e\u0161te len nastane).
SEC_ERROR_OCSP_OLD_RESPONSE=Odozva OCSP obsahuje \u00fadaj, ktor\u00e9 platnos\u0165 u\u017e uplynula.
SEC_ERROR_DIGEST_NOT_FOUND=V podp\u00edsanej spr\u00e1ve sa nena\u0161lo CMS ani PKCS \#7 Digest.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Typ spr\u00e1vy CMS alebo PKCS \#7 nie je podporovan\u00fd.
SEC_ERROR_MODULE_STUCK=Modul PKCS \#11 nie je mo\u017en\u00e9 odstr\u00e1ni\u0165, preto\u017ee sa st\u00e1le pou\u017e\u00edva.
SEC_ERROR_BAD_TEMPLATE=Nie je mo\u017en\u00e9 dek\u00f3dova\u0165 \u00fadaje ASN.1. Ur\u010den\u00e1 \u0161abl\u00f3na bola neplatn\u00e1.
SEC_ERROR_CRL_NOT_FOUND=Nena\u0161lo sa zodpovedaj\u00face CRL.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Pokus o import certifik\u00e1tu s rovnak\u00fdm vydavate\u013eom a s\u00e9riov\u00fdm \u010d\u00edslom, ak\u00e9 u\u017e existuj\u00fa, ale certifik\u00e1t nie je rovnak\u00fd.
SEC_ERROR_BUSY=NSS nie je mo\u017en\u00e9 vypn\u00fa\u0165. Objekty sa st\u00e1le pou\u017e\u00edvaj\u00fa.
SEC_ERROR_EXTRA_INPUT=K\u00f3dovan\u00e1 spr\u00e1va typu DER obsahuje \u0161peci\u00e1lne nepou\u017e\u00edvan\u00e9 \u00fadaje.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Nepodporovan\u00e1 elipsov\u00e1 krivka.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Nepodporovan\u00e1 forma bodu elipsovej krivky.
SEC_ERROR_UNRECOGNIZED_OID=Nerozpoznan\u00fd identifik\u00e1tor objektu.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Neplatn\u00fd podpisov\u00fd certifik\u00e1t v odozve OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Certifik\u00e1t je pod\u013ea zoznamu odvolania certifik\u00e1tov vydavate\u013ea odvolan\u00fd.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Modul odpovede vydavate\u013eovho OCSP hl\u00e1si, \u017ee certifik\u00e1t je odvolan\u00fd.
SEC_ERROR_CRL_INVALID_VERSION=Zoznam odvolania certifik\u00e1tov vydavate\u013ea m\u00e1 nezn\u00e1me \u010d\u00edslo verzie.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Zoznam V1 odvolania certifik\u00e1tov vydavate\u013ea m\u00e1 rizikov\u00e9 roz\u0161\u00edrenie.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Zoznam V2 odvolania certifik\u00e1tov vydavate\u013ea m\u00e1 nezn\u00e1me rizikov\u00e9 roz\u0161\u00edrenie.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Ur\u010den\u00fd nezn\u00e1my typ objektu.
SEC_ERROR_INCOMPATIBLE_PKCS11=Ovl\u00e1da\u010d PKCS \#11 poru\u0161uje nekompatibiln\u00fdm sp\u00f4sobom parameter.
SEC_ERROR_NO_EVENT=Moment\u00e1lne nie je k dispoz\u00edcii \u017eiadna nov\u00e1 z\u00e1suvka udalosti.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL u\u017e existuje.
SEC_ERROR_NOT_INITIALIZED=NSS nie je inicializovan\u00e9.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Oper\u00e1cia sa nepodarila, preto\u017ee token PKCS\#11 nie je prihl\u00e1sen\u00fd.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Certifik\u00e1t nakonfigurovan\u00e9ho modulu odpovede OCSP je neplatn\u00fd.
SEC_ERROR_OCSP_BAD_SIGNATURE=Odpove\u010f OCSP m\u00e1 neplatn\u00fd podpis.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Vyh\u013eadanie overenia certifik\u00e1tu je mimo limitov vyh\u013ead\u00e1vania
SEC_ERROR_INVALID_POLICY_MAPPING=Politika priradenia obsahuje hodnotu anypolicy
SEC_ERROR_POLICY_VALIDATION_FAILED=Re\u0165az certifik\u00e1tu nepre\u0161la z\u00e1sadami overenia
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Nezn\u00e1my typ umiestnenia v roz\u0161\u00edren\u00ed certifik\u00e1tu AIA
SEC_ERROR_BAD_HTTP_RESPONSE=Server vr\u00e1til nespr\u00e1vnu odpove\u010f HTTP
SEC_ERROR_BAD_LDAP_RESPONSE=Server vr\u00e1til nespr\u00e1vnu odpove\u010f LDAP
SEC_ERROR_FAILED_TO_ENCODE_DATA=Nepodarilo sa zak\u00f3dova\u0165 \u00fadaje pomocou k\u00f3dera ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Nespr\u00e1vne umiestnenie pr\u00edstupu k inform\u00e1ci\u00e1m v roz\u0161\u00edren\u00ed certifik\u00e1tu.
SEC_ERROR_LIBPKIX_INTERNAL=Po\u010das overenia certifik\u00e1tu sa vyskytla vn\u00fatorn\u00e1 chyba kni\u017enice Libpkix.
SEC_ERROR_PKCS11_GENERAL_ERROR=Modul PKCS \#11 vr\u00e1til chybu CKR_GENERAL_ERROR, \u010do indikuje, \u017ee sa objavila neobnovite\u013en\u00e1 chyba.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Modul PKCS \#11 vr\u00e1til chybu CKR_FUNCTION_FAILED, \u010do indikuje, \u017ee po\u017eadovan\u00e1 funkcia nemohla by\u0165 vykonan\u00e1. Op\u00e4tovn\u00e9 spustenie oper\u00e1cie m\u00f4\u017ee vies\u0165 k \u00faspechu.
SEC_ERROR_PKCS11_DEVICE_ERROR=Modul PKCS \#11 vr\u00e1til chybu CKR_DEVICE_ERROR, \u010do indikuje, \u017ee sa objavil probl\u00e9m s tokenom alebo slotom.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Nezn\u00e1ma met\u00f3da pr\u00edstupu k inform\u00e1ci\u00e1m v roz\u0161\u00edren\u00ed certifik\u00e1tu.
SEC_ERROR_CRL_IMPORT_FAILED=Chyba pri pokuse o importovanie CRL.
SEC_ERROR_EXPIRED_PASSWORD=Heslo vypr\u0161alo.
SEC_ERROR_LOCKED_PASSWORD=Heslo je zamknut\u00e9.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Nezn\u00e1ma chyba PKCS \#11.
SEC_ERROR_BAD_CRL_DP_URL=Neplatn\u00e1 alebo nepodporovan\u00e1 adresa URL v n\u00e1zve lokality distrib\u00facie CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Certifik\u00e1t bol podp\u00edsan\u00fd pou\u017eit\u00edm podpisov\u00e9ho algoritmu, ktor\u00fd je zak\u00e1zan\u00fd, preto\u017ee nie je bezpe\u010dn\u00fd.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

