#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=Adres URL jest nieprawid\u0142owy i nie mo\u017ce zosta\u0107 wczytany.
fileNotFound=Pale Moon nie mo\u017ce odnale\u017a\u0107 pliku %S.
dnsNotFound=Pale Moon nie mo\u017ce odnale\u017a\u0107 serwera %S.
protocolNotFound=Pale Moon nie jest w stanie otworzy\u0107 tego adresu, poniewa\u017c protok\u00f3\u0142 "%S" nie jest przypisany do \u017cadnego programu.
connectionFailure=Pale Moon nie mo\u017ce nawi\u0105za\u0107 po\u0142\u0105czenia z serwerem %S.
netInterrupt=Po\u0142\u0105czenie z %S zosta\u0142o przerwane podczas wczytywania strony.
netTimeout=Serwer %S zbyt d\u0142ugo nie odpowiada.
redirectLoop=Pale Moon wykry\u0142, \u017ce serwer przekierowuje \u017c\u0105danie tego zasobu w spos\u00f3b uniemo\u017cliwiaj\u0105cy jego uko\u0144czenie.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Aby wy\u015bwietli\u0107 t\u0119 stron\u0119, %S musi ponownie przes\u0142a\u0107 dane, kt\u00f3re spowoduj\u0105 powt\u00f3rzenie zada\u0144 wykonanych wcze\u015bniej (takich jak przeszukiwanie czy potwierdzenie zlecenia).
resendButton.label=Prze\u015blij ponownie
unknownSocketType=Pale Moon nie jest w stanie skomunikowa\u0107 si\u0119 z tym serwerem.
netReset=Po\u0142\u0105czenie z serwerem zosta\u0142o zresetowane podczas wczytywania strony.
notCached=Ten dokument nie jest ju\u017c dost\u0119pny.
netOffline=Pale Moon jest obecnie w trybie offline i przegl\u0105danie Internetu jest w tej chwili niemo\u017cliwe.
isprinting=Strona nie mo\u017ce zosta\u0107 zmieniona podczas wydruku, lub kiedy w\u0142\u0105czony jest podgl\u0105d wydruku.
deniedPortAccess=Ten adres zawiera numer portu sieciowego, kt\u00f3ry zazwyczaj nie jest wykorzystywany do przegl\u0105dania stron WWW. Pale Moon anulowa\u0142 \u017c\u0105danie dla bezpiecze\u0144stwa u\u017cytkownika.
proxyResolveFailure=Pale Moon zosta\u0142 skonfigurowany tak, by u\u017cywa\u0142 serwera proxy, kt\u00f3rego nie jest w stanie odnale\u017a\u0107.
proxyConnectFailure=Pale Moon zosta\u0142 skonfigurowany tak, by u\u017cywa\u0142 serwera proxy, kt\u00f3ry odmawia po\u0142\u0105czenia.
contentEncodingError=Otwierana strona nie mo\u017ce zosta\u0107 wy\u015bwietlona, poniewa\u017c u\u017cywa nieprawid\u0142owych lub nieobs\u0142ugiwanych metod kompresji.
unsafeContentType=Otwierana strona nie mo\u017ce zosta\u0107 wy\u015bwietlona, poniewa\u017c umieszczona jest w pliku, kt\u00f3rego otwarcie mo\u017ce nie by\u0107 bezpieczne. Prosimy poinformowa\u0107 w\u0142a\u015bcicieli witryny o tym problemie.
externalProtocolTitle=\u017b\u0105danie zewn\u0119trznego protoko\u0142u
externalProtocolPrompt=Aby obs\u0142u\u017cy\u0107 odno\u015bnik %1$S\: musi zosta\u0107 uruchomiona zewn\u0119trzna aplikacja.\n\n\nZa\u017c\u0105dany odno\u015bnik\:\n\n%2$S\n\nAplikacja\: %3$S\n\n\nJe\u015bli to \u017c\u0105danie pojawi\u0142o si\u0119 niespodziewanie, mo\u017ce to by\u0107 pr\u00f3ba wykorzystania b\u0142\u0119du w aplikacji zewn\u0119trznej. W razie jakichkolwiek w\u0105tpliwo\u015bci anuluj to \u017c\u0105danie.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Nieznana>
externalProtocolChkMsg=Zapami\u0119taj m\u00f3j wyb\u00f3r dla wszystkich odno\u015bnik\u00f3w tego rodzaju.
externalProtocolLaunchBtn=Uruchom aplikacj\u0119
malwareBlocked=Witryna %S zosta\u0142a zg\u0142oszona jako witryna stanowi\u0105ca zagro\u017cenie i zosta\u0142a zablokowana zgodnie z ustawieniami bezpiecze\u0144stwa.
phishingBlocked=Witryna %S zosta\u0142a zg\u0142oszona jako przypadek oszustwa maj\u0105cego na celu wy\u0142udzenie danych osobowych i informacji finansowych.
cspFrameAncestorBlocked=Ta strona posiada polityk\u0119 bezpiecze\u0144stwa tre\u015bci, kt\u00f3ra nie pozwala na osadzenie jej w taki spos\u00f3b.
xssBlockMode=Ta strona zawiera atak XSS, kt\u00f3ry zosta\u0142 zablokowany dla Twojego bezpiecze\u0144stwa.
corruptedContentError=Strona, kt\u00f3r\u0105 pr\u00f3bujesz obejrze\u0107, nie mo\u017ce by\u0107 wy\u015bwietlona, poniewa\u017c wykryto b\u0142\u0105d w transmisji danych.
remoteXUL=Ta strona u\u017cywa technologii nieobs\u0142ugiwane, kt\u00f3ra nie jest ju\u017c domy\u015blnie dost\u0119pna w Pale Moon.

