#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Non foi pos\u00edbel comunicar de modo seguro. O elemento do mesmo nivel non \u00e9 compat\u00edbel cunha codificaci\u00f3n de grao alto.
SSL_ERROR_US_ONLY_SERVER=Non foi pos\u00edbel comunicar de modo seguro. O elemento do mesmo nivel require unha codificaci\u00f3n de grao alto que non \u00e9 compat\u00edbel.
SSL_ERROR_NO_CYPHER_OVERLAP=Non \u00e9 pos\u00edbel comunicar de modo seguro cun elemento do mesmo nivel\: Non hai algoritmos de codificaci\u00f3n com\u00fan.
SSL_ERROR_NO_CERTIFICATE=Non foi pos\u00edbel localizar o certificado ou chave necesaria para a autenticaci\u00f3n.
SSL_ERROR_BAD_CERTIFICATE=Non foi pos\u00edbel comunicar de modo seguro cun elemento do mesmo nivel\: O certificado do elemento do mesmo nivel foi rexeitado.
SSL_ERROR_UNUSED_5=C\u00f3digo do erro SSL non reco\u00f1ecido.
SSL_ERROR_BAD_CLIENT=O servidor encontrou datos incorrectos do cliente.
SSL_ERROR_BAD_SERVER=O cliente encontrou datos incorrectos do servidor.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Tipo de certificado non compat\u00edbel.
SSL_ERROR_UNSUPPORTED_VERSION=Elemento do mesmo nivel usando unha versi\u00f3n de protocolo de seguranza incompat\u00edbel.
SSL_ERROR_UNUSED_10=C\u00f3digo do erro SSL non reco\u00f1ecido.
SSL_ERROR_WRONG_CERTIFICATE=Erro na autenticaci\u00f3n do cliente\: A chave privada da base de datos de chaves non coincide coa chave p\u00fablica da base de datos de certificados.
SSL_ERROR_BAD_CERT_DOMAIN=Non foi pos\u00edbel comunicar de modo seguro cun elemento do mesmo nivel\: O nome do dominio requirido non coincide co certificado do servidor.
SSL_ERROR_POST_WARNING=C\u00f3digo do erro SSL non reco\u00f1ecido.
SSL_ERROR_SSL2_DISABLED=O elemento do mesmo nivel s\u00f3 \u00e9 compat\u00edbel coa versi\u00f3n 2 de SSL, que est\u00e1 localmente desactivada.
SSL_ERROR_BAD_MAC_READ=SSL recibiu un rexistro cun c\u00f3digo de autenticaci\u00f3n da mensaxe incorrecto.
SSL_ERROR_BAD_MAC_ALERT=O elemento do mesmo nivel de SSL informa dun c\u00f3digo incorrecto de autenticaci\u00f3n da mensaxe.
SSL_ERROR_BAD_CERT_ALERT=O elemento do mesmo nivel de SSL non pode verificar o seu certificado.
SSL_ERROR_REVOKED_CERT_ALERT=O elemento do mesmo nivel de SSL rexeitou o seu certificado como revogado.
SSL_ERROR_EXPIRED_CERT_ALERT=O elemento do mesmo nivel  de SSL rexeitou o seu certificado como caducado.
SSL_ERROR_SSL_DISABLED=Non \u00e9 pos\u00edbel conectar\: SSL est\u00e1 desactivado.
SSL_ERROR_FORTEZZA_PQG=Non \u00e9 pos\u00edbel conectar\: O elemento do mesmo nivel de SSL est\u00e1 noutro dominio de FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Solicitouse un paquete de codificaci\u00f3n de SSL desco\u00f1ecido.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Non hai paquetes de codificaci\u00f3n que estean presentes e activados neste programa.
SSL_ERROR_BAD_BLOCK_PADDING=SSL recibiu un rexistro cun enchemento de bloque incorrecto.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL recibiu un rexistro que execed\u00eda a lonxitude m\u00e1xima permitida.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL tentou enviar un rexistro que exed\u00eda a lonxitude m\u00e1xima permitida.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n co cliente.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n co servidor.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n co certificado.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n co intercambio de chave do servidor.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n coa solicitude de certificado.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n realizado co servidor.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n coa verificaci\u00f3n do certificado.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n co intercambio de chave de cliente.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n conclu\u00eddo.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL recibiu un rexistro incorrecto de Change Cipher Spec.
SSL_ERROR_RX_MALFORMED_ALERT=SSL recibiu un rexistro incorrecto de alarma.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL recibiu un rexistro incorrecto de estabelecemento de comunicaci\u00f3n.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL recibiu un rexistro incorrecto de datos do aplicativo.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n co cliente.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n co servidor.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n co certificado.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n co intercambio de chave do servidor.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n coa solicitude de certificado.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n co servidor.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n coa verificaci\u00f3n do certificado.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n co intercambio de chave do cliente.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL recibiu unha mensaxe inesperada de estabelecemento de comunicaci\u00f3n finalizado.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL recibiu un rexistro inesperado de Change Cipher Spec.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL recibiu un rexistro inesperado de alarma.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL recibiu un rexistro inesperado de estabelecemento de comunicaci\u00f3n.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL recibiu un rexistro inesperado de datos do aplicativo.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL recibiu un rexistro cun tipo de contido desco\u00f1ecido.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL recibiu unha mensaxe de estabelecemento de comunicaci\u00f3n cun tipo de mensaxe desco\u00f1ecido.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL recibiu un rexistro de alerta cunha descrici\u00f3n de alerta desco\u00f1ecida.
SSL_ERROR_CLOSE_NOTIFY_ALERT=O elemento do mesmo nivel de SSL pechou esta conexi\u00f3n.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=O elemento do mesmo nivel de SSL non estaba \u00e1 espera de recibir unha mensaxe de estabelecemento de comunicaci\u00f3n.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=O elemento do mesmo nivel de SSL non conseguiu descomprimir correctamente o rexistro  SSL recibido.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=O elemento do mesmo nivel de SSL non conseguiu negociar un conxunto de par\u00e1metros de seguranza acept\u00e1bel.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=O elemento do mesmo nivel de SSL rexeitou unha mensaxe de  estabelecemento de comunicaci\u00f3n co contido inacept\u00e1bel.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=O elemento do mesmo nivel de SSL non \u00e9 compat\u00edbel cos certificados do tipo recibido.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=O elemento do mesmo nivel de SSL ti\u00f1a alg\u00fan problema inespec\u00edfico co certificado recibido.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL experimentou un erro do seu xerador num\u00e9rico aleatorio
SSL_ERROR_SIGN_HASHES_FAILURE=Non foi pos\u00edbel asinar dixitalmente os datos requiridos para verificar o seu certificado.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL non conseguiu extraer a chave p\u00fablica do certificado do elemento do mesmo nivel.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Erro non especificado ao procesar o estabelecemento de comunicaci\u00f3n do intercambio de chave do servidor de SSL.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Erro non especificado ao procesar a mensaxe de estabelecemento de comunicaci\u00f3n do intercambio de chave de cliente de SSL.
SSL_ERROR_ENCRYPTION_FAILURE=Erro do algoritmo de codificaci\u00f3n masiva de datos no paquete de codificaci\u00f3n seleccionado.
SSL_ERROR_DECRYPTION_FAILURE=Erro do algoritmo de codificaci\u00f3n masiva de datos no paquete de codificaci\u00f3n seleccionado.
SSL_ERROR_SOCKET_WRITE_FAILURE=Erro na tentativa de escribir datos codificados para o socket subxacente.
SSL_ERROR_MD5_DIGEST_FAILURE=Erro da funci\u00f3n de resumo de MD5.
SSL_ERROR_SHA_DIGEST_FAILURE=Erro da funci\u00f3n de resumo de SHA-1.
SSL_ERROR_MAC_COMPUTATION_FAILURE=Erro de c\u00e1lculo de MAC.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Erro ao crear o contexto de chave sim\u00e9trica.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Erro ao abrir a chave sim\u00e9trica na mensaxe de intercambio de chave do cliente.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Tentativa do servidor de SSL para utilizar a chave p\u00fablica de grao dom\u00e9stico co paquete de codificaci\u00f3n de exportaci\u00f3n.
SSL_ERROR_IV_PARAM_FAILURE=Erro do c\u00f3digo PKCS11 para traducir IV nun par\u00e1metro.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Erro ao iniciar o paquete de codificaci\u00f3n seleccionado.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Erro do cliente ao xerar chaves de sesi\u00f3n da sesi\u00f3n SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=O servidor non ten chave para o algoritmo de intercambio de chave tentado.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=A chave electr\u00f3nica PKCS\#11 inseriuse ou eliminouse mentres a operaci\u00f3n estaba en proceso.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Non foi pos\u00edbel encontrar ningunha chave electr\u00f3nica PKCS\#11 para realizar a operci\u00f3n requirida.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Non \u00e9 pos\u00edbel comunicar de modo seguro co elemento do mesmo nivel\: Non hai algoritmos de compresi\u00f3n com\u00fans.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Non \u00e9 pos\u00edbel iniciar outro estabelecemento de comunicaci\u00f3n de SSL at\u00e9 que concl\u00faa o estabelecemento de comunicaci\u00f3n actual.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Recib\u00edronse valores hash de estabelecemento de comunicaci\u00f3n incorrectos a partir do elemento do mesmo nivel.
SSL_ERROR_CERT_KEA_MISMATCH=Non \u00e9 pos\u00edbel utilizar o certificado fornecido co algoritmo de intercambio de chave seleccionado.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Non hai ningunha autoridade de certificado de confianza para a autenticaci\u00f3n de cliente de SSL.
SSL_ERROR_SESSION_NOT_FOUND=Non se encontrou o ID da sesi\u00f3n SSL de cliente na cach\u00e9 da sesi\u00f3n do servidor.
SSL_ERROR_DECRYPTION_FAILED_ALERT=O elemento do mesmo nivel non conseguiu descifrar un rexistro de SSL recibido.
SSL_ERROR_RECORD_OVERFLOW_ALERT=O elemento do mesmo nivel recibiu un rexistro de SSL que era m\u00e1is longo do permitido.
SSL_ERROR_UNKNOWN_CA_ALERT=O elemento do mesmo nivel non reco\u00f1ece nin conf\u00eda na AC que emitiu o seu certificado.
SSL_ERROR_ACCESS_DENIED_ALERT=O elemento do mesmo nivel recibiu un certificado v\u00e1lido, mais negouse o acceso.
SSL_ERROR_DECODE_ERROR_ALERT=O elemento do mesmo nivel non conseguiu descodificar unha mensaxe de estabelecemento de comunicaci\u00f3n de SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=O elemento do mesmo nivel informa dun erro de verificaci\u00f3n de sinatura ou de intercambio de chave.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=O elemento do mesmo nivel informa dunha negociaci\u00f3n en disconformidade coas regulaci\u00f3ns de exportaci\u00f3n.
SSL_ERROR_PROTOCOL_VERSION_ALERT=O elemento do mesmo nivel informa dunha versi\u00f3n de protocolo non admitida ou incompat\u00edbel.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=O servidor require c\u00f3digos m\u00e1is seguros que aqueles compat\u00edbeis co cliente.
SSL_ERROR_INTERNAL_ERROR_ALERT=O elemento do mesmo nivel informa de que isto experimentou un erro interno.
SSL_ERROR_USER_CANCELED_ALERT=O usuario do elemento do mesmo nivel cancelou o estabelemento de comunicaci\u00f3n.
SSL_ERROR_NO_RENEGOTIATION_ALERT=O elemento do mesmo nivel non permite a renegociaci\u00f3n dos par\u00e1metros de seguranza de SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Cach\u00e9 do servidor SSL non configurada nin desactivada para este socket.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=O elemento do mesmo nivel de SSL non \u00e9 compat\u00edbel coa extensi\u00f3n de sa\u00fado TLS requirida.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=O elemento do mesmo nivel de SSL non conseguiu obter o seu certificado a partir do URL fornecido.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=O elemento do mesmo nivel de SSL non ten certificado para o nome DNS requirido.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=O elemento do mesmo nivel de SSL non conseguiu obter unha resposta  OCSP para os seus certificados.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=O elemento do mesmo nivel de SSL informou dun valor hash de certificado incorrecto.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL recibiu unha mensaxe inesperada de negociaci\u00f3n de novo ticket de sesi\u00f3n.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL recibiu unha mensaxe incorrecta de estabelecemento de comunicaci\u00f3n de novo ticket de sesi\u00f3n.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL recibiu un rexistro comprimido que non foi pos\u00edbel descomprimir.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Non se permite a renegociaci\u00f3n neste s\u00f3cket SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=O elemento do mesmo nivel intentou un estabelecemento de comunicaci\u00f3n ao estilo antigo (potencialmente vulner\u00e1bel).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL recibiu un rexistro inesperado sen comprimir.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL recibiu unha chave Diffie-Hellman ef\u00e9mera d\u00e9bil na mensaxe de estabelecemento de comunicaci\u00f3n co intercambio de chave do servidor.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL recibiu datos da extensi\u00f3n NPN incorrectos.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Non se admite a caracter\u00edstica SSL nas conexi\u00f3ns SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Non se admite a caracter\u00edstica SSL nos servidores.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Non se admite a caracter\u00edstica SSL nos clientes.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Produciuse un erro E/S durante a autorizaci\u00f3n de seguranza.
SEC_ERROR_LIBRARY_FAILURE=erro da biblioteca de seguranza.
SEC_ERROR_BAD_DATA=biblioteca de seguranza\: recib\u00edronse datos incorrectos.
SEC_ERROR_OUTPUT_LEN=biblioteca de seguranza\: erro de lonxitude de sa\u00edda.
SEC_ERROR_INPUT_LEN=a biblioteca de seguranza experimentou un erro de lonxitude de entrada.
SEC_ERROR_INVALID_ARGS=biblioteca de seguranza\: argumentos non v\u00e1lidos.
SEC_ERROR_INVALID_ALGORITHM=biblioteca de seguranza\: algoritmo non v\u00e1lido.
SEC_ERROR_INVALID_AVA=biblioteca de seguranza\: AVA non v\u00e1lido.
SEC_ERROR_INVALID_TIME=Cadea de tempo formatada incorrectamente.
SEC_ERROR_BAD_DER=biblioteca de seguranza\: mensaxe DER codificada formatada incorrectamente.
SEC_ERROR_BAD_SIGNATURE=O certificado do elemento do mesmo nivel ten unha sinatura v\u00e1lida.
SEC_ERROR_EXPIRED_CERTIFICATE=O certificado do elemento do mesmo nivel caducou.
SEC_ERROR_REVOKED_CERTIFICATE=O certificado do elemento do mesmo nivel foi revogado.
SEC_ERROR_UNKNOWN_ISSUER=O emisor do certificado do elemento do mesmo nivel non \u00e9 reco\u00f1ecido.
SEC_ERROR_BAD_KEY=A chave p\u00fablica do elemento do mesmo nivel non \u00e9 v\u00e1lida.
SEC_ERROR_BAD_PASSWORD=O contrasinal de seguranza introducido non \u00e9 correcto.
SEC_ERROR_RETRY_PASSWORD=Novo contrasinal introducido incorrectamente. Tente de novo.
SEC_ERROR_NO_NODELOCK=biblioteca de seguranza\: sen nodelock.
SEC_ERROR_BAD_DATABASE=biblioteca de seguranza\: base de datos incorrecta.
SEC_ERROR_NO_MEMORY=biblioteca de seguranza\: erro de atribuci\u00f3n de memoria.
SEC_ERROR_UNTRUSTED_ISSUER=O emisor do certificado do elemento do mesmo nivel foi marcado como non fi\u00e1bel polo usuario.
SEC_ERROR_UNTRUSTED_CERT=O certificado do elemento do mesmo nivel foi marcado como non fi\u00e1bel polo usuario.
SEC_ERROR_DUPLICATE_CERT=O certificado xa existe na s\u00faa base de datos.
SEC_ERROR_DUPLICATE_CERT_NAME=O nome do certificado descargado duplica un xa existente na s\u00faa base de datos.
SEC_ERROR_ADDING_CERT=Erro ao engadir o certificado \u00e1 base de datos.
SEC_ERROR_FILING_KEY=Erro ao encher de novo a chave deste certificado.
SEC_ERROR_NO_KEY=A chave privada deste certificado non se pode encontrar na base de datos da chave
SEC_ERROR_CERT_VALID=Este certificado \u00e9 v\u00e1lido.
SEC_ERROR_CERT_NOT_VALID=Este certificado non \u00e9 v\u00e1lido.
SEC_ERROR_CERT_NO_RESPONSE=Bilioteca Cert\: Sen resposta
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=O certificado do emisor do certificado caducou. Verifique a data e hora do  sistema.
SEC_ERROR_CRL_EXPIRED=A CRL do emisor de certificados caducou.  Actualice ou verifique a hora e data do seu sistema.
SEC_ERROR_CRL_BAD_SIGNATURE=A CRL do emisor de certificados ten unha sinatura non v\u00e1lida.
SEC_ERROR_CRL_INVALID=A nova CRL ten un formato incorrecto.
SEC_ERROR_EXTENSION_VALUE_INVALID=O valor da extensi\u00f3n do certificado non \u00e9 v\u00e1lido.
SEC_ERROR_EXTENSION_NOT_FOUND=Extensi\u00f3n do certificado non encontrada.
SEC_ERROR_CA_CERT_INVALID=O certificado do emisor non \u00e9 v\u00e1lido.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=A restrici\u00f3n de lonxitude do cami\u00f1o do certificado non \u00e9 v\u00e1lida.
SEC_ERROR_CERT_USAGES_INVALID=O campo de usos do certificado non \u00e9 v\u00e1lido.
SEC_INTERNAL_ONLY=**M\u00f3dulo ONLY interno**
SEC_ERROR_INVALID_KEY=A chave non \u00e9 compat\u00edbel coa operaci\u00f3n requirida.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=O certificado cont\u00e9n unha extensi\u00f3n cr\u00edtica desco\u00f1ecida.
SEC_ERROR_OLD_CRL=A nova CRL non \u00e9 posterior ao actual.
SEC_ERROR_NO_EMAIL_CERT=Non codificado nin asinado\: A\u00ednda non ten un certificado de correo electr\u00f3nico.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Non codificado\: Non ten certificados para cada un dos destinatarios.
SEC_ERROR_NOT_A_RECIPIENT=Non \u00e9 pos\u00edbel descifrar\: Non \u00e9 un destinatario ou non se encontraron a chave privada e o certificado coincidente.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Non \u00e9 pos\u00edbel descifrar\: O algoritmo de codificaci\u00f3n da chave non coincide co seu certificado.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Erro de verificaci\u00f3n da sinatura\: Non se encontrou asinante, encontr\u00e1ronse demasiados asinantes ou datos danados ou incorrectos.
SEC_ERROR_UNSUPPORTED_KEYALG=Algoritmo de chave desco\u00f1ecido ou incompat\u00edbel.
SEC_ERROR_DECRYPTION_DISALLOWED=Non \u00e9 pos\u00edbel descifrar\: Cifrado usando un algoritmo ou tama\u00f1o de chave non permitido.
XP_SEC_FORTEZZA_BAD_CARD=O cart\u00f3n de Fortezza non se iniciou correctamente.  Elim\u00edneo e dev\u00f3lvao ao seu emisor.
XP_SEC_FORTEZZA_NO_CARD=Non se encontraron cart\u00f3ns de Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=Non se seleccionou ning\u00fan cart\u00f3n de Fortezza
XP_SEC_FORTEZZA_MORE_INFO=Seleccione unha personalidade para obter m\u00e1is informaci\u00f3n en
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Non se encontrou ningunha personalidade
XP_SEC_FORTEZZA_NO_MORE_INFO=Non m\u00e1is informaci\u00f3n sobre esta personalidade
XP_SEC_FORTEZZA_BAD_PIN=Pin non v\u00e1lido
XP_SEC_FORTEZZA_PERSON_ERROR=Non foi pos\u00edbel iniciar as personalidades de Fortezza.
SEC_ERROR_NO_KRL=Non se encontrou ning\u00fan KRL deste certificado de sitio.
SEC_ERROR_KRL_EXPIRED=Caducou o KRL deste certificado de sitio.
SEC_ERROR_KRL_BAD_SIGNATURE=O KRL deste certificado de sitio ten unha sinatura non v\u00e1lida.
SEC_ERROR_REVOKED_KEY=Revogouse a chave deste certificado de sitio.
SEC_ERROR_KRL_INVALID=O novo KRL ten un formato non v\u00e1lido.
SEC_ERROR_NEED_RANDOM=biblioteca de seguranza\: datos aleatorios necesarios.
SEC_ERROR_NO_MODULE=biblioteca de seguranza\: ning\u00fan m\u00f3dulo de seguranza pode executar a operaci\u00f3n requirida.
SEC_ERROR_NO_TOKEN=Ou o cart\u00f3n de seguranza ou chave electr\u00f3nica non existe, ou necesita ser iniciado ou foi eliminado.
SEC_ERROR_READ_ONLY=biblioteca de seguranza\: base de datos s\u00f3 de lectura.
SEC_ERROR_NO_SLOT_SELECTED=Non se seleccionou ningunha ra\u00f1ura nin chave electr\u00f3nica.
SEC_ERROR_CERT_NICKNAME_COLLISION=Xa hai un certificado co mesmo alcume.
SEC_ERROR_KEY_NICKNAME_COLLISION=Xa hai unha chave co mesmo alcume.
SEC_ERROR_SAFE_NOT_CREATED=erro ao crear o obxecto seguro
SEC_ERROR_BAGGAGE_NOT_CREATED=erro ao crear o obxecto de equipaxe
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Non foi pos\u00edbel eliminar o principal
XP_JAVA_DELETE_PRIVILEGE_ERROR=Non foi pos\u00edbel eliminar o privilexio
XP_JAVA_CERT_NOT_EXISTS_ERROR=Este principal non ten un certificado
SEC_ERROR_BAD_EXPORT_ALGORITHM=O algoritmo requirido non est\u00e1 permitido.
SEC_ERROR_EXPORTING_CERTIFICATES=Erro ao tentar exportar certificados.
SEC_ERROR_IMPORTING_CERTIFICATES=Erro ao tentar importar certificados.
SEC_ERROR_PKCS12_DECODING_PFX=Non foi pos\u00edbel importar. Erro de descodificaci\u00f3n. Ficheiro non v\u00e1lido.
SEC_ERROR_PKCS12_INVALID_MAC=Non foi pos\u00edbel importar. MAC non v\u00e1lido. Contrasinal incorrecto ou ficheiro danado.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Non \u00e9 pos\u00edbel importar. Algoritmo de MAC non compat\u00edbel.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Non foi pos\u00edbel importar. S\u00f3 son compat\u00edbeis os modos de privacidade e a integridade do contrasinal.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Non foi pos\u00edbel importar. A estrutura do ficheiro est\u00e1 danada.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Non foi pos\u00edbel importar. Algoritmo de codificaci\u00f3n non compat\u00edbel.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Non foi pos\u00edbel importar. Versi\u00f3n do ficheiro non compat\u00edbel.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Non foi pos\u00edbel importar. Contrasinal de privacidade incorrecto.
SEC_ERROR_PKCS12_CERT_COLLISION=Non foi pos\u00edbel importar.  Ese mesmo alcume xa existe na base de datos.
SEC_ERROR_USER_CANCELLED=O usuario premeu Cancelar.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Non importado, xa est\u00e1 na base de datos.
SEC_ERROR_MESSAGE_SEND_ABORTED=Mensaxe non enviada.
SEC_ERROR_INADEQUATE_KEY_USAGE=Uso inadecuado da chave de certificado para a operaci\u00f3n tentada.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tipo de certificado non aprobado para o aplicativo.
SEC_ERROR_CERT_ADDR_MISMATCH=O enderezo do certificado de sinatura non coincide co enderezo das cabeceiras da mensaxe.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Non foi pos\u00edbel importar. Erro ao tentar importar a chave de privacidade.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Non foi pos\u00edbel importar. Erro ao tentar importar unha serie de certificados.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Non foi pos\u00edbel exportar. Non foi pos\u00edbel localizar o certificado ou a chave polo alcume.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Non foi pos\u00edbel exportar. Non foi pos\u00edbel localizar nin exportar a chave privada.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Non foi pos\u00edbel exportar.  Non foi pos\u00edbel editar o ficheiro de exportaci\u00f3n.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Non foi pos\u00edbel importar. Non foi pos\u00edbel ler o ficheiro de importaci\u00f3n.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Non foi pos\u00edbel exportar. Base de datos da chave danada ou eliminada.
SEC_ERROR_KEYGEN_FAIL=Non foi pos\u00edbel xerar o par de chaves p\u00fablico/privado.
SEC_ERROR_INVALID_PASSWORD=O contrasinal introducido non \u00e9 v\u00e1lido. Seleccione un diferente.
SEC_ERROR_RETRY_OLD_PASSWORD=O contrasinal antigo introduciuse incorrectamente. Tente de novo.
SEC_ERROR_BAD_NICKNAME=O alcume do certificado xa est\u00e1 a ser utilizado.
SEC_ERROR_NOT_FORTEZZA_ISSUER=A serie de FORTEZZA do elemento do mesmo nivel ten un certificado non FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Non \u00e9 pos\u00edbel mover unha chave importante para a ra\u00f1ura onde esta \u00e9 necesaria.
SEC_ERROR_JS_INVALID_MODULE_NAME=Nome do m\u00f3dulo incorrecto.
SEC_ERROR_JS_INVALID_DLL=Nome do ficheiro/cami\u00f1o do m\u00f3dulo non v\u00e1lido
SEC_ERROR_JS_ADD_MOD_FAILURE=Non foi pos\u00edbel engadir o m\u00f3dulo
SEC_ERROR_JS_DEL_MOD_FAILURE=Non foi pos\u00edbel eliminar o m\u00f3dulo
SEC_ERROR_OLD_KRL=O novo KRL non \u00e9 posterior ao actual.
SEC_ERROR_CKL_CONFLICT=O novo CKL ten un emisor diferente ao CKL actual. Elimine o CKL actual.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=A autoridade certificadora deste certificado non ten permitido emitir un certificado con este nome.
SEC_ERROR_KRL_NOT_YET_VALID=A lista de revogaci\u00f3n desta chave a\u00ednda non \u00e9 v\u00e1lida.
SEC_ERROR_CRL_NOT_YET_VALID=A lista de revogaci\u00f3n deste certificado a\u00ednda non \u00e9 v\u00e1lida.
SEC_ERROR_UNKNOWN_CERT=Non foi pos\u00edbel encontrar o certificado requirido.
SEC_ERROR_UNKNOWN_SIGNER=Non foi pos\u00edbel encontrar o certificado do asinante.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=A localizaci\u00f3n do servidor do estado do certificado ten un formato non v\u00e1lido.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Non \u00e9 pos\u00edbel descodificar completamente a resposta de OCSP; esta \u00e9 dun tipo desco\u00f1ecido.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=O servidor de OCSP devolveu datos HTTP incorrectos ou inesperados.
SEC_ERROR_OCSP_MALFORMED_REQUEST=O servidor de OCSP encontrou a solicitude danada ou formada incorrectamente.
SEC_ERROR_OCSP_SERVER_ERROR=O servidor de OCSP experimentou un erro interno.
SEC_ERROR_OCSP_TRY_SERVER_LATER=O servidor de OCSP suxire tentar de novo m\u00e1is tarde.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=O servidor de OCSP require unha sinatura nesta solicitude.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=O servidor de OCSP rexeitou esta solicitude como non autorizada.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=O servidor de OCSP devolveu un estado irreco\u00f1ec\u00edbel.
SEC_ERROR_OCSP_UNKNOWN_CERT=O servidor de OCSP non ten estado para o certificado.
SEC_ERROR_OCSP_NOT_ENABLED=Active OCSP antes de executar esta operaci\u00f3n.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Defina o dispositivo de resposta predefinido de OCSP antes de executar esta operaci\u00f3n.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=A resposta do servidor de OCSP estaba danada ou incorrectamente formada.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=O asinante da resposta de OCSP non est\u00e1 autorizado para dar o estado da este certificado.
SEC_ERROR_OCSP_FUTURE_RESPONSE=A resposta de OCSP a\u00ednda non \u00e9 v\u00e1lida (cont\u00e9n unha data no futuro).
SEC_ERROR_OCSP_OLD_RESPONSE=A resposta de OCSP cont\u00e9n informaci\u00f3n f\u00f3ra de data.
SEC_ERROR_DIGEST_NOT_FOUND=Non se encontrou o resumo de CMS ou PKCS \#7 na mensaxe asinada.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=O tipo de mensaxe de CMS ou PKCS \#7 non \u00e9 compat\u00edbel.
SEC_ERROR_MODULE_STUCK=Non foi pos\u00edbel eliminar o m\u00f3dulo de PKCS \#11 porque contin\u00faa a ser utilizado.
SEC_ERROR_BAD_TEMPLATE=Non foi pos\u00edbel descodificar os datos ASN.1. O modelo especificado non era v\u00e1lido.
SEC_ERROR_CRL_NOT_FOUND=Non se encontrou ning\u00fan CRL coincidente.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Est\u00e1 a tentar importar un certificado coa mesma serie/emisor que un certificado existente, mais ese non \u00e9 o mesmo certificado.
SEC_ERROR_BUSY=Non foi pos\u00edbel pechar NSS. Os obxectos a\u00ednda est\u00e1n a ser utilizados.
SEC_ERROR_EXTRA_INPUT=A mensaxe DER codificada cont\u00e9n datos adicionais sen utilizar.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Curva el\u00edptica non compat\u00edbel.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Formulario de punto de curva el\u00edptica non compat\u00edbel.
SEC_ERROR_UNRECOGNIZED_OID=Identificador de obxecto non reco\u00f1ecido.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Certificado de sinatura de OCSP non v\u00e1lido na resposta de OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Revogouse o certificado na lista de revogaci\u00f3n de certificados do emisor.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=O dispositivo de resposta de OCSP do emisor informa de que o certificado est\u00e1 revogado.
SEC_ERROR_CRL_INVALID_VERSION=A lista de revogaci\u00f3n de certificados do emisor ten un n\u00famero de versi\u00f3n desco\u00f1ecido.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=A lista de revogaci\u00f3n de certificados V1 do emisor ten unha extensi\u00f3n cr\u00edtica.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=A lista de revogaci\u00f3n do certificados V2 do emisor ten unha extensi\u00f3n cr\u00edtica desco\u00f1ecida.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Tipo de obxecto desco\u00f1ecido especificado.
SEC_ERROR_INCOMPATIBLE_PKCS11=O controlador de PKCS \#11 infrinxe a especificaci\u00f3n dun modo incompat\u00edbel.
SEC_ERROR_NO_EVENT=Neste momento, non hai ning\u00fan evento novo dispo\u00f1ible.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL xa existe.
SEC_ERROR_NOT_INITIALIZED=NSS non est\u00e1 iniciado.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=A operaci\u00f3n fallou porque a chave electr\u00f3nica de PKCS\#11 non est\u00e1 rexistrada.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=O certificado do dispositivo de reposta de OCSP configurado non \u00e9 v\u00e1lido.
SEC_ERROR_OCSP_BAD_SIGNATURE=A resposta de OCSP ten unha sinatura inv\u00e1lida.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=A busca da validaci\u00f3n do certificado est\u00e1 fora dos l\u00edmites da mesma
SEC_ERROR_INVALID_POLICY_MAPPING=O mapeo de pol\u00edticas cont\u00e9n anypolicy
SEC_ERROR_POLICY_VALIDATION_FAILED=A cadea de certificados non cumpre a validaci\u00f3n de pol\u00edticas
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Tipo de localizaci\u00f3n desco\u00f1ecida na extensi\u00f3n AIA do certificado
SEC_ERROR_BAD_HTTP_RESPONSE=O servidor devolveu unha resposta HTTP incorrecta
SEC_ERROR_BAD_LDAP_RESPONSE=O servidor devolveu unha resposta LDAP incorrecta
SEC_ERROR_FAILED_TO_ENCODE_DATA=Produciuse un fallo ao codificar os datos co codificador ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Localizaci\u00f3n de acceso da informaci\u00f3n incorrecta na extensi\u00f3n do certificado
SEC_ERROR_LIBPKIX_INTERNAL=Produciuse un erro interno libpkix durante a validaci\u00f3n do certificado.
SEC_ERROR_PKCS11_GENERAL_ERROR=Un m\u00f3dulo PKCS \#11 devolveu CKR_GENERAL_ERROR, indicando que se produciu un erro irrecuper\u00e1bel.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Un m\u00f3dulo PKCS \#11 devolveu CKR_FUNCTION_FAILED, indicando que non foi pos\u00edbel executar a funci\u00f3n solicitada. Tentar de novo a mesma operaci\u00f3n poder\u00eda ter \u00e9xito.
SEC_ERROR_PKCS11_DEVICE_ERROR=Un m\u00f3dulo PKCS \#11 devolveu CKR_DEVICE_ERROR, indicando que se produciu un problema co token ou slot.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=M\u00e9todo de acceso \u00e1 informaci\u00f3n desco\u00f1ecido na extensi\u00f3n do certificado.
SEC_ERROR_CRL_IMPORT_FAILED=Produciuse un erro ao tentar importar un CRL.
SEC_ERROR_EXPIRED_PASSWORD=O contrasinal caducou.
SEC_ERROR_LOCKED_PASSWORD=O contrasinal est\u00e1 protexido.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Erro PKCS \#11 desco\u00f1ecido.
SEC_ERROR_BAD_CRL_DP_URL=URL incorrecto ou incompat\u00edbel no nome do punto de distribuci\u00f3n de CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Firmouse o certificado usando un algoritmo de asinamento que est\u00e1 desactivado porque non \u00e9 seguro.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

