#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=Kh\u00f4ng th\u1ec3 l\u01b0u %S, v\u00ec kh\u00f4ng th\u1ec3 \u0111\u1ecdc t\u1eadp tin ngu\u1ed3n \u0111\u01b0\u1ee3c.\n\nH\u00e3y th\u1eed l\u1ea1i sau, ho\u1eb7c li\u00ean h\u1ec7 qu\u1ea3n tr\u1ecb m\u00e1y ch\u1ee7.
writeError=Kh\u00f4ng th\u1ec3 l\u01b0u %S, v\u00ec m\u1ed9t l\u1ed7i kh\u00f4ng r\u00f5 l\u00ed do \u0111\u00e3 x\u1ea3y ra.\n\nH\u00e3y th\u1eed l\u01b0u v\u00e0o m\u1ed9t n\u01a1i kh\u00e1c.
launchError=Kh\u00f4ng th\u1ec3 m\u1edf %S, v\u00ec m\u1ed9t l\u1ed7i kh\u00f4ng r\u00f5 l\u00ed do \u0111\u00e3 x\u1ea3y ra.\n\nH\u00e3y th\u1eed l\u01b0u v\u00e0o \u1ed5 \u0111\u0129a tr\u01b0\u1edbc r\u1ed3i sau \u0111\u00f3 m\u1edbi m\u1edf t\u1eadp tin.
diskFull=Kh\u00f4ng \u0111\u1ee7 dung l\u01b0\u1ee3ng tr\u1ed1ng tr\u00ean \u1ed5 \u0111\u0129a \u0111\u1ec3 l\u01b0u %S.\n\nX\u00f3a b\u1edbt nh\u1eefng t\u1eadp tin kh\u00f4ng c\u1ea7n thi\u1ebft v\u00e0 th\u1eed l\u1ea1i, ho\u1eb7c l\u01b0u v\u00e0o n\u01a1i kh\u00e1c.
readOnly=Kh\u00f4ng th\u1ec3 l\u01b0u %S, v\u00ec \u1ed5 \u0111\u0129a, th\u01b0 m\u1ee5c, ho\u1eb7c t\u1eadp tin \u0111\u00e3 \u0111\u01b0\u1ee3c b\u1ea3o v\u1ec7 ch\u1ed1ng ghi.\n\nB\u1eadt t\u00ednh n\u0103ng ghi cho \u0111\u0129a v\u00e0 th\u1eed l\u1ea1i, ho\u1eb7c l\u01b0u v\u00e0o n\u01a1i kh\u00e1c.
accessError=Kh\u00f4ng th\u1ec3 l\u01b0u %S, v\u00ec b\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i n\u1ed9i dung c\u1ee7a th\u01b0 m\u1ee5c \u0111\u00f3.\n\nThay \u0111\u1ed5i thu\u1ed9c t\u00ednh c\u1ee7a th\u01b0 m\u1ee5c v\u00e0 th\u1eed l\u1ea1i, ho\u1eb7c l\u01b0u v\u00e0o n\u01a1i kh\u00e1c.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=Kh\u00f4ng th\u1ec3 m\u1edf %S, v\u00ec kh\u00f4ng c\u00f3 ch\u01b0\u01a1ng tr\u00ecnh n\u00e0o \u0111i k\u00e8m v\u1edbi lo\u1ea1i t\u1eadp tin n\u00e0y. Thay \u0111\u1ed5i ch\u01b0\u01a1ng tr\u00ecnh \u0111i k\u00e8m trong t\u00f9y ch\u1ecdn h\u1ec7 th\u1ed1ng c\u1ee7a b\u1ea1n.
noMemory=Kh\u00f4ng \u0111\u1ee7 b\u1ed9 nh\u1edb \u0111\u1ec3 th\u1ef1c hi\u1ec7n l\u1ec7nh b\u1ea1n y\u00eau c\u1ea7u.\n\nH\u00e3y tho\u00e1t v\u00e0i ch\u01b0\u01a1ng tr\u00ecnh kh\u00e1c r\u1ed3i th\u1eed l\u1ea1i.
title=\u0110ang t\u1ea3i xu\u1ed1ng %S
fileAlreadyExistsError=Kh\u00f4ng th\u1ec3 l\u01b0u %S, v\u00ec \u0111\u00e3 t\u1ed3n t\u1ea1i m\u1ed9t t\u1eadp tin c\u00f3 c\u00f9ng t\u00ean v\u1edbi th\u01b0 m\u1ee5c '_files'.\n\nH\u00e3y th\u1eed l\u01b0u v\u00e0o n\u01a1i kh\u00e1c.
fileNameTooLongError=Kh\u00f4ng th\u1ec3 l\u01b0u %S, v\u00ec t\u00ean t\u1eadp tin qu\u00e1 d\u00e0i.\n\nH\u00e3y th\u1eed l\u01b0u v\u1edbi t\u00ean ng\u1eafn h\u01a1n.

