#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=N\u00e3o \u00e9 poss\u00edvel comunicar-se de forma segura. O sistema remoto n\u00e3o suporta criptografia de n\u00edvel alto.
SSL_ERROR_US_ONLY_SERVER=N\u00e3o \u00e9 poss\u00edvel comunicar-se de forma segura. O sistema remoto necessita de criptografia de n\u00edvel alto que n\u00e3o \u00e9 suportada.
SSL_ERROR_NO_CYPHER_OVERLAP=N\u00e3o foi poss\u00edvel comunicar-se de forma segura com o sistema remoto\: n\u00e3o h\u00e1 algoritmos de criptografia em comum.
SSL_ERROR_NO_CERTIFICATE=N\u00e3o foi poss\u00edvel encontrar o certificado ou chave necess\u00e1rios \u00e0 autentica\u00e7\u00e3o.
SSL_ERROR_BAD_CERTIFICATE=N\u00e3o \u00e9 poss\u00edvel comunicar-se de forma segura com o sistema remoto\: o certificado do sistema remoto foi rejeitado.
SSL_ERROR_UNUSED_5=C\u00f3digo de erro SSL n\u00e3o reconhecido.
SSL_ERROR_BAD_CLIENT=O servidor encontrou dados defeituosos do cliente.
SSL_ERROR_BAD_SERVER=O cliente encontrou dados defeituosos do servidor.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Tipo de certificado n\u00e3o suportado.
SSL_ERROR_UNSUPPORTED_VERSION=O sistema remoto usa uma vers\u00e3o n\u00e3o suportada do protocolo de seguran\u00e7a.
SSL_ERROR_UNUSED_10=C\u00f3digo de erro SSL n\u00e3o reconhecido.
SSL_ERROR_WRONG_CERTIFICATE=Falha na autentica\u00e7\u00e3o do cliente\: a chave privada no banco de dados de chaves n\u00e3o corresponde \u00e0 chave p\u00fablica no banco de dados de certificados.
SSL_ERROR_BAD_CERT_DOMAIN=N\u00e3o \u00e9 poss\u00edvel comunicar-se de forma segura com o sistema remoto\: o nome de dom\u00ednio solicitado n\u00e3o corresponde ao certificado do servidor.
SSL_ERROR_POST_WARNING=C\u00f3digo de erro SSL n\u00e3o reconhecido.
SSL_ERROR_SSL2_DISABLED=O sistema remoto suporta somente SSL vers\u00e3o 2, que est\u00e1 desativada localmente.
SSL_ERROR_BAD_MAC_READ=O SSL recebeu um registro com \u201cMessage Authentication Code\u201d incorreto.
SSL_ERROR_BAD_MAC_ALERT=O sistema remoto SSL informa \u201cMessage Authentication Code\u201d incorreto.
SSL_ERROR_BAD_CERT_ALERT=O sistema remoto SSL n\u00e3o p\u00f4de comprovar a homologa\u00e7\u00e3o do seu certificado.
SSL_ERROR_REVOKED_CERT_ALERT=O sistema remoto SSL rejeitou seu certificado por consider\u00e1-lo revogado.
SSL_ERROR_EXPIRED_CERT_ALERT=O sistema remoto SSL rejeitou seu certificado por consider\u00e1-lo com a validade vencida.
SSL_ERROR_SSL_DISABLED=N\u00e3o \u00e9 poss\u00edvel conectar-se\: o SSL est\u00e1 desativado.
SSL_ERROR_FORTEZZA_PQG=N\u00e3o \u00e9 poss\u00edvel conectar-se\: o sistema remoto SSL est\u00e1 em outro dom\u00ednio FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Um conjunto de c\u00f3digos SSL desconhecido foi solicitado.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Nenhum conjunto de c\u00f3digos de criptografia est\u00e1 presente e ativo neste aplicativo.
SSL_ERROR_BAD_BLOCK_PADDING=SSL received a record with bad block padding.
SSL_ERROR_RX_RECORD_TOO_LONG=O SSL recebeu um registro que excedia o comprimento m\u00e1ximo permitido.
SSL_ERROR_TX_RECORD_TOO_LONG=O SSL tentou enviar um registro que excedia o comprimento m\u00e1ximo permitido.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=O SSL recebeu uma mensagem \u201cHello Request\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=O SSL recebeu uma mensagem \u201cClient Hello\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=O SSL recebeu uma mensagem \u201cServer Hello\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=O SSL recebeu uma mensagem \u201cCertificate\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=O SSL recebeu uma mensagem \u201cServer Key Exchange\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=O SSL recebeu uma mensagem \u201cCertificate Request\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=O SSL recebeu uma mensagem \u201cServer Hello Done\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=O SSL recebeu uma mensagem \u201cCertificate Verify\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=O SSL recebeu uma mensagem \u201cClient Key Exchange\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_FINISHED=O SSL recebeu uma mensagem \u201cFinished\u201d defeituosa no processo de handshake.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=O SSL recebeu um registro \u201cChange Cipher Spec\u201d defeituoso.
SSL_ERROR_RX_MALFORMED_ALERT=O SSL recebeu um registro \u201cAlert\u201d defeituoso.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=O SSL recebeu um registro defeituoso \u201cHandshake\u201d.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=O SSL recebeu um registro \u201cApplication Data\u201d defeituoso.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=O SSL recebeu uma mensagem \u201cHello Request\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=O SSL recebeu uma mensagem \u201cClient Hello\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=O SSL recebeu uma mensagem \u201cServer Hello\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=O SSL recebeu uma mensagem \u201cCertificate\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=O SSL recebeu uma mensagem \u201cServer Key Exchange\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=O SSL recebeu uma mensagem \u201cCertificate Request\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=O SSL recebeu uma mensagem \u201cServer Hello Done\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=O SSL recebeu uma mensagem \u201cCertificate Verify\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=O SSL recebeu uma mensagem \u201cClient Key Exchange\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_FINISHED=O SSL recebeu uma mensagem \u201cFinished\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=O SSL recebeu um registro \u201cChange Cipher Spec\u201d n\u00e3o esperado.
SSL_ERROR_RX_UNEXPECTED_ALERT=O SSL recebeu um registro \u201cAlert\u201d n\u00e3o esperado.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=O SSL recebeu um registro \u201cHandshake\u201d n\u00e3o esperado.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=O SSL recebeu um registro \u201cApplication Data\u201d n\u00e3o esperado.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=O SSL recebeu um registro com um tipo de conte\u00fado desconhecido.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=O SSL recebeu uma mensagem do processo de handshake com um tipo de mensagem desconhecido.
SSL_ERROR_RX_UNKNOWN_ALERT=O SSL recebeu um registro alert com uma descri\u00e7\u00e3o alert desconhecida.
SSL_ERROR_CLOSE_NOTIFY_ALERT=O sistema remoto SSL fechou esta conex\u00e3o.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=O sistema remoto SSL n\u00e3o esperava uma mensagem do processo de handshake que recebeu.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=O sistema remoto SSL n\u00e3o conseguiu descompactar com \u00eaxito um registro SSL que recebeu.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=O sistema remoto SSL n\u00e3o conseguiu negociar um conjunto aceit\u00e1vel de par\u00e2metros de seguran\u00e7a.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=O sistema remoto SSL rejeitou uma mensagem do processo de handshake devido a conte\u00fado n\u00e3o aceit\u00e1vel.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=O sistema remoto SSL n\u00e3o suporta certificados do tipo que recebeu.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=O sistema remoto SSL teve um problema n\u00e3o especificado com o certificado que recebeu.
SSL_ERROR_GENERATE_RANDOM_FAILURE=O SSL sofreu uma falha em seu gerador de n\u00fameros aleat\u00f3rios.
SSL_ERROR_SIGN_HASHES_FAILURE=N\u00e3o foi poss\u00edvel assinar digitalmente os dados necess\u00e1rios para comprovar seu certificado.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=O SSL n\u00e3o conseguiu extrair a chave p\u00fablica do certificado sistema remoto.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Falha n\u00e3o especificada durante o processo de handshake SSL Server Key Exchange.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Falha n\u00e3o especificada durante o processo de handshake SSL Client Key Exchange.
SSL_ERROR_ENCRYPTION_FAILURE=O algoritmo de criptografia de grande volume de dados falhou para o conjunto de c\u00f3digos selecionado.
SSL_ERROR_DECRYPTION_FAILURE=O algoritmo de descriptografia de grande volume de dados falhou para o conjunto de c\u00f3digos selecionado.
SSL_ERROR_SOCKET_WRITE_FAILURE=Falha na tentativa de escrever dados criptografados para o socket base.
SSL_ERROR_MD5_DIGEST_FAILURE=Fun\u00e7\u00e3o de digest MD5 malsucedida.
SSL_ERROR_SHA_DIGEST_FAILURE=Fun\u00e7\u00e3o de digest SHA-1 malsucedida.
SSL_ERROR_MAC_COMPUTATION_FAILURE=C\u00e1lculo MAC malsucedido.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Falha ao criar contexto de chave sim\u00e9trica.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Failure to unwrap the Symmetric key in Client Key Exchange message.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=O servidor SSL tentou usar uma chave p\u00fablica de n\u00edvel dom\u00e9stico com um conjunto de c\u00f3digos de criptografia de exporta\u00e7\u00e3o.
SSL_ERROR_IV_PARAM_FAILURE=PKCS11 code failed to translate an IV into a param.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Falha na inicializa\u00e7\u00e3o do conjunto de c\u00f3digos de criptografia selecionado.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=O cliente n\u00e3o conseguiu gerar chaves de sess\u00e3o para a sess\u00e3o SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=O servidor n\u00e3o tem uma chave para o algoritmo de troca de chaves empreendido.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=O token PKCS\#11 foi inserido ou removido enquanto a opera\u00e7\u00e3o estava em andamento.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Nenhum token PKCS\#11 p\u00f4de ser encontrado para efetuar a opera\u00e7\u00e3o requisitada.
SSL_ERROR_NO_COMPRESSION_OVERLAP=N\u00e3o foi poss\u00edvel comunicar-se de forma segura com o sistema remoto\: n\u00e3o h\u00e1 algoritmos de compacta\u00e7\u00e3o em comum.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=N\u00e3o \u00e9 poss\u00edvel iniciar outro processo de handshake SSL at\u00e9 que o processo de handshake atual seja conclu\u00eddo.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Recebidos do sistema remoto valores incorretos do hash do processo de handshake.
SSL_ERROR_CERT_KEA_MISMATCH=O certificado fornecido n\u00e3o pode ser usado com o algoritmo de troca de chaves selecionado.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Nenhuma autoridade certificadora \u00e9 considerada confi\u00e1vel para a autentica\u00e7\u00e3o SSL do cliente.
SSL_ERROR_SESSION_NOT_FOUND=ID da sess\u00e3o SSL do cliente n\u00e3o encontrado no cache da sess\u00e3o do servidor.
SSL_ERROR_DECRYPTION_FAILED_ALERT=O sistema remoto n\u00e3o conseguiu descriptografar um registro SSL que recebeu.
SSL_ERROR_RECORD_OVERFLOW_ALERT=O sistema remoto recebeu um registro SSL que era mais longo que o permitido.
SSL_ERROR_UNKNOWN_CA_ALERT=O sistema remoto n\u00e3o reconhece e n\u00e3o considera confi\u00e1vel a CA que expediu o seu certificado.
SSL_ERROR_ACCESS_DENIED_ALERT=O sistema remoto recebeu um certificado v\u00e1lido, mas o acesso foi negado.
SSL_ERROR_DECODE_ERROR_ALERT=O sistema remoto n\u00e3o conseguiu decodificar uma mensagem do processo de handshake SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=O sistema remoto informa falha na verifica\u00e7\u00e3o de assinatura ou na troca de chaves.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=O sistema remoto informa que a negocia\u00e7\u00e3o n\u00e3o est\u00e1 em conformidade com os regulamentos de exporta\u00e7\u00e3o.
SSL_ERROR_PROTOCOL_VERSION_ALERT=O sistema remoto informa vers\u00e3o de protocolo n\u00e3o suportada ou incompat\u00edvel.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=O servidor exige c\u00f3digos de criptografia mais seguros que os suportados pelo cliente.
SSL_ERROR_INTERNAL_ERROR_ALERT=O sistema remoto informa que sofreu um erro interno.
SSL_ERROR_USER_CANCELED_ALERT=O usu\u00e1rio do sistema remoto cancelou o processo de handshake.
SSL_ERROR_NO_RENEGOTIATION_ALERT=O sistema remoto n\u00e3o permite renegocia\u00e7\u00e3o dos par\u00e2metros de seguran\u00e7a SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Cache do servidor SSL n\u00e3o configurado e n\u00e3o desativado para este socket.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=O sistema remoto SSL n\u00e3o suporta a extens\u00e3o solicitada TLS hello.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=O sistema remoto SSL n\u00e3o p\u00f4de obter o seu certificado pela URL fornecida.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=O sistema remoto SSL n\u00e3o possui certificado para o nome de DNS solicitado.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=O sistema remoto SSL n\u00e3o conseguiu obter uma resposta OCSP para o certificado dele.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=O sistema remoto SSL reportou valor incorreto do hash do certificado.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=O SSL recebeu uma mensagem \u201cNew Session Ticket\u201d n\u00e3o esperada no processo de handshake.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=O SSL recebeu uma mensagem \u201cNew Session Ticket\u201d defeituosa no processo de handshake.
SSL_ERROR_DECOMPRESSION_FAILURE=O SSL recebeu um registro compactado que n\u00e3o pode ser descompactado.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Renegocia\u00e7\u00e3o n\u00e3o \u00e9 permitida neste socket SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=Peer attempted old style (potentially vulnerable) handshake.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=O SSL recebeu um registro descompactado n\u00e3o esperado.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL received a weak ephemeral Diffie-Hellman key in Server Key Exchange handshake message.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL received invalid NPN extension data.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Recurso do SSL n\u00e3o suportado em conex\u00f5es SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Recurso do SSL n\u00e3o suportado em servidores.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Recurso do SSL n\u00e3o suportado em clientes.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Ocorreu um erro de I/O durante a autoriza\u00e7\u00e3o de seguran\u00e7a.
SEC_ERROR_LIBRARY_FAILURE=falha na biblioteca de seguran\u00e7a.
SEC_ERROR_BAD_DATA=biblioteca de seguran\u00e7a\: recebidos dados incorretos.
SEC_ERROR_OUTPUT_LEN=biblioteca de seguran\u00e7a\: erro de comprimento da sa\u00edda.
SEC_ERROR_INPUT_LEN=a biblioteca de seguran\u00e7a sofreu um erro de comprimento da entrada.
SEC_ERROR_INVALID_ARGS=biblioteca de seguran\u00e7a\: argumentos inv\u00e1lidos.
SEC_ERROR_INVALID_ALGORITHM=biblioteca de seguran\u00e7a\: algoritmo inv\u00e1lido.
SEC_ERROR_INVALID_AVA=biblioteca de seguran\u00e7a\: AVA inv\u00e1lido.
SEC_ERROR_INVALID_TIME=String de hora formatada incorretamente.
SEC_ERROR_BAD_DER=biblioteca de seguran\u00e7a\: mensagem codificada com DER formatada incorretamente.
SEC_ERROR_BAD_SIGNATURE=O certificado do sistema remoto possui uma assinatura inv\u00e1lida.
SEC_ERROR_EXPIRED_CERTIFICATE=O certificado do sistema remoto est\u00e1 com a validade vencida.
SEC_ERROR_REVOKED_CERTIFICATE=O certificado do sistema remoto foi revogado.
SEC_ERROR_UNKNOWN_ISSUER=O expedidor do certificado do sistema remoto n\u00e3o \u00e9 reconhecido.
SEC_ERROR_BAD_KEY=A chave p\u00fablica do sistema remoto \u00e9 inv\u00e1lida.
SEC_ERROR_BAD_PASSWORD=A senha de seguran\u00e7a fornecida est\u00e1 incorreta.
SEC_ERROR_RETRY_PASSWORD=Nova senha fornecida incorretamente. Por favor, tente de novo.
SEC_ERROR_NO_NODELOCK=biblioteca de seguran\u00e7a\: no nodelock.
SEC_ERROR_BAD_DATABASE=biblioteca de seguran\u00e7a\: banco de dados defeituoso.
SEC_ERROR_NO_MEMORY=biblioteca de seguran\u00e7a\: falha na aloca\u00e7\u00e3o de mem\u00f3ria.
SEC_ERROR_UNTRUSTED_ISSUER=O expedidor do certificado do sistema remoto foi marcado pelo usu\u00e1rio como n\u00e3o confi\u00e1vel.
SEC_ERROR_UNTRUSTED_CERT=O certificado do sistema remoto foi marcado pelo usu\u00e1rio como n\u00e3o confi\u00e1vel.
SEC_ERROR_DUPLICATE_CERT=O certificado j\u00e1 existe no seu banco de dados.
SEC_ERROR_DUPLICATE_CERT_NAME=O nome do certificado recebido \u00e9 igual a um existente no seu banco de dados.
SEC_ERROR_ADDING_CERT=Erro ao adicionar certificado no banco de dados.
SEC_ERROR_FILING_KEY=Error refiling the key for this certificate.
SEC_ERROR_NO_KEY=A chave privada deste certificado n\u00e3o p\u00f4de ser encontrada no banco de dados de chaves
SEC_ERROR_CERT_VALID=Este certificado \u00e9 v\u00e1lido.
SEC_ERROR_CERT_NOT_VALID=Este certificado n\u00e3o \u00e9 v\u00e1lido.
SEC_ERROR_CERT_NO_RESPONSE=Biblioteca de certificados\: sem resposta
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=O certificado do expedidor do certificado est\u00e1 com a validade vencida. Verifique a data e hora do sistema.
SEC_ERROR_CRL_EXPIRED=A CRL para o expedidor do certificado est\u00e1 com a validade vencida. Atualize-a ou verifique a data e hora do seu sistema.
SEC_ERROR_CRL_BAD_SIGNATURE=A CRL para o expedidor do certificado possui uma assinatura inv\u00e1lida.
SEC_ERROR_CRL_INVALID=A nova CRL possui um formato inv\u00e1lido.
SEC_ERROR_EXTENSION_VALUE_INVALID=O valor da extens\u00e3o de certificado \u00e9 inv\u00e1lido.
SEC_ERROR_EXTENSION_NOT_FOUND=Extens\u00e3o de certificado n\u00e3o encontrada.
SEC_ERROR_CA_CERT_INVALID=O certificado do expedidor \u00e9 inv\u00e1lido.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=A restri\u00e7\u00e3o de comprimento do caminho do certificado \u00e9 inv\u00e1lida.
SEC_ERROR_CERT_USAGES_INVALID=O campo usos do certificado \u00e9 inv\u00e1lido.
SEC_INTERNAL_ONLY=**M\u00f3dulo EXCLUSIVAMENTE interno**
SEC_ERROR_INVALID_KEY=A chave n\u00e3o suporta a opera\u00e7\u00e3o solicitada.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=O certificado cont\u00e9m uma extens\u00e3o obrigat\u00f3ria desconhecida.
SEC_ERROR_OLD_CRL=A nova CRL n\u00e3o \u00e9 mais recente que a utilizada no momento.
SEC_ERROR_NO_EMAIL_CERT=N\u00e3o criptografado ou assinado\: voc\u00ea ainda n\u00e3o possui um certificado de email.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=N\u00e3o criptografado\: voc\u00ea n\u00e3o possui certificados para cada um dos destinat\u00e1rios.
SEC_ERROR_NOT_A_RECIPIENT=N\u00e3o \u00e9 poss\u00edvel descriptografar\: voc\u00ea n\u00e3o \u00e9 o destinat\u00e1rio ou certificado correspondente e chave privada n\u00e3o encontrados.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=N\u00e3o \u00e9 poss\u00edvel descriptografar\: a chave de criptografia n\u00e3o confere com a do seu certificado.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Falha na verifica\u00e7\u00e3o de assinatura\: nenhum signat\u00e1rio encontrado, muitos signat\u00e1rios encontrados ou dados corrompidos ou incorretos.
SEC_ERROR_UNSUPPORTED_KEYALG=Algoritmo de chave desconhecido ou n\u00e3o suportado.
SEC_ERROR_DECRYPTION_DISALLOWED=N\u00e3o \u00e9 poss\u00edvel descriptografar\: criptografado usando um algoritmo ou tamanho de chave desaprovado.
XP_SEC_FORTEZZA_BAD_CARD=O cart\u00e3o Fortezza n\u00e3o foi inicializado corretamente. Por favor, remova-o e devolva para o expedidor.
XP_SEC_FORTEZZA_NO_CARD=Nenhum cart\u00e3o Fortezza encontrado
XP_SEC_FORTEZZA_NONE_SELECTED=Nenhum cart\u00e3o Fortezza selecionado
XP_SEC_FORTEZZA_MORE_INFO=Por favor, selecione uma identidade para obter mais informa\u00e7\u00f5es
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Identidade n\u00e3o encontrada
XP_SEC_FORTEZZA_NO_MORE_INFO=N\u00e3o h\u00e1 mais informa\u00e7\u00f5es sobre a identidade
XP_SEC_FORTEZZA_BAD_PIN=Pin inv\u00e1lido
XP_SEC_FORTEZZA_PERSON_ERROR=N\u00e3o foi poss\u00edvel inicializar as identidades Fortezza.
SEC_ERROR_NO_KRL=Nenhuma KRL para o certificado deste site foi encontrada.
SEC_ERROR_KRL_EXPIRED=A validade da KRL para o certificado deste site est\u00e1 vencida.
SEC_ERROR_KRL_BAD_SIGNATURE=A validade da KRL para o certificado deste site possui uma assinatura inv\u00e1lida.
SEC_ERROR_REVOKED_KEY=A chave para o certificado deste site foi revogada.
SEC_ERROR_KRL_INVALID=O novo KRL possui um formato inv\u00e1lido.
SEC_ERROR_NEED_RANDOM=biblioteca de seguran\u00e7a\: s\u00e3o necess\u00e1rios dados aleat\u00f3rios.
SEC_ERROR_NO_MODULE=biblioteca de seguran\u00e7a\: nenhum m\u00f3dulo de seguran\u00e7a pode efetuar a opera\u00e7\u00e3o solicitada.
SEC_ERROR_NO_TOKEN=O cart\u00e3o de seguran\u00e7a ou token n\u00e3o existe, precisa ser inicializado ou foi removido.
SEC_ERROR_READ_ONLY=biblioteca de seguran\u00e7a\: banco de dados somente para leitura.
SEC_ERROR_NO_SLOT_SELECTED=Nenhum slot ou token foi selecionado.
SEC_ERROR_CERT_NICKNAME_COLLISION=Um certificado com o mesmo nickname j\u00e1 existe.
SEC_ERROR_KEY_NICKNAME_COLLISION=Uma chave com o mesmo nickname j\u00e1 existe.
SEC_ERROR_SAFE_NOT_CREATED=error while creating safe object
SEC_ERROR_BAGGAGE_NOT_CREATED=error while creating baggage object
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Couldn't remove the principal
XP_JAVA_DELETE_PRIVILEGE_ERROR=N\u00e3o foi poss\u00edvel excluir o direito
XP_JAVA_CERT_NOT_EXISTS_ERROR=This principal doesn't have a certificate
SEC_ERROR_BAD_EXPORT_ALGORITHM=O algoritmo necess\u00e1rio n\u00e3o \u00e9 permitido.
SEC_ERROR_EXPORTING_CERTIFICATES=Erro ao tentar exportar certificados.
SEC_ERROR_IMPORTING_CERTIFICATES=Erro ao tentar importar certificados.
SEC_ERROR_PKCS12_DECODING_PFX=N\u00e3o foi poss\u00edvel importar. Erro de decodifica\u00e7\u00e3o. Arquivo n\u00e3o encontrado.
SEC_ERROR_PKCS12_INVALID_MAC=N\u00e3o foi poss\u00edvel importar. MAC inv\u00e1lido. Senha incorreta ou arquivo corrompido.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=N\u00e3o foi poss\u00edvel importar. Algoritmo MAC n\u00e3o suportado.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=N\u00e3o foi poss\u00edvel importar. Suportados somente modo de integridade de senha e modo de privacidade.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=N\u00e3o foi poss\u00edvel importar. A estrutura do arquivo est\u00e1 corrompida.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=N\u00e3o foi poss\u00edvel importar. Algoritmo de criptografia n\u00e3o suportado.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=N\u00e3o foi poss\u00edvel importar. Vers\u00e3o do arquivo n\u00e3o suportada.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=N\u00e3o foi poss\u00edvel importar. Senha de privacidade incorreta.
SEC_ERROR_PKCS12_CERT_COLLISION=N\u00e3o foi poss\u00edvel importar. O mesmo nickname j\u00e1 existe no banco de dados.
SEC_ERROR_USER_CANCELLED=O usu\u00e1rio pressionou cancelar.
SEC_ERROR_PKCS12_DUPLICATE_DATA=N\u00e3o importado, j\u00e1 existe no banco de dados.
SEC_ERROR_MESSAGE_SEND_ABORTED=Mensagem n\u00e3o enviada.
SEC_ERROR_INADEQUATE_KEY_USAGE=Usos da chave do certificado inadequados para a opera\u00e7\u00e3o empreendida.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tipo de certificado n\u00e3o aprovado para o aplicativo.
SEC_ERROR_CERT_ADDR_MISMATCH=Endere\u00e7o no certificado de assinatura n\u00e3o corresponde ao endere\u00e7o do cabe\u00e7alho da mensagem.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=N\u00e3o foi poss\u00edvel importar. Erro ao tentar importar a chave privada.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=N\u00e3o foi poss\u00edvel importar. Erro ao tentar importar a cadeia de certificados.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=N\u00e3o foi poss\u00edvel exportar. N\u00e3o foi poss\u00edvel encontrar certificado ou chave pelo nickname.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=N\u00e3o foi poss\u00edvel exportar. Chave privada n\u00e3o p\u00f4de ser encontrada e exportada.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=N\u00e3o foi poss\u00edvel exportar. N\u00e3o foi poss\u00edvel escrever o arquivo de exporta\u00e7\u00e3o.
SEC_ERROR_PKCS12_UNABLE_TO_READ=N\u00e3o foi poss\u00edvel importar. N\u00e3o foi poss\u00edvel ler o arquivo a importar.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=N\u00e3o foi poss\u00edvel exportar. Banco de dados de chaves corrompido ou exclu\u00eddo.
SEC_ERROR_KEYGEN_FAIL=N\u00e3o foi poss\u00edvel gerar o par de chaves p\u00fablica/privada.
SEC_ERROR_INVALID_PASSWORD=A senha fornecida \u00e9 inv\u00e1lida. Por favor, selecione uma diferente.
SEC_ERROR_RETRY_OLD_PASSWORD=Senha atual fornecida incorretamente. Por favor, tente de novo.
SEC_ERROR_BAD_NICKNAME=O nickname do certificado j\u00e1 est\u00e1 em uso.
SEC_ERROR_NOT_FORTEZZA_ISSUER=A cadeia FORTEZZA do sistema remoto possui um certificado n\u00e3o FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Uma chave confidencial n\u00e3o p\u00f4de ser movida para o slot onde era necess\u00e1ria.
SEC_ERROR_JS_INVALID_MODULE_NAME=Nome do m\u00f3dulo inv\u00e1lido.
SEC_ERROR_JS_INVALID_DLL=Caminho ou nome do arquivo do m\u00f3dulo inv\u00e1lido
SEC_ERROR_JS_ADD_MOD_FAILURE=N\u00e3o foi poss\u00edvel adicionar o m\u00f3dulo
SEC_ERROR_JS_DEL_MOD_FAILURE=N\u00e3o foi poss\u00edvel excluir o m\u00f3dulo
SEC_ERROR_OLD_KRL=A nova KRL n\u00e3o \u00e9 mais recente que a atual.
SEC_ERROR_CKL_CONFLICT=A nova CKL possui um expedidor diferente da CKL atual. Exclua a CKL atual.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=A Autoridade de Certifica\u00e7\u00e3o deste certificado n\u00e3o permite expedir um certificado com este nome.
SEC_ERROR_KRL_NOT_YET_VALID=A lista de chaves revogadas para este certificado ainda n\u00e3o \u00e9 v\u00e1lida.
SEC_ERROR_CRL_NOT_YET_VALID=A lista de certificados revogados para este certificado ainda n\u00e3o \u00e9 v\u00e1lida.
SEC_ERROR_UNKNOWN_CERT=O certificado solicitado n\u00e3o p\u00f4de ser encontrado.
SEC_ERROR_UNKNOWN_SIGNER=O certificado do signat\u00e1rio n\u00e3o p\u00f4de ser encontrado.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=O endere\u00e7o do servidor de status de certificado possui um formato inv\u00e1lido.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=A resposta OCSP n\u00e3o p\u00f4de ser totalmente decodificada; \u00e9 de um tipo desconhecido.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=O servidor OCSP retornou dados HTTP n\u00e3o esperados ou inv\u00e1lidos.
SEC_ERROR_OCSP_MALFORMED_REQUEST=O servidor OCSP considerou que o pedido estava corrompido ou formatado incorretamente.
SEC_ERROR_OCSP_SERVER_ERROR=O servidor OCSP sofreu um erro interno.
SEC_ERROR_OCSP_TRY_SERVER_LATER=O servidor OCSP sugere tentar de novo mais tarde.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=O servidor OCSP necessita de uma assinatura para este pedido.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=O servidor OCSP recusou este pedido pois n\u00e3o possui autoriza\u00e7\u00e3o.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=O servidor OCSP retornou um status n\u00e3o reconhecido.
SEC_ERROR_OCSP_UNKNOWN_CERT=O servidor OCSP n\u00e3o possui o status deste certificado.
SEC_ERROR_OCSP_NOT_ENABLED=Voc\u00ea precisa ativar o OCSP antes de efetuar esta opera\u00e7\u00e3o.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Voc\u00ea deve definir um servidor OCSP padr\u00e3o antes de efetuar esta opera\u00e7\u00e3o.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=A resposta do servidor OCSP estava corrompida ou formatada incorretamente.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=O signat\u00e1rio da resposta OCSP n\u00e3o est\u00e1 autorizado a dar o status deste certificado.
SEC_ERROR_OCSP_FUTURE_RESPONSE=A resposta OCSP ainda n\u00e3o \u00e9 v\u00e1lida (cont\u00e9m uma data futura).
SEC_ERROR_OCSP_OLD_RESPONSE=A resposta OCSP cont\u00e9m informa\u00e7\u00f5es desatualizadas.
SEC_ERROR_DIGEST_NOT_FOUND=O digest CMS ou PKCS \#7 n\u00e3o foi encontrado na mensagem assinada.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=O tipo de mensagem CMS ou PKCS \#7 n\u00e3o \u00e9 suportado.
SEC_ERROR_MODULE_STUCK=M\u00f3dulo PKCS \#11 n\u00e3o pode ser exclu\u00eddo porque ainda est\u00e1 em uso.
SEC_ERROR_BAD_TEMPLATE=N\u00e3o foi poss\u00edvel decodificar os dados ASN.1. O modelo especificado era inv\u00e1lido.
SEC_ERROR_CRL_NOT_FOUND=Nenhuma CRL foi encontrada.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Voc\u00ea est\u00e1 tentando importar um cert com o mesmo expedidor/serial de um cert existente, mas que n\u00e3o \u00e9 o mesmo cert.
SEC_ERROR_BUSY=O NSS n\u00e3o p\u00f4de ser desligado. Objetos ainda est\u00e3o em uso.
SEC_ERROR_EXTRA_INPUT=A mensagem codificada com DER continha dados n\u00e3o usados extras.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Curva el\u00edptica n\u00e3o suportada.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Forma do ponto da curva el\u00edptica n\u00e3o suportada.
SEC_ERROR_UNRECOGNIZED_OID=Identificador de objeto n\u00e3o reconhecido.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Certificado de assinatura OCSP inv\u00e1lido na resposta OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=O certificado est\u00e1 revogado na lista de certificados revogados do expedidor.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=O servidor OCSP do expedidor informa que o certificado est\u00e1 revogado.
SEC_ERROR_CRL_INVALID_VERSION=A Lista de Certificados Revogados do expedidor possui um n\u00famero de vers\u00e3o desconhecido.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=A Lista de Certificados Revogados V1 do expedidor possui uma extens\u00e3o obrigat\u00f3ria.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=A Lista de Certificados Revogados V2 do expedidor possui uma extens\u00e3o obrigat\u00f3ria desconhecida.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Tipo de objeto desconhecido especificado.
SEC_ERROR_INCOMPATIBLE_PKCS11=O driver PKCS \#11 viola a especifica\u00e7\u00e3o de uma forma incompat\u00edvel.
SEC_ERROR_NO_EVENT=No new slot event is available at this time.
SEC_ERROR_CRL_ALREADY_EXISTS=A CRL j\u00e1 existe.
SEC_ERROR_NOT_INITIALIZED=NSS n\u00e3o est\u00e1 inicializado.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=A opera\u00e7\u00e3o falhou porque o token PKCS\#11 n\u00e3o identificou-se (login).
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=O certificado do servidor OCSP configurado \u00e9 inv\u00e1lido.
SEC_ERROR_OCSP_BAD_SIGNATURE=A resposta OCSP possui uma assinatura inv\u00e1lida.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Cert validation search is out of search limits
SEC_ERROR_INVALID_POLICY_MAPPING=Policy mapping contains anypolicy
SEC_ERROR_POLICY_VALIDATION_FAILED=Cert chain fails policy validation
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Unknown location type in cert AIA extension
SEC_ERROR_BAD_HTTP_RESPONSE=O servidor retornou uma resposta HTTP incorreta
SEC_ERROR_BAD_LDAP_RESPONSE=O servidor retornou uma resposta LDAP incorreta
SEC_ERROR_FAILED_TO_ENCODE_DATA=Failed to encode data with ASN1 encoder
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Bad information access location in cert extension
SEC_ERROR_LIBPKIX_INTERNAL=Erro interno do Libpkix ocorreu durante a valida\u00e7\u00e3o do certificado.
SEC_ERROR_PKCS11_GENERAL_ERROR=A PKCS \#11 module returned CKR_GENERAL_ERROR, indicating that an unrecoverable error has occurred.
SEC_ERROR_PKCS11_FUNCTION_FAILED=A PKCS \#11 module returned CKR_FUNCTION_FAILED, indicating that the requested function could not be performed.  Trying the same operation again might succeed.
SEC_ERROR_PKCS11_DEVICE_ERROR=A PKCS \#11 module returned CKR_DEVICE_ERROR, indicating that a problem has occurred with the token or slot.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Unknown information access method in certificate extension.
SEC_ERROR_CRL_IMPORT_FAILED=Erro ao tentar importar uma CRL.
SEC_ERROR_EXPIRED_PASSWORD=A senha perdeu a validade.
SEC_ERROR_LOCKED_PASSWORD=A senha est\u00e1 travada.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Erro PKCS \#11 n\u00e3o conhecido.
SEC_ERROR_BAD_CRL_DP_URL=URL inv\u00e1lida ou n\u00e3o suportada no nome do ponto de distribui\u00e7\u00e3o da CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=O certificado foi assinado usando um algoritmo de assinatura que est\u00e1 desativado porque n\u00e3o \u00e9 seguro.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

