#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL \u0cb8\u0cb0\u0cbf\u0caf\u0cbe\u0ca6\u0cc1\u0ca6\u0cb2\u0ccd\u0cb2 \u0cb9\u0cbe\u0c97\u0cc1 \u0cb2\u0ccb\u0ca1\u0ccd \u0cae\u0cbe\u0ca1\u0cb2\u0cbe\u0c97\u0cc1\u0cb5\u0cc1\u0ca6\u0cbf\u0cb2\u0ccd\u0cb2.
fileNotFound=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d \u0c97\u0cc6 %S \u0ca8\u0cb2\u0ccd\u0cb2\u0cbf \u0c95\u0ca1\u0ca4\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb9\u0cc1\u0ca1\u0cc1\u0c95\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2
dnsNotFound=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d \u0c97\u0cc6 %S \u0ca8\u0cb2\u0ccd\u0cb2\u0cbf\u0ca8 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0cb5\u0cc1 \u0cb8\u0cbf\u0c97\u0cb2\u0cbf\u0cb2\u0ccd\u0cb2
protocolNotFound=\u0c88 \u0cb5\u0cbf\u0cb3\u0cbe\u0cb8\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb9\u0cc7\u0c97\u0cc6 \u0ca4\u0cc6\u0cb0\u0cc6\u0caf\u0cac\u0cc7\u0c95\u0cc6\u0c82\u0ca6\u0cc1 \u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d\u0c97\u0cc6 \u0ca4\u0cbf\u0cb3\u0cbf\u0ca6\u0cbf\u0cb2\u0ccd\u0cb2,\u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0caa\u0ccd\u0cb0\u0ccb\u0c9f\u0ccb\u0c95\u0cbe\u0cb2\u0ccd (%S) \u0caf\u0cbe\u0cb5\u0cc1\u0ca6\u0cc6 \u0caa\u0ccd\u0cb0\u0cca\u0c97\u0ccd\u0cb0\u0cbe\u0c82\u0ca8\u0cca\u0c82\u0ca6\u0cbf\u0c97\u0cc6 \u0cb8\u0cb9\u0cb5\u0cb0\u0ccd\u0ca4\u0cbf\u0caf\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2.
connectionFailure=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d  %S \u0ca8\u0cb2\u0ccd\u0cb2\u0cbf\u0ca8 \u0c92\u0c82\u0ca6\u0cc1 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0c95\u0ccd\u0c95\u0cc6  \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95 \u0cb8\u0cbe\u0ca7\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2 .
netInterrupt=\u0caa\u0cc1\u0c9f\u0cb5\u0cc1 \u0cb2\u0ccb\u0ca1\u0ccd\u200d \u0c86\u0c97\u0cc1\u0cb5\u0cbe\u0c97  %S\u0c95\u0ccd\u0c95\u0cc6 \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95\u0cb5\u0cc1 \u0c85\u0ca1\u0ccd\u0ca1\u0cbf\u0c97\u0cca\u0cb3\u0caa\u0c9f\u0ccd\u0c9f\u0cbf\u0ca6\u0cc6.
netTimeout=%S\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf\u0ca8 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0cb5\u0cc1 \u0caa\u0ccd\u0cb0\u0ca4\u0cbf\u0cb8\u0ccd\u0caa\u0c82\u0ca6\u0cbf\u0cb8\u0cb2\u0cc1 \u0cac\u0cb9\u0cb3 \u0cb8\u0cae\u0caf \u0ca4\u0cc6\u0c97\u0cc6\u0ca6\u0cc1\u0c95\u0cca\u0cb3\u0ccd\u0cb3\u0cc1\u0ca4\u0ccd\u0ca4\u0cbf\u0ca6\u0cc6 .
redirectLoop=\u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0cb5\u0cc1 \u0c88 \u0cb5\u0cbf\u0cb3\u0cbe\u0cb8\u0c95\u0ccd\u0c95\u0cbe\u0c97\u0cbf\u0ca8  \u0cae\u0ca8\u0cb5\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0c8e\u0c82\u0ca6\u0cc6\u0c82\u0ca6\u0cbf\u0c97\u0cc2 \u0cae\u0cc1\u0c97\u0cbf\u0caf\u0ca6 \u0cb0\u0cc0\u0ca4\u0cbf\u0caf\u0cb2\u0ccd\u0cb2\u0cbf \u0cae\u0cb0\u0cb3\u0cbf  \u0ca8\u0cbf\u0cb0\u0ccd\u0ca6\u0cc7\u0cb6\u0cbf\u0cb8\u0cc1\u0ca4\u0ccd\u0ca4\u0cbf\u0cb0\u0cc1\u0cb5\u0cc1\u0ca6\u0ca8\u0ccd\u0ca8\u0cc1 \u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d \u0cb9\u0cc1\u0ca1\u0cc1\u0c95\u0cbf\u0ca6\u0cc6.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=\u0c88 \u0caa\u0cc1\u0c9f\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0ccb\u0cb0\u0cbf\u0cb8\u0cb2\u0cc1, \u0c88 \u0cb9\u0cbf\u0c82\u0ca6\u0cc6 \u0ca8\u0cbf\u0cb0\u0ccd\u0cb5\u0cb9\u0cbf\u0cb8\u0cb2\u0cbe\u0ca6 \u0caf\u0cbe\u0cb5\u0cc1\u0ca6\u0cc6 \u0c95\u0cbe\u0cb0\u0ccd\u0caf\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 (\u0cb9\u0cc1\u0ca1\u0cc1\u0c95\u0cbe\u0c9f \u0c85\u0ca5\u0cb5  \u0c85\u0ca8\u0cc1\u0c95\u0ccd\u0cb0\u0cae\u0ca6 \u0c96\u0c9a\u0cbf\u0ca4\u0caa\u0ca1\u0cbf\u0c95\u0cc6) \u0cae\u0cb0\u0cc1\u0c95\u0cb3\u0cbf\u0cb8\u0cc1\u0cb5\u0c82\u0ca4\u0cb9 \u0cae\u0cbe\u0cb9\u0cbf\u0ca4\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 %S \u0cae\u0ca4\u0ccd\u0ca4\u0cca\u0cae\u0ccd\u0cae\u0cc6 \u0c95\u0cb3\u0cbf\u0cb8\u0cc1\u0cb5\u0c82\u0ca4\u0cbf\u0cb0\u0cac\u0cc7\u0c95\u0cc1 .
resendButton.label=\u0cae\u0ca4\u0ccd\u0ca4\u0cca\u0cae\u0ccd\u0cae\u0cc6 \u0c95\u0cb3\u0cc1\u0cb9\u0cbf\u0cb8\u0cc1
unknownSocketType=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d\u0c97\u0cc6 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0ca6\u0cca\u0c82\u0ca6\u0cbf\u0c97\u0cc6 \u0cb9\u0cc7\u0c97\u0cc6 \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95 \u0cb9\u0cca\u0c82\u0ca6\u0cac\u0cc7\u0c95\u0cc1 \u0c8e\u0c82\u0ca6\u0cc1 \u0ca4\u0cbf\u0cb3\u0cbf\u0ca6\u0cbf\u0cb2\u0ccd\u0cb2.
netReset=\u0caa\u0cc1\u0c9f\u0cb5\u0cc1 \u0cb2\u0ccb\u0ca1\u0ccd\u200d \u0c86\u0c97\u0cc1\u0cb5\u0cbe\u0c97 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0ca6\u0cca\u0c82\u0ca6\u0cbf\u0c97\u0cbf\u0ca8 \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95 \u0cae\u0cb0\u0cb3\u0cbf \u0cb8\u0ccd\u0ca5\u0cbe \u0caa\u0cbf\u0cb8\u0cb2\u0ccd\u0caa\u0c9f\u0ccd\u0c9f\u0cbf\u0ca6\u0cc6.
notCached=\u0c88 \u0ca6\u0cb8\u0ccd\u0ca4\u0cbe\u0cb5\u0cc7\u0c9c\u0cc1 \u0c88\u0c97 \u0cb2\u0cad\u0ccd\u0caf\u0cb5\u0cbf\u0cb2\u0ccd\u0cb2.
netOffline=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d \u0caa\u0ccd\u0cb0\u0cb8\u0c95\u0ccd\u0ca4 \u0c86\u0cab\u0ccd\u200d\u0cb2\u0cc8\u0ca8\u0ccd \u0c95\u0ccd\u0cb0\u0cae\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf\u0ca6\u0cc6 \u0c86\u0ca6\u0ccd\u0ca6\u0cb0\u0cbf\u0c82\u0ca6 \u0ca8\u0cc0\u0cb5\u0cc1 \u0c9c\u0cbe\u0cb2\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb5\u0cc0\u0c95\u0ccd\u0cb7\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cc1\u0cb5\u0cc1\u0ca6\u0cbf\u0cb2\u0ccd\u0cb2.
isprinting=\u0cae\u0cc1\u0ca6\u0ccd\u0cb0\u0cbf\u0cb8\u0cc1\u0cb5\u0cbe\u0c97 \u0c85\u0ca5\u0cb5 \u0cae\u0cc1\u0ca6\u0ccd\u0cb0\u0ca3\u0ca6 \u0cae\u0cc1\u0ca8\u0ccd\u0ca8\u0ccb\u0c9f\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf  \u0ca6\u0cb8\u0ccd\u0ca4\u0cbe\u0cb5\u0cc7\u0c9c\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0ca6\u0cb2\u0cbe\u0caf\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cc1\u0cb5\u0cc1\u0ca6\u0cbf\u0cb2\u0ccd\u0cb2.
deniedPortAccess=\u0c88 \u0cb5\u0cbf\u0cb3\u0cbe\u0cb8\u0cb5\u0cc1  \u0cb8\u0cbe\u0cae\u0cbe\u0ca8\u0ccd\u0caf\u0cb5\u0cbe\u0c97\u0cbf \u0c9c\u0cbe\u0cb2 \u0cb5\u0cc0\u0c95\u0ccd\u0cb7\u0ca3\u0cc6\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb9\u0cca\u0cb0\u0ca4\u0cc1\u0caa\u0ca1\u0cbf\u0cb8\u0cbf \u0cac\u0cc7\u0cb0\u0cc6 \u0c95\u0cbe\u0cb0\u0ccd\u0caf\u0c97\u0cb3\u0cbf\u0c97\u0cc6  \u0cac\u0cb3\u0cb8\u0cb2\u0cbe\u0c97\u0cc1\u0cb5 \u0c92\u0c82\u0ca6\u0cc1 \u0c9c\u0cbe\u0cb2\u0cac\u0c82\u0ca7 \u0caa\u0ccb\u0cb0\u0ccd\u0c9f\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0cb3\u0cb8\u0cc1\u0ca4\u0ccd\u0ca4\u0ca6\u0cc6.\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd \u0ca8\u0cbf\u0cae\u0ccd\u0cae \u0cb8\u0cc1\u0cb0\u0c95\u0ccd\u0cb7\u0ca4\u0cc6\u0caf \u0ca6\u0cc3\u0cb7\u0ccd\u0c9f\u0cbf\u0caf\u0cbf\u0c82\u0ca6 \u0cae\u0ca8\u0cb5\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb0\u0ca6\u0ccd\u0ca6\u0cc1 \u0cae\u0cbe\u0ca1\u0cbf\u0ca6\u0cc6.
proxyResolveFailure=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd\u200d \u0cb9\u0cc1\u0ca1\u0cc1\u0c95\u0cb2\u0cbe\u0c97\u0ca6\u0cc6 \u0c87\u0cb0\u0cc1\u0cb5 \u0c92\u0c82\u0ca6\u0cc1 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0cb3\u0cb8\u0cc1\u0cb5\u0c82\u0ca4\u0cc6 \u0cb8\u0c82\u0cb0\u0c9a\u0cbf\u0ca4\u0c97\u0cca\u0c82\u0ca1\u0cbf\u0ca6\u0cc6.
proxyConnectFailure=\u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95\u0c97\u0cb3\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca8\u0cbf\u0cb0\u0cbe\u0c95\u0cb0\u0cbf\u0cb8\u0cc1\u0cb5 \u0c92\u0c82\u0ca6\u0cc1 \u0caa\u0ccd\u0cb0\u0cbe\u0c95\u0ccd\u0cb8\u0cbf \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0cb3\u0cb8\u0cc1\u0cb5\u0c82\u0ca4\u0cc6 \u0cb8\u0c82\u0cb0\u0c9a\u0cbf\u0ca4\u0c97\u0cca\u0c82\u0ca1\u0cbf\u0ca6\u0cc6.
contentEncodingError=\u0ca8\u0cc0\u0cb5\u0cc1 \u0ca8\u0ccb\u0ca1\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cc1\u0ca4\u0ccd\u0ca4\u0cbf\u0cb0\u0cc1\u0cb5 \u0caa\u0cc1\u0c9f\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0ccb\u0cb0\u0cbf\u0cb8\u0cb2\u0cc1 \u0cb8\u0cbe\u0ca7\u0ccd\u0caf\u0cb5\u0cbf\u0cb2\u0ccd\u0cb2 \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c85\u0ca6\u0cc1 \u0c92\u0c82\u0ca6\u0cc1 \u0c85\u0cae\u0cbe\u0ca8\u0ccd\u0caf\u0cb5\u0cbe\u0ca6 \u0c85\u0ca5\u0cb5 \u0cac\u0cc6\u0c82\u0cac\u0cb2\u0cb5\u0cbf\u0cb2\u0ccd\u0cb2\u0ca6 \u0cb8\u0c82\u0c95\u0cc1\u0c9a\u0ca8\u0cbe (\u0c95\u0c82\u0caa\u0ccd\u0cb0\u0cc6\u0cb6\u0ca8\u0ccd) \u0cb5\u0cbf\u0ca7\u0cbe\u0ca8\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0cb3\u0cb8\u0cc1\u0ca4\u0ccd\u0ca4\u0ca6\u0cc6.
unsafeContentType=\u0ca8\u0cc0\u0cb5\u0cc1 \u0ca8\u0ccb\u0ca1\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cc1\u0ca4\u0ccd\u0ca4\u0cbf\u0cb0\u0cc1\u0cb5 \u0caa\u0cc1\u0c9f\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0ccb\u0cb0\u0cbf\u0cb8\u0cb2\u0cc1 \u0cb8\u0cbe\u0ca7\u0ccd\u0caf\u0cb5\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2 \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c85\u0ca6\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb9\u0cca\u0c82\u0ca6\u0cbf\u0cb0\u0cc1\u0cb5 \u0c95\u0ca1\u0ca4\u0ca6 \u0cac\u0c97\u0cc6\u0caf\u0cb8\u0cc1\u0cb0\u0c95\u0ccd\u0cb7\u0cbf\u0ca4\u0cb5\u0cb2\u0ccd\u0cb2\u0ca6\u0ccd\u0ca6\u0cbe\u0c97\u0cbf\u0ca6\u0cc6. \u0ca6\u0caf\u0cb5\u0cbf\u0c9f\u0ccd\u0c9f\u0cc1 \u0c88 \u0ca4\u0cca\u0c82\u0ca6\u0cb0\u0cc6\u0caf \u0cac\u0c97\u0ccd\u0c97\u0cc6 \u0ca4\u0cbf\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0c9c\u0cbe\u0cb2\u0ca4\u0cbe\u0ca3\u0ca6 \u0cae\u0cbe\u0cb2\u0cbf\u0c95\u0cb0\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95\u0cbf\u0cb8\u0cbf.
externalProtocolTitle=\u0cac\u0cbe\u0cb9\u0ccd\u0caf \u0caa\u0ccd\u0cb0\u0ccb\u0c9f\u0ccb\u0c95\u0cbe\u0cb2\u0ccd \u0cae\u0ca8\u0cb5\u0cbf
externalProtocolPrompt=%1$S\: \u0c95\u0cca\u0c82\u0ca1\u0cbf\u0c97\u0cb3\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca8\u0cbf\u0cad\u0cbe\u0caf\u0cbf\u0cb8\u0cb2\u0cc1 \u0c92\u0c82\u0ca6\u0cc1 \u0cac\u0cbe\u0cb9\u0ccd\u0caf \u0c85\u0ca8\u0ccd\u0cb5\u0caf\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0c86\u0cb0\u0c82\u0cad\u0cbf\u0cb8\u0cac\u0cc7\u0c95\u0cc1.\n\n\n\u0cae\u0ca8\u0cb5\u0cbf \u0cb8\u0cb2\u0ccd\u0cb2\u0cbf\u0cb8\u0cbf\u0ca6 \u0c95\u0cca\u0c82\u0ca1\u0cbf\:\n\n%2$S\n\n\u0c85\u0ca8\u0ccd\u0cb5\u0caf\: %3$S\n\n\n\u0ca8\u0cc0\u0cb5\u0cc1 \u0c88 \u0cae\u0ca8\u0cb5\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca8\u0cbf\u0cb0\u0cc0\u0c95\u0ccd\u0cb7\u0cbf\u0cb8\u0ca6\u0cbf\u0ca6\u0ccd\u0ca6\u0cb0\u0cc6 \u0cac\u0cb9\u0cc1\u0cb7\u0c83 \u0c85\u0ca6\u0cc1  \u0c86 \u0c87\u0ca8\u0ccd\u0ca8\u0cca\u0c82\u0ca6\u0cc1 \u0caa\u0ccd\u0cb0\u0cca\u0c97\u0ccd\u0cb0\u0cbe\u0c82\u0ca8\u0cb2\u0ccd\u0cb2\u0cbf\u0ca8 \u0ca6\u0ccc\u0cb0\u0ccd\u0cac\u0cb2\u0ccd\u0caf\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0cb3\u0cb8\u0cbf\u0c95\u0cca\u0cb3\u0ccd\u0cb3\u0cc1\u0cb5 \u0c92\u0c82\u0ca6\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cb5\u0cbe\u0c97\u0cbf\u0cb0\u0cac\u0cb9\u0cc1\u0ca6\u0cc1. \u0c85\u0ca6\u0cc1 \u0c85\u0caa\u0cbe\u0caf\u0c95\u0cbe\u0cb0\u0cbf \u0c85\u0cb2\u0ccd\u0cb2\u0cb5\u0cc6\u0c82\u0ca6\u0cc1 \u0ca8\u0cbf\u0cae\u0c97\u0cc6 \u0c96\u0cbe\u0ca4\u0cb0\u0cbf \u0c87\u0cb0\u0ca6\u0cc6 \u0cb9\u0ccb\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf \u0c88 \u0cae\u0ca8\u0cb5\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb0\u0ca6\u0ccd\u0ca6\u0ccd\u0ca6\u0cc1 \u0cae\u0cbe\u0ca1\u0cbf.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\u0c85\u0c9c\u0ccd\u0c9e\u0cbe\u0ca4>
externalProtocolChkMsg=\u0c88 \u0cac\u0c97\u0cc6\u0caf \u0c8e\u0cb2\u0ccd\u0cb2\u0cbe \u0c95\u0cca\u0c82\u0ca1\u0cbf\u0c97\u0cb3\u0cbf\u0c97\u0cc6 \u0ca8\u0ca8\u0ccd\u0ca8 \u0c86\u0caf\u0ccd\u0c95\u0cc6\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca8\u0cc6\u0ca8\u0caa\u0cbf\u0cb8\u0cc1.
externalProtocolLaunchBtn=\u0c85\u0ca8\u0ccd\u0cb5\u0caf\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0c86\u0cb0\u0cbf\u0cb8\u0cc1
malwareBlocked=%S \u0c92\u0c82\u0ca6\u0cc1 \u0ca7\u0cbe\u0cb3\u0cbf\u0c95\u0cbe\u0cb0\u0c95 \u0ca4\u0cbe\u0ca3\u0cb5\u0cc6\u0c82\u0ca6\u0cc1 \u0cb5\u0cb0\u0ca6\u0cbf \u0cae\u0cbe\u0ca1\u0cb2\u0ccd\u0caa\u0c9f\u0ccd\u0c9f\u0cbf\u0ca6\u0cc6 \u0cb9\u0cbe\u0c97\u0cc1 \u0ca8\u0cbf\u0cae\u0ccd\u0cae \u0cb8\u0cc1\u0cb0\u0c95\u0ccd\u0cb7\u0ca4\u0cbe \u0c86\u0ca6\u0ccd\u0caf\u0ca4\u0cc6\u0c97\u0cb3\u0cbf\u0c97\u0ca8\u0cc1\u0cb8\u0cbe\u0cb0\u0cb5\u0cbe\u0c97\u0cbf\u0c85\u0ca6\u0cc1 \u0ca8\u0cbf\u0cb0\u0ccd\u0cac\u0c82\u0ca7\u0cbf\u0cb8\u0cb2\u0ccd\u0caa\u0c9f\u0ccd\u0c9f\u0cbf\u0ca6\u0cc6.
phishingBlocked=%S \u0ca8\u0cb2\u0ccd\u0cb2\u0cbf\u0cb0\u0cc1\u0cb5 \u0c9c\u0cbe\u0cb2\u0ca4\u0cbe\u0ca3\u0cb5\u0cc1 \u0cac\u0cb3\u0c95\u0cc6\u0ca6\u0cbe\u0cb0\u0cb0\u0cc1 \u0ca4\u0cae\u0ccd\u0cae \u0c96\u0cbe\u0cb8\u0c97\u0cbf \u0c85\u0ca5\u0cb5 \u0cb9\u0ca3\u0c95\u0cbe\u0cb8\u0cbf\u0ca8 \u0cae\u0cbe\u0cb9\u0cbf\u0ca4\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0cb9\u0c82\u0c9a\u0cbf\u0c95\u0cca\u0cb3\u0ccd\u0cb3\u0cc1\u0cb5\u0c82\u0ca4\u0cc6 \u0cae\u0cbe\u0ca1\u0cc1\u0cb5 \u0c87\u0ca6\u0cc1 \u0c92\u0c82\u0ca6\u0cc1 \u0c9c\u0cbe\u0cb2 \u0cb5\u0c82\u0c9a\u0ca8\u0cc6 \u0c8e\u0c82\u0ca6\u0cc1 \u0cb5\u0cb0\u0ca6\u0cbf \u0cae\u0cbe\u0ca1\u0cb2\u0cbe\u0c97\u0cbf\u0ca6\u0cc6.
cspFrameAncestorBlocked=\u0c88 \u0caa\u0cc1\u0c9f\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0c88 \u0cac\u0c97\u0cc6\u0caf\u0cb2\u0ccd\u0cb2\u0cbf \u0c85\u0ca1\u0c95\u0c97\u0cca\u0cb3\u0cbf\u0cb8\u0cc1\u0cb5\u0cc1\u0ca6\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0ca1\u0cc6\u0caf\u0cc1\u0ca4\u0ccd\u0ca4\u0cbf\u0cb0\u0cc1\u0cb5 \u0c92\u0c82\u0ca6\u0cc1 \u0cb5\u0cbf\u0cb7\u0caf \u0cb8\u0cc1\u0cb0\u0c95\u0ccd\u0cb7\u0ca4\u0cbe \u0ca8\u0cbf\u0caf\u0cae\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0c87\u0ca6\u0cc1 \u0cb9\u0cca\u0c82\u0ca6\u0cbf\u0ca6\u0cc6.
xssBlockMode=\u0c88 \u0caa\u0cc1\u0c9f\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf \u0ca8\u0cbf\u0cae\u0ccd\u0cae \u0cad\u0ca6\u0ccd\u0cb0\u0ca4\u0cc6\u0c97\u0cbe\u0c97\u0cbf \u0ca8\u0cbf\u0cb0\u0ccd\u0cac\u0c82\u0ca7\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb0\u0cc1\u0cb5 \u0c92\u0c82\u0ca6\u0cc1 XSS \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95 \u0ca6\u0cbe\u0cb3\u0cbf \u0cb9\u0cc6\u0cc2\u0c82\u0ca6\u0cbf\u0ca6\u0cc6.
corruptedContentError=\u0ca8\u0cc0\u0cb5\u0cc1 \u0ca8\u0ccb\u0ca1\u0cb2\u0cc1 \u0cac\u0caf\u0cb8\u0cc1\u0cb5 \u0caa\u0cc1\u0c9f\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0ccb\u0cb0\u0cbf\u0cb8\u0cb2\u0cc1 \u0cb8\u0cbe\u0ca7\u0ccd\u0caf\u0cb5\u0cbf\u0cb2\u0ccd\u0cb2 \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0cae\u0cbe\u0cb9\u0cbf\u0ca4\u0cbf \u0cb5\u0cb0\u0ccd\u0c97\u0cbe\u0cb5\u0ca3\u0cc6\u0caf\u0cb2\u0ccd\u0cb2\u0cbf \u0c92\u0c82\u0ca6\u0cc1 \u0ca6\u0ccb\u0cb7\u0cb5\u0cc1 \u0c95\u0c82\u0ca1\u0cc1 \u0cac\u0c82\u0ca6\u0cbf\u0ca6\u0cc6.
remoteXUL=\u0c88 \u0caa\u0cc1\u0c9f\u0cb5\u0cc1 \u0cab\u0cc8\u0cb0\u0ccd\u0cab\u0cbe\u0c95\u0ccd\u0cb8\u0ccd \u0caa\u0ccd\u0cb0\u0cb8\u0c95\u0ccd\u0ca4 \u0caa\u0cc2\u0cb0\u0ccd\u0cb5\u0ca8\u0cbf\u0caf\u0ccb\u0c9c\u0cbf\u0ca4\u0cb5\u0cbe\u0c97\u0cbf \u0cac\u0cc6\u0c82\u0cac\u0cb2\u0cbf\u0cb8\u0ca6\u0cc6 \u0c87\u0cb0\u0cc1\u0cb5 \u0ca4\u0c82\u0ca4\u0ccd\u0cb0\u0c9c\u0ccd\u0c9e\u0cbe\u0ca8\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0cb3\u0cb8\u0cc1\u0ca4\u0ccd\u0ca4\u0ca6\u0cc6.

