#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=\u0110\u01b0\u1eddng d\u1eabn URL kh\u00f4ng \u0111\u00fang n\u00ean kh\u00f4ng m\u1edf \u0111\u01b0\u1ee3c.
fileNotFound=Pale Moon kh\u00f4ng th\u1ec3 t\u00ecm th\u1ea5y t\u1eadp tin t\u1ea1i %S.
dnsNotFound=Pale Moon kh\u00f4ng th\u1ec3 t\u00ecm th\u1ea5y m\u00e1y ch\u1ee7 t\u1ea1i %S.
protocolNotFound=Pale Moon kh\u00f4ng bi\u1ebft m\u1edf \u0111\u1ecba ch\u1ec9 n\u00e0y, v\u00ec giao th\u1ee9c (%S) kh\u00f4ng li\u00ean k\u1ebft v\u1edbi ch\u01b0\u01a1ng tr\u00ecnh n\u00e0o c\u1ea3.
connectionFailure=Pale Moon kh\u00f4ng th\u1ec3 t\u1ea1o k\u1ebft n\u1ed1i t\u1edbi m\u00e1y ch\u1ee7 t\u1ea1i %S.
netInterrupt=K\u1ebft n\u1ed1i t\u1edbi %S b\u1ecb \u0111\u1ee9t trong khi trang \u0111ang t\u1ea3i.
netTimeout=M\u00e1y ch\u1ee7 t\u1ea1i %S ph\u1ea3n h\u1ed3i qu\u00e1 l\u00e2u.
redirectLoop=Pale Moon ph\u00e1t hi\u1ec7n m\u00e1y ch\u1ee7 \u0111ang chuy\u1ec3n h\u01b0\u1edbng \u0111\u1ecba ch\u1ec9 y\u00eau c\u1ea7u theo m\u1ed9t c\u00e1ch m\u00e0 s\u1ebd ch\u1eb3ng bao gi\u1edd ho\u00e0n t\u1ea5t.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=\u0110\u1ec3 hi\u1ec3n th\u1ecb trang n\u00e0y, %S ph\u1ea3i g\u1eedi nh\u1eefng th\u00f4ng tin l\u00e0m l\u1eb7p l\u1ea1i b\u1ea5t k\u00ec h\u00e0nh \u0111\u1ed9ng n\u00e0o (nh\u01b0 l\u00e0 t\u00ecm ki\u1ebfm ho\u1eb7c x\u00e1c nh\u1eadn giao d\u1ecbch) \u0111\u00e3 th\u1ef1c hi\u1ec7n tr\u01b0\u1edbc \u0111\u00f3.
resendButton.label=G\u1eedi l\u1ea1i
unknownSocketType=Pale Moon kh\u00f4ng bi\u1ebft li\u00ean l\u1ea1c v\u1edbi m\u00e1y ch\u1ee7 nh\u01b0 th\u1ebf n\u00e0o.
netReset=K\u1ebft n\u1ed1i t\u1edbi m\u00e1y ch\u1ee7 \u0111\u00e3 b\u1ecb kh\u1edfi t\u1ea1o l\u1ea1i trong khi \u0111ang t\u1ea3i trang.
notCached=T\u00e0i li\u1ec7u n\u00e0y kh\u00f4ng c\u00f2n hi\u1ec7n h\u1eefu.
netOffline=Pale Moon hi\u1ec7n \u0111ang \u1edf ch\u1ebf \u0111\u1ed9 ngo\u1ea1i tuy\u1ebfn v\u00e0 kh\u00f4ng th\u1ec3 duy\u1ec7t Web.
isprinting=T\u00e0i li\u1ec7u kh\u00f4ng th\u1ec3 ch\u1ec9nh s\u1eeda trong khi \u0111ang In ho\u1eb7c Xem Tr\u01b0\u1edbc.
deniedPortAccess=\u0110\u1ecba ch\u1ec9 n\u00e0y d\u00f9ng m\u1ed9t c\u1ed5ng m\u1ea1ng v\u1ed1n th\u01b0\u1eddng \u0111\u01b0\u1ee3c d\u00f9ng cho m\u1ee5c \u0111\u00edch kh\u00e1c h\u01a1n l\u00e0 duy\u1ec7t Web. Pale Moon \u0111\u00e3 h\u1ee7y b\u1ecf y\u00eau c\u1ea7u n\u00e0y \u0111\u1ec3 b\u1ea3o v\u1ec7 b\u1ea1n.
proxyResolveFailure=Pale Moon \u0111\u00e3 \u0111\u01b0\u1ee3c c\u1ea5u h\u00ecnh \u0111\u1ec3 d\u00f9ng m\u1ed9t m\u00e1y ch\u1ee7 proxy, nh\u01b0ng kh\u00f4ng th\u1ec3 t\u00ecm th\u1ea5y.
proxyConnectFailure=Pale Moon \u0111\u00e3 \u0111\u01b0\u1ee3c c\u1ea5u h\u00ecnh \u0111\u1ec3 d\u00f9ng m\u1ed9t m\u00e1y ch\u1ee7 proxy, nh\u01b0ng proxy \u0111ang t\u1eeb ch\u1ed1i k\u1ebft n\u1ed1i.
contentEncodingError=Trang b\u1ea1n mu\u1ed1n xem kh\u00f4ng th\u1ec3 hi\u1ec3n th\u1ecb v\u00ec n\u00f3 d\u00f9ng m\u1ed9t d\u1ea1ng th\u1ee9c n\u00e9n b\u1ea5t h\u1ee3p l\u1ec7 ho\u1eb7c kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
unsafeContentType=Trang b\u1ea1n mu\u1ed1n xem kh\u00f4ng th\u1ec3 hi\u1ec3n th\u1ecb v\u00ec n\u00f3 ch\u1ee9a m\u1ed9t ki\u1ec3u t\u1eadp tin kh\u00f4ng an to\u00e0n. Vui l\u00f2ng li\u00ean h\u1ec7 ng\u01b0\u1eddi qu\u1ea3n l\u00ed trang web \u0111\u1ec3 b\u00e1o h\u1ecd v\u1ea5n \u0111\u1ec1 n\u00e0y.
externalProtocolTitle=Y\u00eau c\u1ea7u Giao th\u1ee9c Ngo\u1ea1i tr\u00fa
externalProtocolPrompt=C\u1ea7n m\u1ed9t ch\u01b0\u01a1ng tr\u00ecnh ngo\u1ea1i tr\u00fa \u0111\u1ec3 c\u00f3 th\u1ec3 x\u1eed l\u00ed c\u00e1c li\u00ean k\u1ebft %1$S\:. Li\u00ean k\u1ebft \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u\:\n\n\n%2$S\nCh\u01b0\u01a1ng tr\u00ecnh\: %3$S\n\n\nN\u1ebfu b\u1ea1n kh\u00f4ng tr\u00f4ng \u0111\u1ee3i y\u00eau c\u1ea7u n\u00e0y, th\u00ec \u0111\u00e2y c\u00f3 th\u1ec3 l\u00e0 m\u1ed9t \u00e2m m\u01b0u nh\u1eb1m khai th\u00e1c \u0111i\u1ec3m y\u1ebfu trong ch\u01b0\u01a1ng tr\u00ecnh \u0111\u00f3. H\u00e3y h\u1ee7y b\u1ecf y\u00eau c\u1ea7u n\u00e0y tr\u1eeb khi b\u1ea1n ch\u1eafc ch\u1eafn r\u1eb1ng n\u00f3 kh\u00f4ng g\u00e2y h\u1ea1i.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Kh\u00f4ng r\u00f5>
externalProtocolChkMsg=Ghi nh\u1edb l\u1ef1a ch\u1ecdn c\u1ee7a t\u00f4i cho c\u00e1c li\u00ean k\u1ebft lo\u1ea1i n\u00e0y.
externalProtocolLaunchBtn=Ch\u1ea1y ch\u01b0\u01a1ng tr\u00ecnh
malwareBlocked=Trang web t\u1ea1i %S b\u1ecb b\u00e1o c\u00e1o l\u00e0 trang web \u00e1c \u00fd v\u00e0 \u0111\u00e3 b\u1ecb ch\u1eb7n d\u1ef1a tr\u00ean t\u00f9y ch\u1ec9nh b\u1ea3o m\u1eadt c\u1ee7a b\u1ea1n.
phishingBlocked=Trang web t\u1ea1i %S b\u1ecb b\u00e1o c\u00e1o l\u00e0 trang web gi\u1ea3 m\u1ea1o l\u1eeba ng\u01b0\u1eddi d\u00f9ng ti\u1ebft l\u1ed9 th\u00f4ng tin t\u00e0i ch\u00ednh v\u00e0 c\u00e1 nh\u00e2n.
cspFrameAncestorBlocked=Trang n\u00e0y c\u00f3 m\u1ed9t ch\u00ednh s\u00e1ch b\u1ea3o m\u1eadt n\u1ed9i dung kh\u00f4ng cho ph\u00e9p n\u00f3 \u0111\u01b0\u1ee3c nh\u00fang theo c\u00e1ch n\u00e0y.
xssBlockMode=Trang n\u00e0y c\u00f3 ch\u1ee9a l\u1ed7i t\u1ea5n c\u00f4ng XSS nh\u01b0ng \u0111\u00e3 b\u1ecb ch\u1eb7n \u0111\u1ec3 b\u1ea3o v\u1ec7 b\u1ea1n.
corruptedContentError=Trang m\u00e0 b\u1ea1n \u0111ang c\u1ed1 xem kh\u00f4ng th\u1ec3 hi\u1ec3n th\u1ecb v\u00ec m\u1ed9t l\u1ed7i trong truy\u1ec1n t\u1ea3i d\u1eef li\u1ec7u.
remoteXUL=Trang n\u00e0y s\u1eed d\u1ee5ng m\u1ed9t k\u1ef9 thu\u1eadt kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 v\u00e0 kh\u00f4ng c\u00f2n c\u00f3 s\u1eb5n m\u1eb7c \u0111\u1ecbnh trong Pale Moon.

