#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL \u304c\u6b63\u3057\u304f\u306a\u3044\u305f\u3081\u3001\u8aad\u307f\u8fbc\u3081\u307e\u305b\u3093\u3067\u3057\u305f\u3002
fileNotFound=%S \u306b\u306f\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
dnsNotFound=%S \u3068\u3044\u3046\u540d\u524d\u306e\u30b5\u30fc\u30d0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
protocolNotFound=%S \u3068\u3044\u3046\u30d7\u30ed\u30c8\u30b3\u30eb\u306f\u3069\u306e\u30d7\u30ed\u30b0\u30e9\u30e0\u306b\u3082\u95a2\u9023\u3065\u3051\u3089\u308c\u3066\u304a\u3089\u305a\u3001Pale Moon \u3067\u3053\u306e\u30a2\u30c9\u30ec\u30b9\u3092\u958b\u304f\u65b9\u6cd5\u304c\u5206\u304b\u308a\u307e\u305b\u3093\u3002
connectionFailure=%S \u306e\u30b5\u30fc\u30d0\u3078\u306e\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
netInterrupt=\u30da\u30fc\u30b8\u306e\u8aad\u307f\u8fbc\u307f\u4e2d\u306b %S \u3078\u306e\u63a5\u7d9a\u304c\u5207\u65ad\u3055\u308c\u307e\u3057\u305f\u3002
netTimeout=%S \u306e\u30b5\u30fc\u30d0\u304b\u3089\u306e\u5fdc\u7b54\u304c\u4e00\u5b9a\u6642\u9593\u4ee5\u5185\u306b\u8fd4\u3063\u3066\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
redirectLoop=\u3053\u306e\u30a2\u30c9\u30ec\u30b9\u3078\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u5bfe\u3059\u308b\u30b5\u30fc\u30d0\u306e\u81ea\u52d5\u8ee2\u9001\u8a2d\u5b9a\u304c\u30eb\u30fc\u30d7\u3057\u3066\u3044\u307e\u3059\u3002
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=%1$0.S\u3053\u306e\u30da\u30fc\u30b8\u3092\u8868\u793a\u3059\u308b\u306b\u306f\u30d5\u30a9\u30fc\u30e0\u30c7\u30fc\u30bf\u3092\u518d\u5ea6\u9001\u4fe1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30d5\u30a9\u30fc\u30e0\u30c7\u30fc\u30bf\u3092\u518d\u9001\u4fe1\u3059\u308b\u3068\u4ee5\u524d\u5b9f\u884c\u3057\u305f\u691c\u7d22\u3001\u6295\u7a3f\u3084\u6ce8\u6587\u306a\u3069\u306e\u51e6\u7406\u304c\u7e70\u308a\u8fd4\u3055\u308c\u307e\u3059\u3002
resendButton.label=\u518d\u9001\u4fe1
unknownSocketType=\u3053\u306e\u30b5\u30fc\u30d0\u3068\u306e\u901a\u4fe1\u65b9\u6cd5\u304c\u4e0d\u660e\u3067\u3059\u3002
netReset=\u30da\u30fc\u30b8\u306e\u8aad\u307f\u8fbc\u307f\u4e2d\u306b\u30b5\u30fc\u30d0\u3078\u306e\u63a5\u7d9a\u304c\u30ea\u30bb\u30c3\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
notCached=\u3053\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306f\u5229\u7528\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002
netOffline=\u73fe\u5728 Pale Moon \u306f\u30aa\u30d5\u30e9\u30a4\u30f3\u30e2\u30fc\u30c9\u3067\u52d5\u4f5c\u3057\u3066\u304a\u308a\u3001\u3053\u306e\u30da\u30fc\u30b8\u306f\u8868\u793a\u3067\u304d\u307e\u305b\u3093\u3002
isprinting=\u5370\u5237\u4e2d\u3084\u5370\u5237\u30d7\u30ec\u30d3\u30e5\u30fc\u306e\u8868\u793a\u4e2d\u306f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
deniedPortAccess=\u901a\u5e38 Web \u30b5\u30a4\u30c8\u306e\u8868\u793a\u4ee5\u5916\u306e\u76ee\u7684\u3067\u4f7f\u7528\u3055\u308c\u308b\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30dd\u30fc\u30c8\u304c\u3053\u306e\u30a2\u30c9\u30ec\u30b9\u3067\u306f\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30e6\u30fc\u30b6\u3092\u4fdd\u8b77\u3059\u308b\u305f\u3081\u306b\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3057\u307e\u3057\u305f\u3002
proxyResolveFailure=\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u63a5\u7d9a\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
proxyConnectFailure=\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u3078\u306e\u63a5\u7d9a\u3092\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u63a5\u7d9a\u306e\u8a2d\u5b9a\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
contentEncodingError=\u4e0d\u6b63\u307e\u305f\u306f\u4e0d\u660e\u306a\u5f62\u5f0f\u3067\u5727\u7e2e\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001\u30da\u30fc\u30b8\u3092\u8868\u793a\u3067\u304d\u307e\u305b\u3093\u3002
unsafeContentType=\u5b89\u5168\u306b\u51e6\u7406\u3067\u304d\u306a\u3044\u30d5\u30a1\u30a4\u30eb\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30da\u30fc\u30b8\u3092\u8868\u793a\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u554f\u984c\u306b\u3064\u3044\u3066\u306f Web \u30b5\u30a4\u30c8\u306e\u7ba1\u7406\u8005\u306b\u554f\u3044\u5408\u308f\u305b\u3066\u304f\u3060\u3055\u3044\u3002
externalProtocolTitle=\u5916\u90e8\u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u8981\u6c42
externalProtocolPrompt=%1$S\: \u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u30ea\u30f3\u30af\u3092\u51e6\u7406\u3059\u308b\u306b\u306f\u5916\u90e8\u306e\u30d7\u30ed\u30b0\u30e9\u30e0\u304c\u5fc5\u8981\u3067\u3059\u3002\n\n\n\u6b21\u306e URL \u306e\u8aad\u307f\u8fbc\u307f\u304c\u8981\u6c42\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\n%2$S\n\n\u30d7\u30ed\u30b0\u30e9\u30e0\: %3$S\n\n\n\u3053\u306e URL \u306e\u8aad\u307f\u8fbc\u307f\u304c\u610f\u56f3\u3057\u3066\u3044\u306a\u3044\u3082\u306e\u3067\u3042\u308b\u5834\u5408\u3001\u5916\u90e8\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u8106\u5f31\u6027\u3092\u5229\u7528\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u554f\u984c\u304c\u306a\u3044\u3068\u78ba\u4fe1\u3067\u304d\u306a\u3044\u9650\u308a\u3053\u306e\u8981\u6c42\u306f\u30ad\u30e3\u30f3\u30bb\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\u4e0d\u660e>
externalProtocolChkMsg=\u4eca\u5f8c\u3053\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u30ea\u30f3\u30af\u3092\u540c\u69d8\u306b\u51e6\u7406\u3059\u308b\u3002
externalProtocolLaunchBtn=\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u8d77\u52d5
malwareBlocked=%S \u306e Web \u30b5\u30a4\u30c8\u306f\u653b\u6483\u30b5\u30a4\u30c8\u3067\u3042\u308b\u3068\u5831\u544a\u3055\u308c\u3066\u304a\u308a\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a2d\u5b9a\u306b\u5f93\u3044\u30d6\u30ed\u30c3\u30af\u3055\u308c\u307e\u3057\u305f\u3002
phishingBlocked=%S \u306e Web \u30b5\u30a4\u30c8\u306f\u5229\u7528\u8005\u306e\u500b\u4eba\u60c5\u5831\u3084\u30af\u30ec\u30b8\u30c3\u30c8\u30ab\u30fc\u30c9\u756a\u53f7\u306a\u3069\u3092\u76d7\u307f\u53d6\u308b\u76ee\u7684\u3067\u4f5c\u3089\u308c\u305f\u3001\u507d\u88c5\u30b5\u30a4\u30c8(\u30d5\u30a3\u30c3\u30b7\u30f3\u30b0\u8a50\u6b3a\u30b5\u30a4\u30c8)\u3067\u3042\u308b\u3068\u5831\u544a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
cspFrameAncestorBlocked=\u3053\u306e\u30da\u30fc\u30b8\u306b\u306f\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30dd\u30ea\u30b7\u30fc\u306b\u3088\u308a\u30da\u30fc\u30b8\u3078\u306e\u57cb\u3081\u8fbc\u307f\u304c\u7981\u6b62\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=\u3053\u306e\u30da\u30fc\u30b8\u306f\u3001\u30c7\u30fc\u30bf\u306e\u4f1d\u9001\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u305f\u305f\u3081\u8868\u793a\u3067\u304d\u307e\u305b\u3093\u3002
remoteXUL=\u3053\u306e\u30da\u30fc\u30b8\u306f\u3001\u65e2\u5b9a\u3067\u306f\u5229\u7528\u3067\u304d\u306a\u304f\u306a\u3063\u305f\u672a\u5bfe\u5fdc\u306e\u6280\u8853\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002

