#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=%S ne pourra \u00eatre enregistr\u00e9 car le fichier source ne peut \u00eatre lu.\n\nR\u00e9essayer plus tard ou contacter l'administrateur du serveur.
writeError=%S ne pourra \u00eatre enregistr\u00e9 car une erreur inconnue est survenue.\n\nEssayer d'enregistrer le fichier ailleurs.
launchError=%S ne pourra \u00eatre ouvert car une erreur inconnue est survenue.\n\nEssayer d'enregistrer d'abord sur le disque puis d'ouvrir le fichier.
diskFull=Il n'y a pas assez d'espace sur le disque pour enregistrer %S.\n\nEffacer les fichiers inutiles du disque et essayer \u00e0 nouveau, ou essayer d'enregistrer ailleurs.
readOnly=%S n'a pu \u00eatre enregistr\u00e9 car le disque, le r\u00e9pertoire ou le fichier est prot\u00e9g\u00e9 en \u00e9criture.\n\nEnlever la protection et essayer \u00e0 nouveau, ou essayer d'enregistrer ailleurs.
accessError=%S n'a pu \u00eatre enregistr\u00e9 car il n'est pas possible de changer le contenu de ce r\u00e9pertoire.\n\nChanger les propri\u00e9t\u00e9s du r\u00e9pertoire et essayer \u00e0 nouveau, ou essayer d'enregistrer ailleurs.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=%S n'a pu \u00eatre ouvert car l'application auxiliaire associ\u00e9e n'existe pas. Changer cette association dans les pr\u00e9f\u00e9rences.
noMemory=Il n'y a pas assez de m\u00e9moire disponible pour achever l'action demand\u00e9e.\n\nQuitter quelques applications et essayer \u00e0 nouveau.
title=T\u00e9l\u00e9chargement de %S
fileAlreadyExistsError=%S n'a pu \u00eatre enregistr\u00e9 car un fichier ayant le m\u00eame nom que le r\u00e9pertoire '_fichiers' existe d\u00e9j\u00e0.\n\nEssayer de l'enregistrer dans un emplacement diff\u00e9rent.
fileNameTooLongError=%S n'a pu \u00eatre enregistr\u00e9 car le nom de fichier est trop long.\n\nEssayer de l'enregistrer avec un nom plus court.

