#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Sichere Kommunikation ist nicht m\u00f6glich.  Die Gegenstelle unterst\u00fctzt keine hochgradige Verschl\u00fcsselung.
SSL_ERROR_US_ONLY_SERVER=Sichere Kommunikation ist nicht m\u00f6glich.  Die Gegenstelle ben\u00f6tigt eine hochgradige Verschl\u00fcsselung, die nicht unterst\u00fctzt wird.
SSL_ERROR_NO_CYPHER_OVERLAP=Sichere Kommunikation mit der Gegenstelle ist nicht m\u00f6glich\: Keine gemeinsamen Verschl\u00fcsselungsalgorithmen.
SSL_ERROR_NO_CERTIFICATE=Zertifikat oder Schl\u00fcssel f\u00fcr die Authentifizierung kann nicht gefunden werden.
SSL_ERROR_BAD_CERTIFICATE=Sichere Kommunikation mit der Gegenstelle ist nicht m\u00f6glich\: Das Zertifikat der Gegenstelle wurde abgelehnt.
SSL_ERROR_UNUSED_5=Nicht erkannter SSL-Fehlercode.
SSL_ERROR_BAD_CLIENT=Der Server hat ung\u00fcltige Daten vom Client empfangen.
SSL_ERROR_BAD_SERVER=Der Client hat ung\u00fcltige Daten vom Server empfangen.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Ung\u00fcltiger Zertifikatstyp.
SSL_ERROR_UNSUPPORTED_VERSION=Die Gegenstelle verwendet eine nicht unterst\u00fctzte Version des Sicherheitsprotokolls.
SSL_ERROR_UNUSED_10=Nicht erkannter SSL-Fehlercode.
SSL_ERROR_WRONG_CERTIFICATE=Client-Authentifizierung ist fehlgeschlagen\: Privater Schl\u00fcssel in Schl\u00fcsseldatenbank stimmt nicht mit \u00f6ffentlichem Schl\u00fcssel in Zertifikatsdatenbank \u00fcberein.
SSL_ERROR_BAD_CERT_DOMAIN=Sichere Kommunikation mit der Gegenstelle ist nicht m\u00f6glich\: Angeforderter Domainname stimmt nicht mit dem Zertifikat des Servers \u00fcberein.
SSL_ERROR_POST_WARNING=Nicht erkannter SSL-Fehlercode.
SSL_ERROR_SSL2_DISABLED=Die Gegenstelle unterst\u00fctzt nur SSL Version 2, die jedoch lokal deaktiviert ist.
SSL_ERROR_BAD_MAC_READ=SSL hat einen Eintrag mit inkorrektem Nachrichtenauthentifizierungscode erhalten.
SSL_ERROR_BAD_MAC_ALERT=Die SSL-Gegenstelle meldet einen inkorrekten Nachrichtenauthentifizierungscode.
SSL_ERROR_BAD_CERT_ALERT=Die SSL-Gegenstelle kann Ihr Zertifikat nicht verifizieren.
SSL_ERROR_REVOKED_CERT_ALERT=Die SSL-Gegenstelle hat Ihr Zertifikat als "widerrufen" abgelehnt.
SSL_ERROR_EXPIRED_CERT_ALERT=Die SSL-Gegenstelle hat Ihr Zertifikat als "ausgelaufen" abgelehnt.
SSL_ERROR_SSL_DISABLED=Verbindung ist nicht m\u00f6glich\: SSL ist deaktiviert.
SSL_ERROR_FORTEZZA_PQG=Verbindung ist nicht m\u00f6glich\: SSL ist in einer anderen FORTEZZA-Domain.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Eine unbekannte SSL-Cipher-Suite wurde verlangt.
SSL_ERROR_NO_CIPHERS_SUPPORTED=In diesem Programm sind keine Cipher-Suites verf\u00fcgbar und aktiviert.
SSL_ERROR_BAD_BLOCK_PADDING=SSL hat einen Eintrag mit falscher Block-Auff\u00fcllung erhalten.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL hat einen Eintrag erhalten, der die maximal erlaubte L\u00e4nge \u00fcberschritten hat.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL hat versucht, einen Eintrag zu senden, der die maximal erlaubte L\u00e4nge \u00fcberschritten hat.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL hat eine fehlgeformte Handshake-Nachricht "Hello-Anfrage" empfangen.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL hat eine fehlgeformte Handshake-Nachricht "Client Hello" empfangen.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL hat eine fehlgeformte Handshake-Nachricht "Server Hello" empfangen.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL hat eine fehlgeformte Handshake-Nachricht "Zertifikat" empfangen.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL hat eine fehlgeformte Handshake-Nachricht "Server-Schl\u00fcsselaustausch" empfangen.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL hat eine fehlgeformte Handshake-Nachricht "Zertifikat-Anfrage" empfangen.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL hat eine fehlgeformte Handshake-Nachricht "Server Hello Fertig" empfangen.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL hat eine fehlgeformte Handshake-Nachricht "Zertifikatverifizierung" empfangen.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL hat eine fehlgeformte Handshake-Nachricht "Client-Schl\u00fcsselaustausch" empfangen.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL hat eine fehlgeformte Handshake-Nachricht "Fertig" empfangen.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL hat eine fehlgeformte Begr\u00fc\u00dfungsnachricht "\u00c4ndere Cipher Spec" empfangen.
SSL_ERROR_RX_MALFORMED_ALERT=SSL hat einen fehlgeformten Warnungseintrag empfangen.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL hat einen fehlgeformten Handshake-Eintrag empfangen.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL hat einen fehlgeformten Anwendungsdateneintrag empfangen.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL hat eine unerwartete Handshake-Nachricht "Hello-Anfrage" empfangen.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL hat eine unerwartete Handshake-Nachricht "Client Hello" empfangen.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL hat eine unerwartete Handshake-Nachricht "Server Hello" empfangen.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL hat eine unerwartete Handshake-Nachricht "Zertifikat" empfangen.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL hat eine unerwartete Handshake-Nachricht "Server-Schl\u00fcsselaustausch" empfangen.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL hat eine unerwartete Handshake-Nachricht "Zertifikat-Anfrage" empfangen.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL hat eine unerwartete Handshake-Nachricht "Server Hello Fertig" empfangen.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL hat eine unerwartete Handshake-Nachricht "Zertifikatverifizierung" empfangen.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL hat eine unerwartete Handshake-Nachricht "Client-Schl\u00fcsselaustausch" empfangen.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL hat eine unerwartete Handshake-Nachricht "Fertig" empfangen.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL hat eine unerwartete Begr\u00fc\u00dfungsnachricht "\u00c4ndere Cipher Spec" empfangen.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL hat einen unerwarteten Warnungseintrag empfangen.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL hat einen unerwarteten Handshake-Eintrag empfangen.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL hat einen unerwarteten Anwendungsdateneintrag empfangen.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL hat einen Eintrag mit unbekanntem Inhaltstyp empfangen.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL hat einen Handshake-Eintrag mit unbekanntem Nachrichtentyp empfangen.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL hat einen Warnungseintrag mit unbekannter Warnungsbeschreibung empfangen.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Die SSL-Gegenstelle hat diese Verbindung geschlossen.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Die SSL-Gegenstelle hat die Handshake-Nachricht, die sie empfangen hat, nicht erwartet.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=Die SSL-Gegenstelle konnte einen SSL-Eintrag, den sie empfangen hat, nicht erfolgreich entpacken.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=Die SSL-Gegenstelle konnte keinen akzeptablen Satz an Sicherheitsparametern aushandeln.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Die SSL-Gegenstelle hat eine Handshake-Nachricht wegen inakzeptablem Inhalt abgelehnt.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Die SSL-Gegenstelle unterst\u00fctzt keine Zertifikate des Typs, den sie erhalten hat.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Die SSL-Gegenstelle hatte ein nicht n\u00e4her angegebenes Problem mit dem empfangenen Zertifikat.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL ist auf einen Fehler seines Zufallszahlengenerators gesto\u00dfen.
SSL_ERROR_SIGN_HASHES_FAILURE=Die zur \u00dcberpr\u00fcfung Ihres Zertifikats ben\u00f6tigten Daten konnten nicht digital signiert werden.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL konnte den \u00f6ffentlichen Schl\u00fcssel nicht aus den Zertifikat der Gegenstelle extrahieren.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Nicht n\u00e4her angegebener Fehler beim Verarbeiten der SSL-Server-Schl\u00fcssel-Aushandlung.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Nicht n\u00e4her angegebener Fehler beim Verarbeiten der SSL-Client-Schl\u00fcssel-Aushandlung.
SSL_ERROR_ENCRYPTION_FAILURE=Verschl\u00fcsselungsalgorithmus f\u00fcr Massendaten ist in gew\u00e4hlter Cipher-Suite fehlgeschlagen.
SSL_ERROR_DECRYPTION_FAILURE=Entschl\u00fcsselungsalgorithmus f\u00fcr Massendaten ist in gew\u00e4hlter Cipher-Suite fehlgeschlagen.
SSL_ERROR_SOCKET_WRITE_FAILURE=Der Versuch, verschl\u00fcsselte Daten auf den zugrundeliegenden Socket zu schreiben, ist fehlgeschlagen.
SSL_ERROR_MD5_DIGEST_FAILURE=MD5-Digest-Funktion ist fehlgeschlagen.
SSL_ERROR_SHA_DIGEST_FAILURE=SHA-1-Digest-Funktion ist fehlgeschlagen.
SSL_ERROR_MAC_COMPUTATION_FAILURE=MAC-Berechnung ist fehlgeschlagen.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Fehler beim Erstellen des Kontexts f\u00fcr symmetrischen Schl\u00fcssel.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Fehler beim Auspacken des symmetrischen Schl\u00fcssels aus der Client-Schl\u00fcsselaustausch-Nachricht.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=SSL-Server versuchte, einen Domestic-Grade \u00f6ffentlichen Schl\u00fcssel mit Export-Cipher-Suite zu verwenden.
SSL_ERROR_IV_PARAM_FAILURE=PKCS\#11-Code ist beim \u00dcbersetzen eines IV in einen Param fehlgeschlagen.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Die gew\u00e4hlte Cipher-Suite konnte nicht initialisiert werden.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Client konnte keine Session-Schl\u00fcssel f\u00fcr die SSL-Sitzung generieren.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Server hat keinen Schl\u00fcssel f\u00fcr den versuchten Schl\u00fcsselaustauschalgorithmus.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=PKCS\#11-Token wurde eingef\u00fcgt oder entfernt, w\u00e4hrend der Arbeitsschritt ausgef\u00fchrt wurde.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Es konnte kein PKCS\#11-Token gefunden werden, um einen ben\u00f6tigten Arbeitsschritt auszuf\u00fchren.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Sichere Kommunikation mit der Gegenstelle ist nicht m\u00f6glich\: Keine gemeinsamen Komprimierungsalgorithmen.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Es kann keine weiterer SSL-Handshake begonnen werden, bis der aktuelle Handshake komplett ist.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Ung\u00fcltige Handshake-Hashwerte von Gegenstelle erhalten.
SSL_ERROR_CERT_KEA_MISMATCH=Das \u00fcbergebene Zertifikat kann nicht mit dem gew\u00e4hlten Schl\u00fcsselaustauschalgorithmus verwendet werden.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Keiner Zertizierungsstelle wird f\u00fcr SSL-Client-Authentifizierung vertraut.
SSL_ERROR_SESSION_NOT_FOUND=Die SSL-Session-ID des Clients wurde im Session-Cache des Servers nicht gefunden.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Gegenstelle konnte einen SSL-Eintrag, den sie empfangen hat, nicht entschl\u00fcsseln.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Die Gegenstelle hat einen SSL-Eintrag erhalten, der l\u00e4nger war als erlaubt.
SSL_ERROR_UNKNOWN_CA_ALERT=Die Gegenstelle erkennt und traut der CA nicht, die Ihr Zertifikat ausgestellt hat.
SSL_ERROR_ACCESS_DENIED_ALERT=Die Gegenstelle hat ein g\u00fcltiges Zertifikat erhalten, aber der Zugriff wurde abgelehnt.
SSL_ERROR_DECODE_ERROR_ALERT=Die Gegenstelle konnte eine SSL-Handshake-Nachricht nicht dekodieren.
SSL_ERROR_DECRYPT_ERROR_ALERT=Die Gegenstelle meldet einen Fehler bei der Zertifikatspr\u00fcfung oder beim Schl\u00fcsselaustausch.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Die Gegenstelle meldet eine Aushandlung im Widerspruch zu Exportbestimmungen.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Die Gegenstelle meldet eine inkompatible oder nicht unterst\u00fctzte Protokollversion.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Der Server ben\u00f6tigt Ciphers, die sicherer sind, als jene, die der Client unterst\u00fctzt.
SSL_ERROR_INTERNAL_ERROR_ALERT=Die Gegenstelle meldet, dass sie auf einen internen Fehler gesto\u00dfen ist.
SSL_ERROR_USER_CANCELED_ALERT=Die Gegenstelle hat den Handshake abgebrochen.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Die Gegenstelle erlaubt keine Neuverhandlung von SSL-Sicherheitsparametern.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=SSL-Server-Cache f\u00fcr diesen Socket nicht konfiguriert und nicht deaktiviert.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Die SSL-Gegenstelle unterst\u00fctzt die angeforderte TLS-Hello-Erweiterung nicht.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Die SSL-Gegenstelle konnte Ihr Zertifikat nicht von der angegebenen URL beziehen.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Die SSL-Gegenstelle hat kein Zertifikat f\u00fcr den angeforderten DNS-Namen.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Die SSL-Gegenstelle konnte keine OCSP-Antwort f\u00fcr ihr Zertifikat erhalten.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Die SSL-Gegenstelle meldet einen fehlerhaften Zertifikat-Hashwert.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL hat eine unerwartete Handshake-Nachricht f\u00fcr ein "New Session Ticket" erhalten.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL hat eine fehlgeformte Handshake-Nachricht f\u00fcr ein "New Session Ticket" erhalten.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL hat einen komprimierten Eintrag erhalten, der nicht dekomprimiert werden konnte.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Neuverhandlung ist auf diesem SSL-Socket nicht erlaubt.
SSL_ERROR_UNSAFE_NEGOTIATION=Gegenstelle hat Handshake im alten Stil versucht (angriffsgef\u00e4hrdet).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL hat einen unerwarteten unkomprimierten Eintrag erhalten.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL hat einen schwachen kurzlebigen Diffie-Hellman-Schl\u00fcssel in der Handshake-Nachricht "Server-Schl\u00fcsselaustausch" empfangen.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL hat ung\u00fcltige NPN-Erweiterungsdaten erhalten.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Diese SSL-Funktion wird f\u00fcr SSL-2.0-Verbindungen nicht unterst\u00fctzt.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Diese SSL-Funktion wird f\u00fcr Server nicht unterst\u00fctzt.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Diese SSL-Funktion wird f\u00fcr Clients nicht unterst\u00fctzt.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Ein I/O-Fehler ist w\u00e4hrend der Sicherheitsauthentifizierung aufgetreten.
SEC_ERROR_LIBRARY_FAILURE=Sicherheitsbibliothekfehler.
SEC_ERROR_BAD_DATA=Sicherheitsbibliothek\: Fehlerhafte Daten empfangen.
SEC_ERROR_OUTPUT_LEN=Sicherheitsbibliothek\: Ausgabel\u00e4ngenfehler.
SEC_ERROR_INPUT_LEN=Sicherheitsbibliothek hat einen Eingabel\u00e4ngenfehler gefunden.
SEC_ERROR_INVALID_ARGS=Sicherheitsbibliothek\: Ung\u00fcltige Argumente.
SEC_ERROR_INVALID_ALGORITHM=Sicherheitsbibliothek\: Ung\u00fcltiger Algorithmus.
SEC_ERROR_INVALID_AVA=Sicherheitsbibliothek\: Ung\u00fcltige AVA.
SEC_ERROR_INVALID_TIME=Ung\u00fcltig formatierte Zeitangabe.
SEC_ERROR_BAD_DER=Sicherheitsbibliothek\: Fehlerhaft formatierte DER-verschl\u00fcsselte Nachricht.
SEC_ERROR_BAD_SIGNATURE=Das Zertifikat der Gegenstelle hat eine ung\u00fcltige Signatur.
SEC_ERROR_EXPIRED_CERTIFICATE=Das Zertifikat der Gegenstelle ist abgelaufen.
SEC_ERROR_REVOKED_CERTIFICATE=Das Zertifikat der Gegenstelle wurde widerrufen.
SEC_ERROR_UNKNOWN_ISSUER=Der Zertifikat-Aussteller der Gegenstelle wurde nicht erkannt.
SEC_ERROR_BAD_KEY=\u00d6ffentlicher Schl\u00fcssel der Gegenstelle ist ung\u00fcltig.
SEC_ERROR_BAD_PASSWORD=Das angegebene Sicherheitspasswort ist ung\u00fcltig.
SEC_ERROR_RETRY_PASSWORD=Neues Passwort inkorrekt eingegeben. Bitte versuchen Sie es erneut.
SEC_ERROR_NO_NODELOCK=Sicherheitsbibliothek\: Kein Nodelock.
SEC_ERROR_BAD_DATABASE=Sicherheitsbibliothek\: Fehlerhafte Datenbank.
SEC_ERROR_NO_MEMORY=Sicherheitsbibliothek\: Speicherzuweisungsfehler.
SEC_ERROR_UNTRUSTED_ISSUER=Zertifikat-Aussteller der Gegenstelle wurde vom Benutzer als nicht vertrauensw\u00fcrdig gekennzeichnet.
SEC_ERROR_UNTRUSTED_CERT=Zertifikat der Gegenstelle wurde vom Benutzer als nicht vertrauensw\u00fcrdig markiert.
SEC_ERROR_DUPLICATE_CERT=Zertifikat existiert bereits in Ihrer Datenbank.
SEC_ERROR_DUPLICATE_CERT_NAME=Der Name des heruntergeladenen Zertifikats dupliziert einen, der bereits in Ihrer Datenbank ist.
SEC_ERROR_ADDING_CERT=Fehler beim Hinzuf\u00fcgen des Zertifikat zur Datenbank.
SEC_ERROR_FILING_KEY=Fehler beim erneuten Ablegen des Schl\u00fcssels f\u00fcr dieses Zertifikat.
SEC_ERROR_NO_KEY=Der private Schl\u00fcssel f\u00fcr dieses Zertifikat kann in der Schl\u00fcsseldatenbank nicht gefunden werden
SEC_ERROR_CERT_VALID=Dieses Zertifikat ist g\u00fcltig.
SEC_ERROR_CERT_NOT_VALID=Dieses Zertifikat ist nicht g\u00fcltig.
SEC_ERROR_CERT_NO_RESPONSE=Cert-Biblithek\: Keine Antwort
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Das Zertifikat des Zertifikataussteller ist abgelaufen. \u00dcberpr\u00fcfen Sie Datum und Zeit Ihres Systems.
SEC_ERROR_CRL_EXPIRED=Die CRL f\u00fcr den Zertifikataussteller ist abgelaufen. Aktualisieren Sie diese oder \u00fcberpr\u00fcfen Sie Datum und Zeit Ihres Systems.
SEC_ERROR_CRL_BAD_SIGNATURE=Die CRL f\u00fcr den Zertifikataussteller hat eine ung\u00fcltige Signatur.
SEC_ERROR_CRL_INVALID=Neue CRL hat ein ung\u00fcltiges Format.
SEC_ERROR_EXTENSION_VALUE_INVALID=Der Zertifikat-Erweiterungswert ist ung\u00fcltig.
SEC_ERROR_EXTENSION_NOT_FOUND=Die Zertifikat-Erweiterung wurde nicht gefunden.
SEC_ERROR_CA_CERT_INVALID=Das Aussteller-Zertifikat ist ung\u00fcltig.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Die L\u00e4ngenbeschr\u00e4nkung des Zertifikatpfades ist ung\u00fcltig.
SEC_ERROR_CERT_USAGES_INVALID=Das Zertifikatsverwendungsfeld ist ung\u00fcltig.
SEC_INTERNAL_ONLY=**NUR internes Modul**
SEC_ERROR_INVALID_KEY=Der Schl\u00fcssel unterst\u00fctzt den angeforderten Arbeitsschritt nicht.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Das Zertifikat enth\u00e4lt eine unbekannte kritische Erweiterung.
SEC_ERROR_OLD_CRL=Neue CRl ist nicht j\u00fcnger als die aktuelle.
SEC_ERROR_NO_EMAIL_CERT=Nicht verschl\u00fcsselt oder signiert\: Sie haben noch kein E-Mail-Zertifikat.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Nicht verschl\u00fcsselt\: Sie haben nicht f\u00fcr alle Empf\u00e4nger ein Zertifikat.
SEC_ERROR_NOT_A_RECIPIENT=Entschl\u00fcsseln ist nicht m\u00f6glich\: Sie sind kein Empf\u00e4nger oder ein \u00fcbereinstimmendes Zertifikat und ein privater Schl\u00fcssel wurden nicht gefunden.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Entschl\u00fcsseln ist nicht m\u00f6glich\: Der Schl\u00fcssel-Verschl\u00fcsselungsagorithmus stimmt nicht mit Ihrem Zertifikat \u00fcberein.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Die Signatur-Verifizierung ist fehlgeschlagen\: Kein Unterzeichner gefunden, zu viele Unterzeichner gefunden, unpassende oder besch\u00e4digte Daten.
SEC_ERROR_UNSUPPORTED_KEYALG=Nicht unterst\u00fctzter oder unbekannter Schl\u00fcsselalgorithmus.
SEC_ERROR_DECRYPTION_DISALLOWED=Entschl\u00fcsseln ist nicht m\u00f6glich\: Verschl\u00fcsselung mit einem unerlaubten Algorithmus oder Schl\u00fcsselgr\u00f6\u00dfe.
XP_SEC_FORTEZZA_BAD_CARD=Die Fortezza-Karte wurde nicht korrekt initialisiert. Bitte entfernen Sie diese und bringen Sie sie zu Ihrem Aussteller zur\u00fcck.
XP_SEC_FORTEZZA_NO_CARD=Keine Fortezza-Karten gefunden
XP_SEC_FORTEZZA_NONE_SELECTED=Keine Fortezza-Karte gew\u00e4hlt
XP_SEC_FORTEZZA_MORE_INFO=Bitte geben Sie eine Pers\u00f6nlichkeit an, um weitere Informationen \u00fcber sie zu bekommen
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Pers\u00f6nlichkeit wurde nicht gefunden
XP_SEC_FORTEZZA_NO_MORE_INFO=Keine weiteren Informationen \u00fcber diese Pers\u00f6nlichkeit
XP_SEC_FORTEZZA_BAD_PIN=Ung\u00fcltige PIN
XP_SEC_FORTEZZA_PERSON_ERROR=Fortezza-Pers\u00f6nlichkeiten konnten nicht initialisiert werden.
SEC_ERROR_NO_KRL=Es wurde keine KRL f\u00fcr das Zertifikat dieser Seite gefunden.
SEC_ERROR_KRL_EXPIRED=Die KRL f\u00fcr das Zertifikat dieser Seite ist abgelaufen.
SEC_ERROR_KRL_BAD_SIGNATURE=Die KRL f\u00fcr das Zertifikat dieser Seite hat eine ung\u00fcltige Signatur.
SEC_ERROR_REVOKED_KEY=Die KRL f\u00fcr das Zertifikat dieser Seite wurde widerrufen.
SEC_ERROR_KRL_INVALID=Die neue KRL hat ein ung\u00fcltiges Format.
SEC_ERROR_NEED_RANDOM=Sicherheitsbibliothek\: Zufallsdaten ben\u00f6tigt.
SEC_ERROR_NO_MODULE=Sicherheitsbibliothek\: Kein Sicherheitsmodul kann den angeforderten Arbeitsschritt ausf\u00fchren.
SEC_ERROR_NO_TOKEN=Sicherheitskarte oder -token existiert nicht, muss initialisiert werden oder wurde entfernt.
SEC_ERROR_READ_ONLY=Sicherheitsbibliothek\: Schreibgesch\u00fctzte Datenbank.
SEC_ERROR_NO_SLOT_SELECTED=Kein Slot oder Token gew\u00e4hlt.
SEC_ERROR_CERT_NICKNAME_COLLISION=Ein Zertifikat mit der gleichen Kurzbezeichnung existiert bereits.
SEC_ERROR_KEY_NICKNAME_COLLISION=Ein Schl\u00fcssel mit der gleichen Kurzbezeichnung existiert bereits.
SEC_ERROR_SAFE_NOT_CREATED=Fehler beim Erstellen eines sicheren Objekts
SEC_ERROR_BAGGAGE_NOT_CREATED=Fehler beim Erstellen eines "Gep\u00e4cksobjektes"
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Principal konnte nicht entfernt werden
XP_JAVA_DELETE_PRIVILEGE_ERROR=Privileg konnte nicht gel\u00f6scht werden
XP_JAVA_CERT_NOT_EXISTS_ERROR=Dieser Principal hat kein Zertifikat
SEC_ERROR_BAD_EXPORT_ALGORITHM=Der ben\u00f6tigte Algorithmus ist nicht erlaubt.
SEC_ERROR_EXPORTING_CERTIFICATES=Fehler beim Versuch, Zertifikate zu exportieren.
SEC_ERROR_IMPORTING_CERTIFICATES=Fehler beim Versuch, Zertifikate zu importieren.
SEC_ERROR_PKCS12_DECODING_PFX=Importieren war nicht m\u00f6glich. Dekodierungsfehler. Datei nicht g\u00fcltig.
SEC_ERROR_PKCS12_INVALID_MAC=Importieren war nicht m\u00f6glich. Ung\u00fcltiger MAC. Ung\u00fcltiges Passwort oder besch\u00e4digte Datei.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Importieren war nicht m\u00f6glich. MAC-Algorithmus nicht unterst\u00fctzt.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Importieren war nicht m\u00f6glich. Nur Passwort-Integrit\u00e4t und Privatsph\u00e4ren-Modi unterst\u00fctzt.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Importieren war nicht m\u00f6glich. Dateistruktur ist besch\u00e4digt.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Importieren war nicht m\u00f6glich. Verschl\u00fcsselungsalgorithmus nicht unterst\u00fctzt.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Importieren war nicht m\u00f6glich. Dateiversion nicht unterst\u00fctzt.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Importieren war nicht m\u00f6glich. Ung\u00fcltiges Privatsph\u00e4ren-Passwort.
SEC_ERROR_PKCS12_CERT_COLLISION=Exportieren war nicht m\u00f6glich. Die gleiche Kurzbezeichnung existiert bereits in der Datenbank.
SEC_ERROR_USER_CANCELLED=Der Benutzer hat Abbrechen gedr\u00fcckt.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Nicht importiert, bereits in der Datenbank.
SEC_ERROR_MESSAGE_SEND_ABORTED=Nachricht wurde nicht gesendet.
SEC_ERROR_INADEQUATE_KEY_USAGE=Eine Verwendung des Zertifikatschl\u00fcssels ist f\u00fcr den versuchten Arbeitsschritt unpassend.
SEC_ERROR_INADEQUATE_CERT_TYPE=Zertifikatstyp ist f\u00fcr diese Anwendung nicht genehmigt.
SEC_ERROR_CERT_ADDR_MISMATCH=Adresse im Unterzeichnerzertifikat stimmt nicht mit der Adresse in den Nachrichtenk\u00f6pfen \u00fcberein.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Importieren war nicht m\u00f6glich. Fehler beim Versuch, den privaten Schl\u00fcssel zu importieren.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Importieren war nicht m\u00f6glich. Fehler beim Versuch, die Zertifikatskette zu importieren.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Exportieren war nicht m\u00f6glich. Zertifikat oder Schl\u00fcssel konnte nicht \u00fcber die Kurzbezeichnung aufgefunden werden.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Exportieren war nicht m\u00f6glich. Privater Schl\u00fcssel konnte nicht gefunden und exportiert werden.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Exportieren war nicht m\u00f6glich. Export-Datei konnte nicht geschrieben werden.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Importieren war nicht m\u00f6glich. Zu importierende Datei konnte nicht gelesen werden.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Exportieren war nicht m\u00f6glich. Schl\u00fcsseldatenbank besch\u00e4digt oder gel\u00f6scht.
SEC_ERROR_KEYGEN_FAIL=Das Paar aus \u00f6ffentlichem und privatem Schl\u00fcssel konnte nicht erzeugt werden.
SEC_ERROR_INVALID_PASSWORD=Eingegebenes Passwort ist ung\u00fcltig. Bitte verwenden Sie ein anderes.
SEC_ERROR_RETRY_OLD_PASSWORD=Altes Passwort inkorrekt eingegeben. Bitte versuchen Sie es erneut.
SEC_ERROR_BAD_NICKNAME=Die Zertifikat-Kurzbezeichnung ist bereits in Verwendung.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Gegenstellen-FORTEZZA-Kette enth\u00e4lt ein Nicht-FORTEZZA-Zertifikat.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Ein sensibler Schl\u00fcssel konnte nicht in den Slot verschoben werden, in dem er gebraucht wird.
SEC_ERROR_JS_INVALID_MODULE_NAME=Ung\u00fcltiger Modulname.
SEC_ERROR_JS_INVALID_DLL=Ung\u00fcltiger Modul-Pfad/Dateiname
SEC_ERROR_JS_ADD_MOD_FAILURE=Modul konnte nicht geladen werden
SEC_ERROR_JS_DEL_MOD_FAILURE=Modul konnte nicht gel\u00f6scht werden
SEC_ERROR_OLD_KRL=Die neue KRL ist nicht j\u00fcnger als die aktuelle.
SEC_ERROR_CKL_CONFLICT=Die neue CKL hat einen anderen Herausgeber als die aktuelle CKL. L\u00f6schen Sie die aktuelle CKL.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Die Zertifizierungsstelle f\u00fcr dieses Zertifikat darf kein Zertifikat mit diesem Namen ausstellen.
SEC_ERROR_KRL_NOT_YET_VALID=Die Schl\u00fcsselsperrliste f\u00fcr dieses Zertifikat ist noch nicht g\u00fcltig.
SEC_ERROR_CRL_NOT_YET_VALID=Die Zertifikatsperrliste f\u00fcr dieses Zertifikat ist noch nicht g\u00fcltig.
SEC_ERROR_UNKNOWN_CERT=Das angeforderte Zertifikat konnte nicht gefunden werden.
SEC_ERROR_UNKNOWN_SIGNER=Das Zertifikat des Unterzeichners konnte nicht gefunden werden.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Die Adresse f\u00fcr den Zertifikatsstatus hat ein ung\u00fcltiges Format.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Die OCSP-Antwort kann nicht vollst\u00e4ndig dekodiert werde; sie hat einen unbekannten Typ.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Der OCSP-Server hat unerwartete/ung\u00fcltige HTTP-Daten geliefert.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Der OCSP-Server hat die Anfrage f\u00fcr besch\u00e4digt oder falsch geformt gehalten.
SEC_ERROR_OCSP_SERVER_ERROR=Der OCSP-Server ist auf einen internen Fehler gesto\u00dfen.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Der OCSP-Server schl\u00e4gt vor, es sp\u00e4ter erneut zu versuchen.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Der OCSP-Server ben\u00f6tigt eine Signatur f\u00fcr diese Anfrage.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Der OCSP-Server hat diese Anfrage als unauthorisiert abgelehnt.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Der OCSP-Server hat mit unerkennbarem Status geantwortet.
SEC_ERROR_OCSP_UNKNOWN_CERT=Der OCSP-Server hat keinen Status f\u00fcr das Zertifikat.
SEC_ERROR_OCSP_NOT_ENABLED=Sie m\u00fcssen OCSP aktivieren, bevor Sie diesen Arbeitsschritt durchf\u00fchren.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Sie m\u00fcssen den OCSP-Standardbeantworter setzen, bevor Sie diesen Arbeitsschritt durchf\u00fchren.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Die Antwort des OCSP-Servers war besch\u00e4digt oder falsch geformt.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Der Unterzeichner der OCSP-Antwort ist nicht authorisiert, einen Status f\u00fcr dieses Zertifikat zu geben.
SEC_ERROR_OCSP_FUTURE_RESPONSE=Die OCSP-Antwort ist noch nicht g\u00fcltig (enth\u00e4lt ein Datum in der Zukunft).
SEC_ERROR_OCSP_OLD_RESPONSE=Die OCSP-Antwort enth\u00e4lt veraltete Informationen.
SEC_ERROR_DIGEST_NOT_FOUND=Der CMS- oder PKCS\#7-Digest wurde in der signierten Nachricht nicht gefunden.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Der CMS- oder PKCS\#7-Nachrichtentyp wird nicht unterst\u00fctzt.
SEC_ERROR_MODULE_STUCK=PKCS\#11-Modul konnte nicht entfernt werden, weil es noch immer verwendet wird.
SEC_ERROR_BAD_TEMPLATE=ASN.1-Daten konnten nicht dekodiert werden. Die angegebene Vorlage war ung\u00fcltig.
SEC_ERROR_CRL_NOT_FOUND=Keine \u00fcbereinstimmende CRL gefunden.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Sie versuchen ein Zertifikat mit gleichem Aussteller/Seriennummer wie ein existierendes Zertifikat zu importieren, aber es ist nicht dasselbe Zertifikat.
SEC_ERROR_BUSY=NSS konnte nicht beendet werden. Objekte werden noch immer verwendet.
SEC_ERROR_EXTRA_INPUT=DER-kodierte Nachricht enth\u00e4lt zus\u00e4tzliche unverwendete Daten.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Nicht unterst\u00fctzte elliptische Kurve.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Nicht unterst\u00fctzte Form eines Punkts der elliptischen Kurve.
SEC_ERROR_UNRECOGNIZED_OID=Nicht erkannter Objekt-Identifikator.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Ung\u00fcltiges OCSP-Unterzeichnungszertifikat in OCSP-Antwort.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Das Zertifikat wurde in der Zertifikatsperrliste des Ausstellers widerrufen.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Der OCSP-Beantworter des Ausstellers meldet, dass das Zertifikat widerrufen wurde.
SEC_ERROR_CRL_INVALID_VERSION=Die Zertifikatsperrliste des Ausstellers hat eine unbekannte Versionsnummer.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Die V1-Zertifikatsperrliste des Ausstellers hat eine unbekannte kritische Erweiterung.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Die V2-Zertifikatsperrliste des Ausstellers hat eine unbekannte kritische Erweiterung.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Unbekannter Objekttyp angegeben.
SEC_ERROR_INCOMPATIBLE_PKCS11=PKCS\#11-Treiber verst\u00f6\u00dft in inkompatibler Weise gegen die Spezifikation.
SEC_ERROR_NO_EVENT=Im Moment ist kein neuer Slot-Event verf\u00fcgbar.
SEC_ERROR_CRL_ALREADY_EXISTS=Die CRL existiert bereits.
SEC_ERROR_NOT_INITIALIZED=NSS wurde nicht initialisiert.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Der Arbeittschritt ist fehlgeschlagen, weil das PKCS\#11-Token nicht eingeloggt ist.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Das Zertifikat des konfigurierten OCSP-Beantworters ist ung\u00fcltig.
SEC_ERROR_OCSP_BAD_SIGNATURE=Die OCSP-Antwort hat eine ung\u00fcltige Signatur.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Zertifikatsvalidierungssuche ist au\u00dferhalb der Suchgrenzen
SEC_ERROR_INVALID_POLICY_MAPPING=Richtlinien-Abbildung enth\u00e4lt "anypolicy"
SEC_ERROR_POLICY_VALIDATION_FAILED=Zertifikatskette besteht Richtlinienvalidierung nicht
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Unbekannter Adresstyp in Zertifikat-AIA-Erweiterung
SEC_ERROR_BAD_HTTP_RESPONSE=Eine ung\u00fcltige HTTP-Antwort wurde vom Server gesendet
SEC_ERROR_BAD_LDAP_RESPONSE=Eine ung\u00fcltige LDAP-Antwort wurde vom Server gesendet
SEC_ERROR_FAILED_TO_ENCODE_DATA=Kodierung der Daten mit dem ASN1-Kodierer fehlgeschlagen
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Ung\u00fcltige Informations-Zugriff-Adresse in Zertifikatserweiterung
SEC_ERROR_LIBPKIX_INTERNAL=Ein interner Libpkix-Fehler ist w\u00e4hrend der Zertifikatsvalidierung aufgetreten.
SEC_ERROR_PKCS11_GENERAL_ERROR=Ein PKCS-\#11-Modul lieferte CKR_GENERAL_ERROR, was anzeigt, dass ein nicht zu behebendes Problem aufgetreten ist.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Ein PKCS-\#11-Modul lieferte CKR_FUNCTION_FAILED, was anzeigt, dass die angeforderte Funktion nicht ausgef\u00fchrt werden konnte. Ein erneuter Versuch dieses Vorgangs k\u00f6nnte erfolgreich sein.
SEC_ERROR_PKCS11_DEVICE_ERROR=Ein PKCS-\#11-Modul lieferte CKR_DEVICE_ERROR, was ein Problem anzeigt, das mit dem Token oder Slot aufgetreten ist.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Unbekannte Informations-Zugriff-Methode in Zertifikatserweiterung.
SEC_ERROR_CRL_IMPORT_FAILED=Fehler beim Versuch, eine CRL zu importieren.
SEC_ERROR_EXPIRED_PASSWORD=Das Passwort ist erloschen.
SEC_ERROR_LOCKED_PASSWORD=Das Passwort ist gesperrt.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Unbekannter PKCS-\#11-Fehler.
SEC_ERROR_BAD_CRL_DP_URL=Ung\u00fcltige oder nicht unterst\u00fctzte URL im CRL-Verteilungspunkt-Namen.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Das Zertifikat wurde mit einem Signatur-Algorithmus signiert, der deaktiviert ist, weil er nicht sicher ist.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

