#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL je neispravan i ne mo\u017ee biti u\u010ditan.
fileNotFound=Datoteku %S nije mogu\u0107e na\u0107i. Provjerite lokaciju i poku\u0161ajte ponovo.
dnsNotFound=%S nije mogu\u0107e na\u0107i. Provjerite ime i poku\u0161ajte ponovo.
protocolNotFound=%S nije registrirani protokol.
connectionFailure=Veza je odbijena pri poku\u0161aju povezivanja s %S.
netInterrupt=Veza prema %S je neo\u010dekivano prekinuta. Dio podataka je vjerovatno prene\u0161en.
netTimeout=Predugo \u010dekanje pri povezivanju s %S.
redirectLoop=Prije\u0111ena je granica preusmjeravanja za ovaj URL. Tra\u017eenu stranicu nije mogu\u0107e u\u010ditati. Uzrok mogu predstavljati blokirani kola\u010di\u0107i.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Za prikaz ove stranice, %S mora ponovo poslati informacije koje \u0107e ponoviti prethodne postupke (poput tra\u017eenja ili povrde narud\u017ebe).
resendButton.label=U redu
unknownSocketType=Ovaj dokument ne mo\u017ee biti prikazan ako ne instalirate Personal Security Manager (PSM). Preuzmite i instalirajte PSM i probajte ponovo, ili kontaktirajte va\u0161eg administratora sustava.
netReset=Dokument ne sadr\u017ei podatke.
notCached=Ovaj dokument vi\u0161e nije dostupan.
netOffline=Ovaj dokument ne mo\u017ee biti prikazan u izvanmre\u017enom na\u010dinu rada. Da biste onemogu\u0107ili izvanmre\u017eni na\u010din rada, u izborniku Datoteka odzna\u010dite Izvanmre\u017eni rad.
isprinting=Dokument se ne mo\u017ee mijenjati dok se ispisuje ili dok je u Pregledu prije ispisa.
deniedPortAccess=Pristup broju porta je onemogu\u0107en zbog sigurnosnih razloga.
proxyResolveFailure=Proxy poslu\u017eitelj kojeg ste podesili ne mo\u017ee biti prona\u0111en. Molim vas provjerite va\u0161e proxy postavke i probajte ponovno.
proxyConnectFailure=Veza je odbijena pri poku\u0161aju kontaktiranja proxy poslu\u017eitelja kojeg ste podesili. Molim vas, provjerite va\u0161e proxy postavke i poku\u0161ajte ponovno.
contentEncodingError=Stranica koju poku\u0161avate otvoriti ne mo\u017ee biti prikazana jer koristi nepostoje\u0107e ili nepodr\u017eane oblike sa\u017eimanja.
unsafeContentType=Stranica koju poku\u0161avate otvoriti ne mo\u017ee biti prikazana jer sadr\u017ei tip datoteke koji nije sigurno otvarati. Molim, kontaktirajte vlasnike stranice i informirajte ih o ovom problemu.
externalProtocolTitle=Zahtjev za vanjski protokol
externalProtocolPrompt=Vanjska aplikacija mora biti pokrenuta za upravljanje %1$S\: poveznicama.\n\n\nZatra\u017eena poveznica\:\n\n%2$S\n\nAplikacija\: %3$S\n\n\nAko niste o\u010dekivali ovaj zahtjev, postoji mogu\u0107nost da je ovo poku\u0161aj iskori\u0161tavanja nedostatka u tom drugom programu. Otka\u017eite ovaj zahtjev ukoliko niste sigurni da on nije maliciozan.
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Nepoznato>
externalProtocolChkMsg=Zapamti moj izbor za sve poveznice ove vrste.
externalProtocolLaunchBtn=Pokreni aplikaciju
malwareBlocked=Web stranica %S je prijavljena kao zlo\u0107udna stranica i blokirana je na temelju va\u0161ih sigurnosnih postavki.
phishingBlocked=Web stranica %S je prijavljena kao web krivotvorina, osmi\u0161ljena kako bi vas navela na otkrivanje osobnih ili financijskih informacija.
cspFrameAncestorBlocked=Ova stranica ima definiranu sigurnosnu politiku sadr\u017eaja koja sprje\u010dava da se stranica ugra\u0111uje na ovaj na\u010din.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Stranicu kojoj poku\u0161avate pristupiti nije mogu\u0107e prikazati zbog gre\u0161ke u prijenosu podataka.
remoteXUL=Ova stranica koristi nepodr\u017eanu tehnologiju, koja ne vi\u0161e ne dolazi uz Pale Moon.

