#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=%S sa ned\u00e1 ulo\u017ei\u0165, preto\u017ee zdrojov\u00fd s\u00fabor sa ned\u00e1 \u010d\u00edta\u0165.
writeError=%S sa ned\u00e1 ulo\u017ei\u0165, preto\u017ee do\u0161lo k nezn\u00e1mej chybe.\n\nSk\u00faste dokument ulo\u017ei\u0165 na in\u00e9 miesto.
launchError=%S sa ned\u00e1 otvori\u0165, preto\u017ee do\u0161lo k nezn\u00e1mej chybe.
diskFull=Na disku nie je dos\u0165 miesta na ulo\u017eenie %S.\n\nUvo\u013enite na disku viac miesta a sk\u00faste to znova, alebo sk\u00faste dokument ulo\u017ei\u0165 niekam inam.
readOnly=%S sa ned\u00e1 ulo\u017ei\u0165, preto\u017ee disk, prie\u010dinok, alebo s\u00fabor s\u00fa chr\u00e1nen\u00e9 proti z\u00e1pisu.
accessError=%S sa ned\u00e1 ulo\u017ei\u0165, preto\u017ee nem\u00e1te pr\u00e1vo meni\u0165 obsah cie\u013eov\u00e9ho prie\u010dinka.\n\nZme\u0148te vlastnosti prie\u010dinka a sk\u00faste to znova, alebo sk\u00faste ulo\u017ei\u0165 dokument na in\u00e9 miesto.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=%S sa ned\u00e1 otvori\u0165, preto\u017ee asociovan\u00e1 pomocn\u00e1 aplik\u00e1cia neexistuje. Zme\u0148te nastavenie v predvo\u013eb\u00e1ch.
noMemory=Na vykonanie po\u017eadovanej akcie nie je dos\u0165 opera\u010dnej pam\u00e4te. \n\nUkon\u010dite niektor\u00e9 aplik\u00e1cie a sk\u00faste to znova.
title=Preber\u00e1 sa %S
fileAlreadyExistsError=Str\u00e1nka %S nemohla by\u0165 ulo\u017een\u00e1, preto\u017ee u\u017e existuje s\u00fabor s rovnak\u00fdm n\u00e1zvom ako prie\u010dinok '_subory'.\n\nSk\u00faste ulo\u017ei\u0165 do in\u00e9ho prie\u010dinku.
fileNameTooLongError=Str\u00e1nka %S nemohla by\u0165 ulo\u017een\u00e1, preto\u017ee n\u00e1zov s\u00faboru je pr\u00edli\u0161 dlh\u00fd.\n\nSk\u00faste ulo\u017ei\u0165 s krat\u0161\u00edm n\u00e1zvom s\u00faboru.\#\#@@\\workdir\\sk\\chrome\\AB-CD\\locale\\AB-CD\\global\\plugins.properties@@\#\#

