#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=L'URL n'est pas correcte et ne peut pas \u00eatre charg\u00e9e.
fileNotFound=Pale Moon ne peut pas trouver le fichier \u00e0 l'adresse %S.
dnsNotFound=Pale Moon ne peut pas trouver le serveur \u00e0 l'adresse %S.
protocolNotFound=Pale Moon ne sait pas ouvrir cette adresse car le protocole (%S) n'est associ\u00e9 \u00e0 aucun programme.
connectionFailure=Pale Moon ne peut pas \u00e9tablir de connexion avec le serveur \u00e0 l'adresse %S.
netInterrupt=La connexion avec %S a \u00e9t\u00e9 interrompue pendant le chargement de la page.
netTimeout=Le serveur \u00e0 l'adresse %S met trop de temps \u00e0 r\u00e9pondre.
redirectLoop=Pale Moon a d\u00e9tect\u00e9 que le serveur redirige la demande pour cette adresse d'une mani\u00e8re qui n'aboutira pas.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Pour afficher cette page, les informations pr\u00e9c\u00e9demment transmises par %S doivent \u00eatre renvoy\u00e9es. Ceci r\u00e9p\u00e9tera toute action (telle qu'une recherche ou un ordre d'achat) entreprise pr\u00e9c\u00e9demment.
resendButton.label=Renvoyer
unknownSocketType=Pale Moon ne sait pas comment entrer en contact avec le serveur.
netReset=La connexion avec le serveur a \u00e9t\u00e9 r\u00e9initialis\u00e9e pendant le chargement de la page.
notCached=Ce document n'est plus disponible.
netOffline=Pale Moon est actuellement en mode hors connexion et ne peut pas acc\u00e9der \u00e0 Internet.
isprinting=Le document ne peut pas \u00eatre modifi\u00e9 pendant l'impression ou la pr\u00e9visualisation.
deniedPortAccess=Cette adresse utilise un port r\u00e9seau normalement utilis\u00e9 pour d'autres usages que la navigation. Par mesure de s\u00e9curit\u00e9, Pale Moon a abandonn\u00e9 la requ\u00eate.
proxyResolveFailure=Pale Moon est configur\u00e9 pour utiliser un serveur proxy mais celui-ci est introuvable.
proxyConnectFailure=Pale Moon est configur\u00e9 pour utiliser un serveur proxy mais celui-ci n'accepte pas les connexions.
contentEncodingError=La page demand\u00e9e ne peut \u00eatre affich\u00e9e car elle utilise un type de compression non valable ou non pris en charge.
unsafeContentType=La page demand\u00e9e ne peut \u00eatre affich\u00e9e car elle contient un type de fichier dont l'ouverture n'est peut-\u00eatre pas s\u00fbre. Merci de contacter les propri\u00e9taires du site visit\u00e9 pour les informer de ce probl\u00e8me.
externalProtocolTitle=Requ\u00eate de protocole externe
externalProtocolPrompt=Une application externe doit \u00eatre lanc\u00e9e pour g\u00e9rer les liens de type %1$S\:.\n\n\nLien demand\u00e9\u00a0\:\n\n%2$S\n\nApplication\u00a0\: %3$S\n\n\nSi cette requ\u00eate n'\u00e9tait pas attendue, il peut s'agir d'une tentative d'exploitation de vuln\u00e9rabilit\u00e9 dans cette application. Il est conseill\u00e9 d'annuler cette requ\u00eate sauf en cas de certitude qu'elle n'est pas malveillante.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Application inconnue>
externalProtocolChkMsg=Se souvenir de ce choix pour tous les liens de ce type.
externalProtocolLaunchBtn=Lancer l'application
malwareBlocked=Le site \u00e0 %S a \u00e9t\u00e9 signal\u00e9 comme une source d'attaques et a \u00e9t\u00e9 bloqu\u00e9 suivant les pr\u00e9f\u00e9rences de s\u00e9curit\u00e9.
phishingBlocked=Le site \u00e0 %S a \u00e9t\u00e9 signal\u00e9 comme \u00e9tant une contrefa\u00e7on con\u00e7ue pour pi\u00e9ger les utilisateurs afin qu'ils partagent des informations personnelles ou financi\u00e8res.
cspFrameAncestorBlocked=Cette page a une strat\u00e9gie de s\u00e9curit\u00e9 de contenu qui l'emp\u00eache d'\u00eatre int\u00e9gr\u00e9e de cette fa\u00e7on.
xssBlockMode=Cette page contient une attaque XSS qui a \u00e9t\u00e9 bloqu\u00e9e par mesure de s\u00e9curit\u00e9.
corruptedContentError=La page demand\u00e9e ne peut pas \u00eatre affich\u00e9e car une erreur dans la transmission de donn\u00e9es a \u00e9t\u00e9 d\u00e9tect\u00e9e.
remoteXUL=Cette page utilise une ancienne technologie qui n'est plus disponible par d\u00e9faut dans Pale Moon.

