#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Incapaz de comunicar de forma segura. A outra m\u00e1quina n\u00e3o suporta uma cifra de qualidade.
SSL_ERROR_US_ONLY_SERVER=Incapaz de comunicar de forma segura. A outra m\u00e1quina requer uma cifra superior n\u00e3o suportada.
SSL_ERROR_NO_CYPHER_OVERLAP=Incapaz de comunicar de forma segura com a outra m\u00e1quina\: nenhum algoritmo criptogr\u00e1fico comum.
SSL_ERROR_NO_CERTIFICATE=Incapaz de encontrar o certificado ou chave necess\u00e1rios para a autentica\u00e7\u00e3o.
SSL_ERROR_BAD_CERTIFICATE=Incapaz de comunicar de forma segura com a outra m\u00e1quina\: o certificado da outra m\u00e1quina foi rejeitado.
SSL_ERROR_UNUSED_5=C\u00f3digo de erro SSL desconhecido.
SSL_ERROR_BAD_CLIENT=O servidor encontrou dados do cliente danificados.
SSL_ERROR_BAD_SERVER=O cliente encontrou dados do servidor danificados.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Tipo de certificado n\u00e3o suportado.
SSL_ERROR_UNSUPPORTED_VERSION=Outra m\u00e1quina usa vers\u00e3o de protocolo de seguran\u00e7a n\u00e3o suportada.
SSL_ERROR_UNUSED_10=C\u00f3digo de erro SSL desconhecido.
SSL_ERROR_WRONG_CERTIFICATE=Autentica\u00e7\u00e3o do cliente falhou\: chave privada na base de dados de chaves n\u00e3o corresponde \u00e0 chave p\u00fablica na base de dados de certificados.
SSL_ERROR_BAD_CERT_DOMAIN=Incapaz de comunicar com a outra m\u00e1quina\: dom\u00ednio pedido n\u00e3o corresponde ao certificado do servidor.
SSL_ERROR_POST_WARNING=C\u00f3digo de erro SSL desconhecido.
SSL_ERROR_SSL2_DISABLED=A outra m\u00e1quina s\u00f3 suporta SSL vers\u00e3o 2, que est\u00e1 inibida nesta configura\u00e7\u00e3o.
SSL_ERROR_BAD_MAC_READ=SSL recebeu um registo com um C\u00f3digo de Mensagem de Autentica\u00e7\u00e3o incorrecto.
SSL_ERROR_BAD_MAC_ALERT=A outra m\u00e1quina SSL reporta um C\u00f3digo de Mensagem de Autentica\u00e7\u00e3o incorrecto.
SSL_ERROR_BAD_CERT_ALERT=A outra m\u00e1quina SSL n\u00e3o consegue verificar o seu certificado.
SSL_ERROR_REVOKED_CERT_ALERT=A outra m\u00e1quina SSL rejeitou o seu certificado como revogado.
SSL_ERROR_EXPIRED_CERT_ALERT=A outra m\u00e1quina SSL rejeitou o seu certificado como expirado.
SSL_ERROR_SSL_DISABLED=Imposs\u00edvel ligar\: SSL est\u00e1 desligado.
SSL_ERROR_FORTEZZA_PQG=Imposs\u00edvel ligar\: a outra m\u00e1quina SSL est\u00e1 noutro dom\u00ednio FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Foi pedida uma combina\u00e7\u00e3o de cifras SSL desconhecida.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Nenhuma combina\u00e7\u00e3o de cifras est\u00e1 presente e habilitada nesta aplica\u00e7\u00e3o.
SSL_ERROR_BAD_BLOCK_PADDING=SSL recebeu um registo com enchimento de bloco errado.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL recebeu um registo que excedeu o tamanho m\u00e1ximo permitido.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL tentou enviar um registo que excedeu o tamanho m\u00e1ximo permitido.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL recebeu uma mensagem de Pedido de Apresenta\u00e7\u00e3o mal formada.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL recebeu uma mensagem de Apresenta\u00e7\u00e3o de Cliente mal formada.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL recebeu uma mensagem de Apresenta\u00e7\u00e3o de Servidor mal formada.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL recebeu uma mensagem de Certificado mal formada.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL recebeu uma mensagem de Troca de Chave de Servidor mal formada.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL recebeu uma mensagem de Pedido de Certificado mal formada.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL recebeu uma mensagem de Apresenta\u00e7\u00e3o de Servidor Terminada mal formada.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL recebeu uma mensagem de Verifica\u00e7\u00e3o de Certificado mal formada.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL recebeu uma mensagem de Interc\u00e2mbio de Chave de Cliente mal formada.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL recebeu uma mensagem de Troca Acabada mal formada.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL recebeu um registo de Troca de Especifica\u00e7\u00e3o de Cifra mal formado.
SSL_ERROR_RX_MALFORMED_ALERT=SSL recebeu um registo de Alerta mal formado.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL recebeu um registo de Liga\u00e7\u00e3o mal formado.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL recebeu um registo de Dados Aplicacionais mal formado.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL recebeu uma mensagem de Pedido de Apresenta\u00e7\u00e3o inesperada.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL recebeu uma mensagem de Apresenta\u00e7\u00e3o de Cliente inesperada.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL recebeu uma mensagem de Apresenta\u00e7\u00e3o de Servidor inesperada.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL recebeu uma mensagem de Certificado inesperada.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL recebeu uma mensagem de Interc\u00e2mbio de Chave de Servidor inesperada.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL recebeu uma mensagem de Pedido de Certificado inesperada.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL recebeu uma mensagem de Apresenta\u00e7\u00e3o de Servidor Terminada inesperada.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL recebeu uma mensagem de Verifica\u00e7\u00e3o de Certificado inesperada.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL recebeu uma mensagem de Interc\u00e2mbio de Chave de Cliente inesperada.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL recebeu uma mensagem de Troca Acabada inesperada.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL recebeu um registo de Troca de Especifica\u00e7\u00e3o de Cifra inesperado.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL recebeu um registo de Alerta inesperado.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL recebeu um registo de Liga\u00e7\u00e3o inesperado.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL recebeu um registo de Dados Aplicacionais inesperado.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL recebeu um registo com um tipo de conte\u00fado desconhecido.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL recebeu uma mensagem de liga\u00e7\u00e3o com um tipo de mensagem desconhecido.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL recebeu um registo de alerta com uma descri\u00e7\u00e3o desconhecida.
SSL_ERROR_CLOSE_NOTIFY_ALERT=A outra m\u00e1quina SSL fechou esta liga\u00e7\u00e3o.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=A outra m\u00e1quina SSL n\u00e3o esperava a mensagem de liga\u00e7\u00e3o que recebeu.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=A outra m\u00e1quina SSL foi incapaz de descomprimir um registo SSL que recebeu.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=A outra m\u00e1quina SSL foi incapaz de negociar um conjunto aceit\u00e1vel de par\u00e2metros de seguran\u00e7a.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=A outra m\u00e1quina SSL rejeitou uma mensagem de liga\u00e7\u00e3o devido a conte\u00fado inaceit\u00e1vel.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=A outra m\u00e1quina SSL n\u00e3o suporta certificados do tipo que recebeu.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=A outra m\u00e1quina SSL tem um problema n\u00e3o especificado com o certificado que recebeu.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL teve uma falha no gerador de n\u00fameros aleat\u00f3rios.
SSL_ERROR_SIGN_HASHES_FAILURE=Falha ao assinar os dados necess\u00e1rios para verificar o seu certificado.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL foi incapaz de extrair a chave p\u00fablica do certificado da outra m\u00e1quina.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Falha n\u00e3o especificada ao processar a liga\u00e7\u00e3o SSL de Interc\u00e2mbio de Chave de Servidor.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Falha n\u00e3o especificada ao processar a liga\u00e7\u00e3o SSL de Interc\u00e2mbio de Chave de Cliente.
SSL_ERROR_ENCRYPTION_FAILURE=A codifica\u00e7\u00e3o dos dados do algoritmo de cifra falhou no pacote de cifra seleccionado.
SSL_ERROR_DECRYPTION_FAILURE=A descodifica\u00e7\u00e3o dos dados do algoritmo de decifra\u00e7\u00e3o falhou no pacote de cifra seleccionado.
SSL_ERROR_SOCKET_WRITE_FAILURE=A tentativa de escrever dados cifrados para o pacote de cifra falhou.
SSL_ERROR_MD5_DIGEST_FAILURE=A fun\u00e7\u00e3o de resumo MD5 falhou.
SSL_ERROR_SHA_DIGEST_FAILURE=A fun\u00e7\u00e3o de resumo SHA-1 falhou.
SSL_ERROR_MAC_COMPUTATION_FAILURE=A computa\u00e7\u00e3o MAC falhou.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Falha ao criar o contexto da chave sim\u00e9trica.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Falha ao desocultar a chave sim\u00e9trica na mensagem de interc\u00e2mbio de chave de cliente.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=O servidor SSL tentou utilizar uma chave p\u00fablica dom\u00e9stica com a exporta\u00e7\u00e3o de pacote de cifra.
SSL_ERROR_IV_PARAM_FAILURE=O c\u00f3digo PKCS11 falhou a tradu\u00e7\u00e3o de um IV para um param.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Falhou a inicializa\u00e7\u00e3o do pacote de cifra seleccionado.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=O cliente falhou a cria\u00e7\u00e3o de chaves de sess\u00e3o para a sess\u00e3o SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=O servidor n\u00e3o tem chave para a tentativa de interc\u00e2mbio de algoritmo de chave.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=O token PKCS\#11 foi inserido ou removido enquanto a opera\u00e7\u00e3o estava em curso.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=N\u00e3o foi encontrado nenhum token PKCS\#11 para a opera\u00e7\u00e3o requerida.
SSL_ERROR_NO_COMPRESSION_OVERLAP=N\u00e3o \u00e9 poss\u00edvel comunicar de forma segura com o par\: n\u00e3o h\u00e1 nenhum algoritmo(s) comum(ns) de compress\u00e3o.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=N\u00e3o \u00e9 poss\u00edvel iniciar outra liga\u00e7\u00e3o SSL at\u00e9 que a liga\u00e7\u00e3o actual seja terminada.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Recebido do par um handshake de hash incorrecto.
SSL_ERROR_CERT_KEA_MISMATCH=O certificado recebido n\u00e3o pode ser utilizado com o algoritmo de interc\u00e2mbio de chave fornecido.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Nenhuma autoridades de certifica\u00e7\u00e3o \u00e9 fi\u00e1vel para a autentica\u00e7\u00e3o SSL do cliente.
SSL_ERROR_SESSION_NOT_FOUND=O ID da sess\u00e3o SSL do Cliente n\u00e3o foi encontrada na cache de sess\u00e3o do servidor.
SSL_ERROR_DECRYPTION_FAILED_ALERT=O par n\u00e3o conseguiu decifrar a grava\u00e7\u00e3o SSL que recebeu.
SSL_ERROR_RECORD_OVERFLOW_ALERT=O par recebeu uma ficha SSL maior que o permitido.
SSL_ERROR_UNKNOWN_CA_ALERT=O par n\u00e3o reconhece nem confia na AC que emitiu o seu certificado.
SSL_ERROR_ACCESS_DENIED_ALERT=O par recebeu um certificado v\u00e1lido, mas o acesso foi negado.
SSL_ERROR_DECODE_ERROR_ALERT=O par n\u00e3o conseguiu descodificar a mensagem SSL de handshake.
SSL_ERROR_DECRYPT_ERROR_ALERT=O par indicou uma falha na verifica\u00e7\u00e3o da assinatura ou interc\u00e2mbio de chave.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=O par indica uma negocia\u00e7\u00e3o em desacordo com os regulamentos de exporta\u00e7\u00e3o.
SSL_ERROR_PROTOCOL_VERSION_ALERT=O par indica uma vers\u00e3o do protocolo n\u00e3o suportada ou incompat\u00edvel.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=O servidor necessita de cifra mais segura do que a suportada pelo cliente.
SSL_ERROR_INTERNAL_ERROR_ALERT=O par indicou que teve um erro interno.
SSL_ERROR_USER_CANCELED_ALERT=O utilizador do par cancelou o handshake.
SSL_ERROR_NO_RENEGOTIATION_ALERT=O par n\u00e3o permite a re-negocia\u00e7\u00e3o dos par\u00e2metros de seguran\u00e7a SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Cache do servidor SSL n\u00e3o configurado e n\u00e3o desactivado para este socket.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=O par SSL n\u00e3o suporta o pedido TLS com extens\u00e3o da apresenta\u00e7\u00e3o.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=O par SSL n\u00e3o consegui obter o seu certificado a partir do URL fornecido.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=O par SSL n\u00e3o tem um certificado para o nome DNS pedido.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=O par SSL n\u00e3o conseguiu obter uma resposta OCSP para este certificado.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=O par SSL indicou um erro na hash do certificado.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=O SSL recebeu uma mensagem de handshake de nova sess\u00e3o inesperada.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=O SSL recebeu uma mensagem de handshake de nova sess\u00e3o mal formada.
SSL_ERROR_DECOMPRESSION_FAILURE=O SSL recebeu um registo comprimido que n\u00e3o pode ser descomprimido.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=A renegocia\u00e7\u00e3o n\u00e3o \u00e9 permitida neste socket SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=A outra m\u00e1quina tentou um handshake ao estilo antigo (potencialmente vulner\u00e1vel).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL recebeu um registo inesperado n\u00e3o comprimido.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=O SSL recebeu uma chave fraca e ef\u00e9mera Diffie-Hellman na mensagem de handshake da chave do servidor de troca.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=O SSL recebeu dados de extens\u00e3o NPN inv\u00e1lidos.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Funcionalidade SSL n\u00e3o suportada para liga\u00e7\u00f5es SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=A funcionalidade SSL n\u00e3o \u00e9 suportada para servidores.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=funcionalidade SSL n\u00e3o \u00e9 suportada para clientes.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Ocorreu um erro de E/S durante a autoriza\u00e7\u00e3o de seguran\u00e7a.
SEC_ERROR_LIBRARY_FAILURE=falha na biblioteca de seguran\u00e7a.
SEC_ERROR_BAD_DATA=biblioteca de seguran\u00e7a\: recep\u00e7\u00e3o de dados errados.
SEC_ERROR_OUTPUT_LEN=biblioteca de seguran\u00e7a\: erro no comprimento de sa\u00edda.
SEC_ERROR_INPUT_LEN=A biblioteca de seguran\u00e7a teve um erro no comprimento de entrada.
SEC_ERROR_INVALID_ARGS=biblioteca de seguran\u00e7a\: argumentos inv\u00e1lidos.
SEC_ERROR_INVALID_ALGORITHM=biblioteca de seguran\u00e7a\: algoritmo inv\u00e1lido.
SEC_ERROR_INVALID_AVA=biblioteca de seguran\u00e7a\: AVA inv\u00e1lido.
SEC_ERROR_INVALID_TIME=Caracteres com a hora formatados incorrectamente.
SEC_ERROR_BAD_DER=biblioteca de seguran\u00e7a\: formata\u00e7\u00e3o incorrecta da mensagem com codifica\u00e7\u00e3o DER.
SEC_ERROR_BAD_SIGNATURE=O certificado do par tem uma assinatura inv\u00e1lida.
SEC_ERROR_EXPIRED_CERTIFICATE=O Certificado do par expirou.
SEC_ERROR_REVOKED_CERTIFICATE=O Certificado do par foi anulado.
SEC_ERROR_UNKNOWN_ISSUER=O emissor do certificado do par n\u00e3o \u00e9 reconhecido.
SEC_ERROR_BAD_KEY=A chave p\u00fablica do par \u00e9 inv\u00e1lida.
SEC_ERROR_BAD_PASSWORD=A senha de seguran\u00e7a introduzida est\u00e1 incorrecta.
SEC_ERROR_RETRY_PASSWORD=A nova senha foi introduzida incorrectamente.  Por favor tente de novo.
SEC_ERROR_NO_NODELOCK=biblioteca de seguran\u00e7a\: sem n\u00f3 trancado.
SEC_ERROR_BAD_DATABASE=biblioteca de seguran\u00e7a\: base de dados corrompida.
SEC_ERROR_NO_MEMORY=biblioteca de seguran\u00e7a\: falha na atribui\u00e7\u00e3o de mem\u00f3ria.
SEC_ERROR_UNTRUSTED_ISSUER=O emissor do certificado do par foi marcado como n\u00e3o sendo de confian\u00e7a pelo utilizador.
SEC_ERROR_UNTRUSTED_CERT=O certificado do par foi marcado como n\u00e3o sendo de confian\u00e7a pelo utilizador.
SEC_ERROR_DUPLICATE_CERT=O certificado j\u00e1 existe na sua base de dados.
SEC_ERROR_DUPLICATE_CERT_NAME=O nome do certificado transferido \u00e9 igual a um j\u00e1 existente na sua base de dados.
SEC_ERROR_ADDING_CERT=Erro ao adicionar o certificado \u00e0 base de dados.
SEC_ERROR_FILING_KEY=Erro ao preencher a chave para este certificado.
SEC_ERROR_NO_KEY=A chave privada para este certificado n\u00e3o foi encontrado na sua base de dados
SEC_ERROR_CERT_VALID=Este certificado \u00e9 v\u00e1lido.
SEC_ERROR_CERT_NOT_VALID=Este certificado n\u00e3o \u00e9 v\u00e1lido.
SEC_ERROR_CERT_NO_RESPONSE=Biblioteca Cert\: Sem resposta
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=O certificado do emissor do certificado expirou.  Verifique a data e hora do seu sistema.
SEC_ERROR_CRL_EXPIRED=A CRL para emissores de certificados expirou.  Actualize ou verifique a data e hora do seu sistema.
SEC_ERROR_CRL_BAD_SIGNATURE=A CRL para emissores de certificados tem uma assinatura inv\u00e1lida.
SEC_ERROR_CRL_INVALID=A nova CRL tem um formato inv\u00e1lido.
SEC_ERROR_EXTENSION_VALUE_INVALID=O valor da extens\u00e3o do certificado \u00e9 inv\u00e1lido.
SEC_ERROR_EXTENSION_NOT_FOUND=Extens\u00e3o do certificado n\u00e3o encontrada.
SEC_ERROR_CA_CERT_INVALID=O emissor do certificado \u00e9 inv\u00e1lido.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=A restri\u00e7\u00e3o ao comprimento do caminho para o certificado \u00e9 inv\u00e1lida.
SEC_ERROR_CERT_USAGES_INVALID=O campo de utiliza\u00e7\u00e3o do certificado \u00e9 inv\u00e1lido.
SEC_INTERNAL_ONLY=**APENAS m\u00f3dulo interno**
SEC_ERROR_INVALID_KEY=A chave n\u00e3o suporta a opera\u00e7\u00e3o pedida.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=O certificado cont\u00e9m uma extens\u00e3o cr\u00edtica desconhecida.
SEC_ERROR_OLD_CRL=A nova CRL n\u00e3o \u00e9 mais recente que a actual.
SEC_ERROR_NO_EMAIL_CERT=N\u00e3o est\u00e1 cifrado ou assinado\: voc\u00ea ainda n\u00e3o tem um certificado de correio electr\u00f3nico.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=N\u00e3o cifrado\: n\u00e3o tem certificados para cada um dos remetentes.
SEC_ERROR_NOT_A_RECIPIENT=N\u00e3o \u00e9 poss\u00edvel decifrar\: n\u00e3o \u00e9 remetente, ou certificado correspondente e chave privada n\u00e3o foram encontrados.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=N\u00e3o \u00e9 poss\u00edvel decifrar\: o algoritmo de cifra de chave n\u00e3o iguala o seu certificado.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Falhou a verifica\u00e7\u00e3o da assinatura\: nenhum assinante encontrado, encontrados demasiados assinantes, ou dados impr\u00f3prios ou corrompidos.
SEC_ERROR_UNSUPPORTED_KEYALG=Algoritmo da chave desconhecido ou n\u00e3o suportado.
SEC_ERROR_DECRYPTION_DISALLOWED=N\u00e3o \u00e9 poss\u00edvel decifrar\: utilizado um algoritmo ou tamanho da chave n\u00e3o permitidos na cifra.
XP_SEC_FORTEZZA_BAD_CARD=O cart\u00e3o Fortezza n\u00e3o foi iniciado correctamente.  Por favor remova-o e devolva-o ao seu emissor.
XP_SEC_FORTEZZA_NO_CARD=N\u00e3o foram encontrados cart\u00f5es Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=Nenhum cart\u00e3o Fortezza seleccionado
XP_SEC_FORTEZZA_MORE_INFO=Por favor escolha uma personalidade a obter informa\u00e7\u00f5es
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Personalidade n\u00e3o encontrada
XP_SEC_FORTEZZA_NO_MORE_INFO=N\u00e3o existe mais informa\u00e7\u00e3o sobre essa Personalidade
XP_SEC_FORTEZZA_BAD_PIN=Pin inv\u00e1lido
XP_SEC_FORTEZZA_PERSON_ERROR=Incapaz de inicializar personalidades Fortezza.
SEC_ERROR_NO_KRL=N\u00e3o foi encontrado nenhum KRL para o certificado deste s\u00edtio.
SEC_ERROR_KRL_EXPIRED=O KRL para o certificado deste s\u00edtio expirou.
SEC_ERROR_KRL_BAD_SIGNATURE=O KRL para o certificado deste s\u00edtio tem uma assinatura inv\u00e1lida.
SEC_ERROR_REVOKED_KEY=A chave para este certificado foi anulada.
SEC_ERROR_KRL_INVALID=O novo KRL tem um formato inv\u00e1lido.
SEC_ERROR_NEED_RANDOM=biblioteca de seguran\u00e7a\: necessita de dados aleat\u00f3rios.
SEC_ERROR_NO_MODULE=biblioteca de seguran\u00e7a\: nenhum m\u00f3dulo de seguran\u00e7a pode efectuar a opera\u00e7\u00e3o pedida.
SEC_ERROR_NO_TOKEN=o cart\u00e3o de seguran\u00e7a ou token n\u00e3o existe, precisa de ser inicializado ou foi removido.
SEC_ERROR_READ_ONLY=biblioteca de seguran\u00e7a\: base de dados apenas de leitura.
SEC_ERROR_NO_SLOT_SELECTED=Nenhuma ranhura ou token seleccionado.
SEC_ERROR_CERT_NICKNAME_COLLISION=J\u00e1 existe um certificado com a mesma alcunha.
SEC_ERROR_KEY_NICKNAME_COLLISION=J\u00e1 existe uma senha com a mesma alcunha.
SEC_ERROR_SAFE_NOT_CREATED=erro ao criar o objecto seguro
SEC_ERROR_BAGGAGE_NOT_CREATED=erro ao criar objecto bagagem
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Incapaz de remover o principal
XP_JAVA_DELETE_PRIVILEGE_ERROR=Incapaz de apagar o privil\u00e9gio
XP_JAVA_CERT_NOT_EXISTS_ERROR=Este "principal" n\u00e3o tem um certificado
SEC_ERROR_BAD_EXPORT_ALGORITHM=Algoritmo requerido n\u00e3o \u00e9 permitido.
SEC_ERROR_EXPORTING_CERTIFICATES=Erro ao tentar exportar certificados.
SEC_ERROR_IMPORTING_CERTIFICATES=Erro ao tentar importar certificados.
SEC_ERROR_PKCS12_DECODING_PFX=Incapaz de importar.  Erro de descodifica\u00e7\u00e3o.  Ficheiro inv\u00e1lido.
SEC_ERROR_PKCS12_INVALID_MAC=Incapaz de importar.  MAC inv\u00e1lido.  Senha incorrecta ou ficheiro corrupto.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Incapaz de importar.  Algoritmo MAC n\u00e3o suportado.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Incapaz de importar.  Apenas integridade de senha e modos de privacidade suportados.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Incapaz de importar.  A estrutura do ficheiro est\u00e1 danificada.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Incapaz de importar.  O algoritmo de encripta\u00e7\u00e3o n\u00e3o \u00e9 suportado.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Incapaz de importar.  A vers\u00e3o do ficheiro n\u00e3o \u00e9 suportada.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Incapaz de importar.  Senha de privacidade incorrecta.
SEC_ERROR_PKCS12_CERT_COLLISION=Incapaz de importar.  A mesma alcunha j\u00e1 existe na base de dados.
SEC_ERROR_USER_CANCELLED=O utilizador pressionou cancelar.
SEC_ERROR_PKCS12_DUPLICATE_DATA=N\u00e3o importada, j\u00e1 existe na base de dados.
SEC_ERROR_MESSAGE_SEND_ABORTED=Mensagem n\u00e3o enviada.
SEC_ERROR_INADEQUATE_KEY_USAGE=Utiliza\u00e7\u00e3o da chave do certificado inadequada para a opera\u00e7\u00e3o pretendida.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tipo de certificado n\u00e3o aprovado para a aplica\u00e7\u00e3o.
SEC_ERROR_CERT_ADDR_MISMATCH=Endere\u00e7o do certificado signat\u00e1rio n\u00e3o corresponde ao endere\u00e7o no cabe\u00e7alho da mensagem.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Incapaz de importar.  Erro ao tentar importar chave privada.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Incapaz de importar.  Erro ao tentar importar cadeia de certificados.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Incapaz de exportar.  Incapaz de localizar certificado ou chave pela alcunha.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Incapaz de exportar.  Chave privada n\u00e3o p\u00f4de ser localizada e exportada.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Incapaz de exportar.  Incapaz de escrever o ficheiro a exportar.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Incapaz de importar.  Incapaz de ler o ficheiro a importar.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Incapaz de exportar.  A base de dados das chaves est\u00e1 corrupta ou foi apagada.
SEC_ERROR_KEYGEN_FAIL=Incapaz de gerar um par de chaves p\u00fablicas/privadas.
SEC_ERROR_INVALID_PASSWORD=A senha introduzida \u00e9 inv\u00e1lida.  Por favor escolha uma diferente.
SEC_ERROR_RETRY_OLD_PASSWORD=A senha antiga foi introduzida incorrectamente.  Por favor tente de novo.
SEC_ERROR_BAD_NICKNAME=A alcunha do Certificado j\u00e1 est\u00e1 a ser utilizado.
SEC_ERROR_NOT_FORTEZZA_ISSUER=A cadeia de pares FORTEZZA possui um certificado n\u00e3o FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Uma chave cr\u00edtica n\u00e3o p\u00f4de ser movida para a ranhura onde \u00e9 necess\u00e1ria.
SEC_ERROR_JS_INVALID_MODULE_NAME=Nome de m\u00f3dulo inv\u00e1lido.
SEC_ERROR_JS_INVALID_DLL=Caminho/nome de ficheiro de m\u00f3dulo inv\u00e1lido.
SEC_ERROR_JS_ADD_MOD_FAILURE=Incapaz de adicionar o m\u00f3dulo.
SEC_ERROR_JS_DEL_MOD_FAILURE=Incapaz de eliminar o m\u00f3dulo.
SEC_ERROR_OLD_KRL=A nova KRL n\u00e3o \u00e9 mais recente do que o actual.
SEC_ERROR_CKL_CONFLICT=A nova CKL tem um emissor diferente da CKL actual. Apague a CKL actual.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=A Autoridade de Certifica\u00e7\u00e3o para este certificado n\u00e3o est\u00e1 autorizada a emitir um certificado com este nome.
SEC_ERROR_KRL_NOT_YET_VALID=A lista de chaves revogadas para este certificado ainda n\u00e3o \u00e9 v\u00e1lida.
SEC_ERROR_CRL_NOT_YET_VALID=A lista de certificados revogados para este certificado ainda n\u00e3o \u00e9 v\u00e1lida.
SEC_ERROR_UNKNOWN_CERT=O certificado requisitado n\u00e3o p\u00f4de ser encontrado.
SEC_ERROR_UNKNOWN_SIGNER=A assinatura do certificado n\u00e3o p\u00f4de ser encontrada.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=A localiza\u00e7\u00e3o do servidor de estado do certificado tem um formato inv\u00e1lido.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=A resposta OCSP n\u00e3o p\u00f4de ser totalmente descodificada; \u00e9 de um tipo desconhecido.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=O servidor OCSP devolveu dados HTTP inesperados/inv\u00e1lidos.
SEC_ERROR_OCSP_MALFORMED_REQUEST=O servidor OCSP acha que o pedido est\u00e1 corrupto ou mal formado.
SEC_ERROR_OCSP_SERVER_ERROR=O servidor OCSP sofreu um erro interno.
SEC_ERROR_OCSP_TRY_SERVER_LATER=O servidor OCSP sugere que tente mais tarde.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=O servidor OCSP requer uma assinatura para este pedido.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=O servidor OCSP recusou este pedido como n\u00e3o autorizado.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=O servidor OCSP devolveu um estado desconhecido.
SEC_ERROR_OCSP_UNKNOWN_CERT=O servidor OCSP n\u00e3o tem o estado deste certificado.
SEC_ERROR_OCSP_NOT_ENABLED=Tem de activar o OCSP antes de efectuar esta opera\u00e7\u00e3o.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Tem de definir a resposta padr\u00e3o do OCSP antes de efectuar esta opera\u00e7\u00e3o.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=A resposta do servidor OCSP foi corrompida ou mal formada.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=O signat\u00e1rio da resposta OCSP n\u00e3o est\u00e1 autorizado a dar o estado deste certificado.
SEC_ERROR_OCSP_FUTURE_RESPONSE=A resposta OCSP ainda n\u00e3o \u00e9 v\u00e1lida (contem uma data do futuro).
SEC_ERROR_OCSP_OLD_RESPONSE=A resposta OCSP cont\u00eam informa\u00e7\u00e3o desactualizada.
SEC_ERROR_DIGEST_NOT_FOUND=O resumo CMS ou PKCS \#7 n\u00e3o foi encontrado na mensagem assinada.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=O tipo da mensagem CMS ou PKCS \#7 n\u00e3o \u00e9 suportado.
SEC_ERROR_MODULE_STUCK=O m\u00f3dulo PKCS \#11 n\u00e3o p\u00f4de ser removido porque ainda est\u00e1 a ser utilizado.
SEC_ERROR_BAD_TEMPLATE=Incapaz de descodificar dados ASN.1. O modelo especificado era inv\u00e1lido.
SEC_ERROR_CRL_NOT_FOUND=Nenhuma CRL correspondente foi encontrado.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Est\u00e1 a tentar importar um certificado com o mesmo emissor/n\u00famero de s\u00e9rie de um certificado que j\u00e1 existe, mas diferente.
SEC_ERROR_BUSY=NSS foi incapaz de desligar. Existem objectos que ainda est\u00e3o a ser utilizados.
SEC_ERROR_EXTRA_INPUT=DER-a mensagem codificada continha dados extra n\u00e3o utilizados.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Curva el\u00edptica n\u00e3o suportada.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Forma do ponto da curva el\u00edptica n\u00e3o suportada.
SEC_ERROR_UNRECOGNIZED_OID=Identificador de objecto desconhecido.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Certificado de assinatura OCSP inv\u00e1lido na resposta OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=O certificado est\u00e1 revogado na lista de revoga\u00e7\u00e3o do emissor.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=O servidor OCSP do emissor informa que o certificado encontra-se revogado.
SEC_ERROR_CRL_INVALID_VERSION=A Lista de Certificados Revogados do emissor possui um n\u00famero de vers\u00e3o desconhecida.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=A Lista de Certificados Revogados V1 do emissor possui uma extens\u00e3o cr\u00edtica desconhecida.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=A Lista de Certificados Revogados V2 do emissor possui uma extens\u00e3o cr\u00edtica desconhecida.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Especificado um tipo de objecto desconhecido.
SEC_ERROR_INCOMPATIBLE_PKCS11=O controlador PKCS \#11 viola a especifica\u00e7\u00e3o de uma forma incompat\u00edvel.
SEC_ERROR_NO_EVENT=N\u00e3o existe nenhuma ranhura de evento dispon\u00edvel no momento.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL j\u00e1 existe.
SEC_ERROR_NOT_INITIALIZED=NSS n\u00e3o foi inicializado.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=A opera\u00e7\u00e3o falhou porque o token PKCS\#11 n\u00e3o est\u00e1 ligado.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=O certificado do servidor OCSP configurado \u00e9 inv\u00e1lido.
SEC_ERROR_OCSP_BAD_SIGNATURE=A resposta OCSP tem uma assinatura inv\u00e1lida.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=A pesquisa da valida\u00e7\u00e3o do cert est\u00e1 fora dos limites da pesquisa
SEC_ERROR_INVALID_POLICY_MAPPING=O mapeamento da pol\u00edtica cont\u00e9m anti-pol\u00edtica
SEC_ERROR_POLICY_VALIDATION_FAILED=A cadeia Cert falhou a pol\u00edtica de valida\u00e7\u00e3o
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=tipo de localiza\u00e7\u00e3o desconhecido na extens\u00e3o AIA do cert
SEC_ERROR_BAD_HTTP_RESPONSE=O servidor retornou uma m\u00e1 resposta HTTP
SEC_ERROR_BAD_LDAP_RESPONSE=O servidor retornou uma m\u00e1 resposta LDAP
SEC_ERROR_FAILED_TO_ENCODE_DATA=Falha ao codificar os dados com o codificador ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Informa\u00e7\u00e3o incorrecta na localiza\u00e7\u00e3o de acesso no cert da extens\u00e3o
SEC_ERROR_LIBPKIX_INTERNAL=Ocorreu um erro interno Libpkix durante a valida\u00e7\u00e3o do cert.
SEC_ERROR_PKCS11_GENERAL_ERROR=Um m\u00f3dulo PKCS \#11 retornou CKR_GENERAL_ERROR, indicando que ocorreu um erro irrecuper\u00e1vel.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Um m\u00f3dulo PKCS \#11 retornou CKR_FUNCTION_FAILED, indicando que a fun\u00e7\u00e3o pedida n\u00e3o pode ser executada.  Tentar novamente poder\u00e1 ser bem sucedido.
SEC_ERROR_PKCS11_DEVICE_ERROR=Um m\u00f3dulo PKCS \#11 retornou CKR_DEVICE_ERROR, indicando que ocorreu um problema com o token ou slot.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Informa\u00e7\u00e3o do m\u00e9todo de acesso desconhecido na extens\u00e3o do certificado.
SEC_ERROR_CRL_IMPORT_FAILED=Erro ao tentar importar o CRL.
SEC_ERROR_EXPIRED_PASSWORD=A senha expirou.
SEC_ERROR_LOCKED_PASSWORD=A senha est\u00e1 bloqueada.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Erro PKCS \#11 desconhecido.
SEC_ERROR_BAD_CRL_DP_URL=URL n\u00e3o suportado ou inv\u00e1lido no ponto de distribui\u00e7\u00e3o CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=O certificado foi assinado usando um algoritmo da assinatura que foi desativado pois n\u00e3o \u00e9 seguro.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

