#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL ge\u00e7erli olmad\u0131\u011f\u0131ndan y\u00fcklenemiyor.
fileNotFound=%S konumundaki dosya bulunam\u0131yor.
dnsNotFound=%S konumundaki sunucu bulunam\u0131yor.
protocolNotFound=Taray\u0131c\u0131 bu adresi nas\u0131l a\u00e7aca\u011f\u0131n\u0131 bilmiyor, \u00e7\u00fcnk\u00fc bu ileti\u015fim kural\u0131 (%S) herhangi bir programla ili\u015fkilendirilmemi\u015f.
connectionFailure=%S sunucusuyla ba\u011flant\u0131 sa\u011flanam\u0131yor.
netInterrupt=Sayfa y\u00fcklenirken %S sunucusuyla ba\u011flant\u0131 kesildi.
netTimeout=%S sunucusu \u00e7ok ge\u00e7 cevap veriyor.
redirectLoop=A\u00e7\u0131lmaya \u00e7al\u0131\u015f\u0131lan konum hi\u00e7bir zaman sonlanmayacak bir y\u00f6nlendirme d\u00f6ng\u00fcs\u00fcne girdi.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=%S uygulamas\u0131 bu sayfay\u0131 g\u00f6stermek i\u00e7in daha \u00f6nce ger\u00e7ekle\u015ftirilen eylemi (\u00f6r. arama emri ya da sipari\u015f teyidi) tekrarlayacak olan bilgiyi yeniden g\u00f6ndermeli.
resendButton.label=Tekrar g\u00f6nder
unknownSocketType=Taray\u0131c\u0131 sunucuyla nas\u0131l ba\u011flant\u0131 kurulaca\u011f\u0131n\u0131 bilmiyor.
netReset=Sayfa y\u00fcklenirken sunucuyla ba\u011flant\u0131 kesildi.
notCached=Bu belge art\u0131k mevcut de\u011fil.
netOffline=Taray\u0131c\u0131 \u015fu an \u00e7evrim d\u0131\u015f\u0131 kipte ve internette gezinti yapamaz.
isprinting=Belge yazd\u0131r\u0131l\u0131rken veya yazd\u0131rma \u00f6n izlemesindeyken de\u011fi\u015ftirilemez.
deniedPortAccess=Bu adres taramadan ba\u015fka ama\u00e7lar i\u00e7in kullan\u0131lan bir a\u011f ba\u011flant\u0131 noktas\u0131 kullan\u0131yor. Taray\u0131c\u0131n\u0131z g\u00fcvenli\u011finiz i\u00e7in bu ba\u011flanma iste\u011fini yerine getirmedi.
proxyResolveFailure=Taray\u0131c\u0131 bulunamayan bir vekil sunucuya ba\u011flanmak \u00fczere ayarlanm\u0131\u015f.
proxyConnectFailure=Taray\u0131c\u0131 ba\u011flanma isteklerini geri \u00e7eviren bir vekil sunucuya ba\u011flanmak \u00fczere ayarlanm\u0131\u015f.
contentEncodingError=Bakmak istedi\u011finiz sayfa g\u00f6sterilemiyor, \u00e7\u00fcnk\u00fc sayfada ge\u00e7ersiz ya da desteklenmeyen bir bi\u00e7imde s\u0131k\u0131\u015ft\u0131rma kullan\u0131l\u0131yor. Bu sorundan haberdar etmek i\u00e7in l\u00fctfen site sahipleriyle temasa ge\u00e7in.
unsafeContentType=Bakmak istedi\u011finiz sayfa a\u00e7\u0131lmas\u0131 g\u00fcvenli olmayan bir dosya t\u00fcr\u00fcnde kaydedilmi\u015f oldu\u011fundan g\u00f6sterilemiyor. L\u00fctfen site sahipleriyle ileti\u015fim kurup onlar\u0131 bu sorundan haberdar edin.
externalProtocolTitle=Harici \u0130leti\u015fim Kural\u0131 \u0130ste\u011fi
externalProtocolPrompt=%1$S\: ba\u011flant\u0131lar\u0131n\u0131 a\u00e7mak i\u00e7in harici bir uygulama a\u00e7\u0131lmal\u0131.\n\n\n\u0130stenen ba\u011flant\u0131\:\n\n%2$S\n\nUygulama\: %3$S\n\n\nBu iste\u011fi beklemiyor idiyseniz, bu giri\u015fim di\u011fer programdaki bir zay\u0131fl\u0131ktan faydalanma ama\u00e7l\u0131 olabilir. K\u00f6t\u00fc ama\u00e7l\u0131 olmad\u0131\u011f\u0131na emin olana kadar bu iste\u011fi geri \u00e7evirin.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Bilinmiyor>
externalProtocolChkMsg=Bu t\u00fcr ba\u011flant\u0131larla ilgili tercihimi bir k\u00f6\u015feye yaz.
externalProtocolLaunchBtn=Uygulamay\u0131 \u00e7al\u0131\u015ft\u0131r
malwareBlocked=%S konumundaki sitenin sald\u0131r\u0131 sitesi oldu\u011fu bildirildi ve g\u00fcvenlikle ilgili tercihlerinize dayan\u0131larak engellendi.
phishingBlocked=%S konumundaki sitenin, kullan\u0131c\u0131lar\u0131 kand\u0131rarak onlar\u0131 ki\u015fisel ve mali bilgilerini payla\u015fmaya y\u00f6nelten bir sahtek\u00e2rl\u0131k giri\u015fimi i\u00e7erdi\u011fi bildirilmi\u015ftir.
cspFrameAncestorBlocked=Bu sayfa, bu \u015fekilde g\u00f6m\u00fclmesini engelleyen bir g\u00fcvenlik ilkesine sahip.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Veri aktar\u0131m\u0131nda bir hata tespit edildi\u011fi i\u00e7in g\u00f6r\u00fcnt\u00fcleme \u00e7al\u0131\u015ft\u0131\u011f\u0131n\u0131z sayfa g\u00f6sterilemiyor.
remoteXUL=Bu sayfa, art\u0131k Pale Moon'da varsay\u0131lan olarak bulunmayan ve desteklenmeyen bir teknolojiyi kullan\u0131yor.

