#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=O URL non \u00e9 correcto e non \u00e9 pos\u00edbel cargalo.
fileNotFound=Non \u00e9 pos\u00edbel que Pale Moon encontre o ficheiro en %S.
dnsNotFound=Non \u00e9 pos\u00edbel que Pale Moon encontre o servidor en %S.
protocolNotFound=Pale Moon non sabe como abrir este enderezo porque o protocolo (%S) non est\u00e1 asociado a ning\u00fan programa.
connectionFailure=Non \u00e9 pos\u00edbel que Pale Moon estabeleza unha conexi\u00f3n co servidor en %S.
netInterrupt=A conexi\u00f3n con %S interrompeuse mentres se estaba a cargar a p\u00e1xina.
netTimeout=O servidor de %S est\u00e1 a demorar de m\u00e1is en responder.
redirectLoop=Pale Moon detectou que o servidor est\u00e1 a redireccionar o pedido deste enderezo dunha forma que nunca rematar\u00e1.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Para mostrar esta p\u00e1xina, %S debe enviar informaci\u00f3n que repetir\u00e1 calquera acci\u00f3n (tal como unha busca ou unha confirmaci\u00f3n de solicitude) que xa se executara antes.
resendButton.label=Enviar de novo
unknownSocketType=Pale Moon non sabe como comunicarse co servidor.
netReset=Reiniciouse a conexi\u00f3n co servidor mentres se estaba a cargar a p\u00e1xina.
notCached=Este documento xa non est\u00e1 dispo\u00f1\u00edbel.
netOffline=Pale Moon est\u00e1 actualmente en modo sen conexi\u00f3n e non \u00e9 pos\u00edbel navegar pola Web.
isprinting=Non \u00e9 pos\u00edbel modificar o documento mentres se imprime ou se visualiza na Previsualizaci\u00f3n da impresi\u00f3n.
deniedPortAccess=Este enderezo usa un porto de rede que normalmente se usa con fins diferentes \u00e1 navegaci\u00f3n web. Para a s\u00faa protecci\u00f3n, Pale Moon cancelou a solicitude.
proxyResolveFailure=Pale Moon configurouse para usar un servidor proxy que non \u00e9 pos\u00edbel encontrar.
proxyConnectFailure=Pale Moon configurouse para usar un servidor proxy que est\u00e1 a rexeitar as conexi\u00f3ns.
contentEncodingError=Non \u00e9 pos\u00edbel mostrar a p\u00e1xina que est\u00e1 a tentar visualizar porque usa un formulario de compresi\u00f3n incorrecto ou incompat\u00edbel.
unsafeContentType=Non \u00e9 pos\u00edbel mostrar a p\u00e1xina que est\u00e1 a tentar visualizar porque est\u00e1 inserida nun tipo de ficheiro que pode non ser seguro ao abrilo. Contacte cos propietarios do sitio web para informalos deste problema.
externalProtocolTitle=Petici\u00f3n de protocolo externa
externalProtocolPrompt=Inicie un aplicativo externo para manexar %1$S\: ligaz\u00f3ns.\n\n\nLigaz\u00f3n requirida\:\n\n%2$S\n\nAplicativo\: %3$S\n\n\nSe non estaba \u00e1 espera desta solicitude poder\u00eda tratarse dunha tentativa de vulnerar un punto fraco no outro programa. Cancele esta solicitude mentres non estea seguro de que non \u00e9 maliciosa.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Desco\u00f1ecido>
externalProtocolChkMsg=Lembrar a mi\u00f1a escolla para todas as ligaz\u00f3ns deste tipo.
externalProtocolLaunchBtn=Iniciar aplicativo
malwareBlocked=O sitio %S identificouse como sitio atacante e bloqueouse segundo as s\u00faas preferencias de seguranza.
phishingBlocked=O sitio web en %S identificouse como unha falsificaci\u00f3n dese\u00f1ada para enganar aos usuarios e obter informaci\u00f3n persoal ou financeira.
cspFrameAncestorBlocked=Esta p\u00e1xina ten unha pol\u00edtica de seguranza de contido que evita que sexa incrustado desta forma.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Non \u00e9 pos\u00edbel mostrar a p\u00e1xina que est\u00e1 a tentar visualizar porque se produciu un erro na transmisi\u00f3n dos datos.
remoteXUL=Esta p\u00e1xina usa unha tecnolox\u00eda non compat\u00edbel que xa non est\u00e1 dispo\u00f1\u00edbel de forma predeterminada en Pale Moon.

