#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=Veffang er ekki gilt e\u00f0a \u00fea\u00f0 er ekki h\u00e6gt a\u00f0 hla\u00f0a \u00fev\u00ed inn.
fileNotFound=Pale Moon finnur ekki skr\u00e1na \u00e1 %S.
dnsNotFound=Pale Moon finnur ekki net\u00fej\u00f3ninn \u00e1 %S.
protocolNotFound=Pale Moon veit ekki hvernig \u00e1 a\u00f0 opna \u00feetta vistfang, \u00fev\u00ed samskiptareglan (%S) er ekki tengd neinu forriti.
connectionFailure=Pale Moon getur ekki tengst vi\u00f0 net\u00fej\u00f3n \u00e1 %S.
netInterrupt=Tengingin vi\u00f0 %S var rofin \u00e1 me\u00f0an s\u00ed\u00f0an var a\u00f0 hla\u00f0ast inn.
netTimeout=Net\u00fej\u00f3nninn \u00e1 %S t\u00f3k of langan t\u00edma \u00ed a\u00f0 svara.
redirectLoop=Pale Moon hefur komist a\u00f0 \u00fev\u00ed a\u00f0 net\u00fej\u00f3nninn er a\u00f0 reyna a\u00f0 beina tengingunni fyrir \u00feessa vefsl\u00f3\u00f0 \u00e1 \u00feann h\u00e1tt a\u00f0 henni mun aldrei lj\u00faka.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Til \u00feess a\u00f0 s\u00fdna \u00feessa s\u00ed\u00f0u, \u00fearf %S a\u00f0 senda uppl\u00fdsingar sem mun endurtaka a\u00f0ger\u00f0 (til d\u00e6mis a\u00f0 leita e\u00f0a panta) sem var framkv\u00e6md \u00e1\u00f0ur.
resendButton.label=Endursenda
unknownSocketType=Pale Moon veit ekki hvernig \u00e1 a\u00f0 tala vi\u00f0 net\u00fej\u00f3ninn.
netReset=Tengingin vi\u00f0 net\u00fej\u00f3ninn var endurstillt \u00e1 me\u00f0an veri\u00f0 var a\u00f0 hla\u00f0a inn s\u00ed\u00f0u.
notCached=\u00deetta skjal er ekki lengur a\u00f0gengilegt.
netOffline=Pale Moon er n\u00fana a\u00f0 vinna \u00e1n nettengingar og \u00fev\u00ed er ekki h\u00e6gt a\u00f0 vafra um \u00e1 netinu.
isprinting=\u00deessu skjali er ekki h\u00e6gt a\u00f0 breyta \u00feegar veri\u00f0 er a\u00f0 prenta e\u00f0a forsko\u00f0a.
deniedPortAccess=\u00deetta veffang notar netg\u00e1tt sem er venjulega ekki notu\u00f0 til \u00feess a\u00f0 vafra. Pale Moon hefur loka\u00f0 \u00e1 bei\u00f0nina \u00fe\u00e9r til verndar.
proxyResolveFailure=Pale Moon er stilltur til a\u00f0 nota milli\u00fej\u00f3n sem finnst ekki.
proxyConnectFailure=Pale Moon er stilltur til a\u00f0 nota milli\u00fej\u00f3n sem neitar tengingum.
contentEncodingError=Ekki er h\u00e6gt a\u00f0 s\u00fdna \u00feessa s\u00ed\u00f0u \u00fev\u00ed h\u00fan notar \u00f3gilda e\u00f0a \u00f3studda gagna\u00fej\u00f6ppun.
unsafeContentType=Ekki er h\u00e6gt a\u00f0 s\u00fdna s\u00ed\u00f0una \u00fev\u00ed h\u00fan inniheldur skr\u00e1artegund sem getur veri\u00f0 varas\u00f6m a\u00f0 opna. L\u00e1ttu vefstj\u00f3ra s\u00ed\u00f0unnar vita af \u00feessu vandam\u00e1li.
externalProtocolTitle=Ytri samskipta bei\u00f0ni
externalProtocolPrompt=Til a\u00f0 me\u00f0h\u00f6ndla %1$S\: tengla \u00fearf a\u00f0 r\u00e6sa utana\u00f0komandi forrit.\n\n\nTenglabei\u00f0ni\:\n\n%2$S\n\nForrit\: %3$S\n\n\nEf \u00fe\u00fa bj\u00f3st alls ekki vi\u00f0 \u00feessari bei\u00f0ni g\u00e6ti veri\u00f0 a\u00f0 einhver v\u00e6ri a\u00f0 reyna a\u00f0 misnota galla \u00ed \u00feessu forriti. H\u00e6ttu vi\u00f0 \u00feessa bei\u00f0ni nema \u00fe\u00fa s\u00e9rt alveg viss um a\u00f0 h\u00fan s\u00e9 ekki h\u00e6ttuleg.
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\u00d3\u00feekktur>
externalProtocolChkMsg=Muna mitt val fyrir tengla af \u00feessari tegund.
externalProtocolLaunchBtn=R\u00e6sa forrit
malwareBlocked=Vefsv\u00e6\u00f0i\u00f0 %S hefur veri\u00f0 tilkynnt sem \u00e1r\u00e1sarsv\u00e6\u00f0i og a\u00f0gangur hefur veri\u00f0 hindra\u00f0ur vegna \u00f6ryggisstillinga.
phishingBlocked=Vefsv\u00e6\u00f0i\u00f0 %S hefur veri\u00f0 tilkynnt sem falsa\u00f0 vefsv\u00e6\u00f0i sem platar notendur \u00ed a\u00f0 gefa fr\u00e1 s\u00e9r pers\u00f3nuuppl\u00fdsingar e\u00f0a fj\u00e1rm\u00e1lauppl\u00fdsingar.
cspFrameAncestorBlocked=\u00deessi s\u00ed\u00f0a inniheldur \u00f6ryggisreglu sem kemur \u00ed veg fyrir a\u00f0 h\u00e6gt s\u00e9 a\u00f0 innfella hana \u00e1 \u00feennan h\u00e1tt.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Ekki er h\u00e6gt a\u00f0 s\u00fdna s\u00ed\u00f0una vegna villu \u00ed gagnasendingu.
remoteXUL=\u00deessi s\u00ed\u00f0a notar \u00f3studda t\u00e6kni sem er ekki lengur tilt\u00e6k \u00ed Pale Moon.

