#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=\u0423\u043f\u043e\u0437\u043e\u0440\u0435\u045a\u0435\: \u0441\u043a\u0440\u0438\u043f\u0442\u0430 \u0441\u0435 \u043d\u0435 \u043e\u0434\u0430\u0437\u0438\u0432\u0430
KillScriptMessage=\u0421\u043a\u0440\u0438\u043f\u0442\u0430 \u043d\u0430 \u043e\u0432\u043e\u0458 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0438 \u0458\u0435 \u0437\u0430\u0443\u0437\u0435\u0442\u0430 \u0438\u043b\u0438 \u0441\u0435 \u043d\u0435 \u043e\u0434\u0430\u0437\u0438\u0432\u0430. \u041c\u043e\u0436\u0435\u0442\u0435 \u0458\u0435 \u043e\u0434\u043c\u0430\u0445 \u0437\u0430\u0443\u0441\u0442\u0430\u0432\u0438\u0442\u0438 \u0438\u043b\u0438 \u0441\u0430\u0447\u0435\u043a\u0430\u0442\u0438 \u045a\u0435\u043d \u0437\u0430\u0432\u0440\u0448\u0435\u0442\u0430\u043a.
KillScriptWithDebugMessage=\u0421\u043a\u0440\u0438\u043f\u0442\u0430 \u043d\u0430 \u043e\u0432\u043e\u0458 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0438 \u0458\u0435 \u043c\u043e\u0436\u0434\u0430 \u0437\u0430\u0443\u0437\u0435\u0442\u0430 \u0438\u043b\u0438 \u0441\u0435 \u043d\u0435 \u043e\u0434\u0430\u0437\u0438\u0432\u0430. \u041c\u043e\u0436\u0435\u0442\u0435 \u0434\u0430 \u0458\u0435 \u0437\u0430\u0443\u0441\u0442\u0430\u0432\u0438\u0442\u0435 \u043e\u0434\u043c\u0430\u0445, \u043e\u0442\u0432\u043e\u0440\u0438\u0442\u0435 \u0443 \u0438\u0441\u043f\u0440\u0430\u0432\u0459\u0430\u0447\u0443 \u0433\u0440\u0435\u0448\u0430\u043a\u0430 \u0438\u043b\u0438 \u0434\u0430 \u0458\u0435 \u043f\u0443\u0441\u0442\u0438\u0442\u0435 \u0434\u0430 \u0441\u0435 \u043d\u0430\u0441\u0442\u0430\u0432\u0438.
KillScriptLocation=\u0421\u043a\u0440\u0438\u043f\u0442\u0430\: %S
StopScriptButton=\u0417\u0430\u0443\u0441\u0442\u0430\u0432\u0438 \u0441\u043a\u0440\u0438\u043f\u0442\u0443
DebugScriptButton=\u0418\u0441\u043f\u0438\u0442\u0430\u0458 \u0441\u043a\u0440\u0438\u043f\u0442
WaitForScriptButton=\u0414\u0430\u0459\u0435
DontAskAgain=\u041d\u0435 \u043f\u0438\u0442\u0430\u0458 \u043c\u0435 \u043e\u043f\u0435\u0442
JSURLLoadBlockedWarning=\u041f\u043e\u043a\u0443\u0448\u0430\u0432\u0430\u043c \u0434\u0430 \u0443\u0447\u0438\u0442\u0430\u043c javascript\: \u0430\u0434\u0440\u0435\u0441\u0430 \u0441\u0430 \u0458\u0435\u0434\u043d\u043e\u0433 \u0445\u043e\u0441\u0442\u0430\u0443 \u043f\u0440\u043e\u0437\u043e\u0440\u0443 \u043f\u0440\u0438\u043a\u0430\u0437\u0443\u0458\u0435 \u0441\u0430\u0434\u0440\u0436\u0430\u0458 \u0441\u0430 \u0434\u0440\u0443\u0433\u043e\u0433 \u0445\u043e\u0441\u0442\u0430\u043f\u0430 \u0458\u0435 \u0431\u043b\u043e\u043a\u0438\u0440\u0430\u043d \u043c\u0435\u043d\u0430\u045f\u0435\u0440\u043e\u043c \u0431\u0435\u0437\u0431\u0435\u0434\u043d\u043e\u0441\u0442\u0438.
WindowCloseBlockedWarning=\u0421\u043a\u0440\u0438\u043f\u0442 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0437\u0430\u0442\u0432\u043e\u0440\u0438 \u043f\u0440\u043e\u0437\u043e\u0440 \u043a\u043e\u0458\u0438 \u043e\u043d \u043d\u0438\u0458\u0435 \u043e\u0442\u0432\u043e\u0440\u0438\u043e.
OnBeforeUnloadTitle=\u0414\u0430 \u043b\u0438 \u0441\u0442\u0435 \u0441\u0438\u0433\u0443\u0440\u043d\u0438?
OnBeforeUnloadMessage=\u041e\u0432\u0430 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0430 \u0432\u0430\u0441 \u043f\u0438\u0442\u0430 \u0434\u0430 \u043b\u0438 \u0458\u0435 \u0436\u0435\u043b\u0438\u0442\u0435 \u043d\u0430\u043f\u0443\u0441\u0442\u0438\u0442\u0438. \u041f\u043e\u0434\u0430\u0446\u0438 \u043a\u043e\u0458\u0435 \u0441\u0442\u0435 \u0443\u043d\u0435\u043b\u0438 \u043c\u043e\u0436\u0434\u0430 \u043d\u0435\u045b\u0435 \u0431\u0438\u0442\u0438 \u0441\u0430\u0447\u0443\u0432\u0430\u043d\u0438.
OnBeforeUnloadStayButton=\u041e\u0441\u0442\u0430\u043d\u0438 \u043d\u0430 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0438
OnBeforeUnloadLeaveButton=\u041d\u0430\u043f\u0443\u0441\u0442\u0438 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0443
UnexpectedCanvasVariantStyle=canvas\: \u043f\u043e\u043a\u0443\u0448\u0430\u0458 \u0434\u0430 \u0441\u0435 \u043f\u043e\u0441\u0442\u0430\u0432\u0438 strokeStyle \u0438\u043b\u0438 fillStyle \u043d\u0430 \u0432\u0440\u0435\u0434\u043d\u043e\u0441\u0442 \u043a\u043e\u0458\u0430 \u0458\u0435 \u043d\u0438\u0442\u0438 \u0442\u0435\u043a\u0441\u0442, \u043d\u0438\u0442\u0438 CanvasGradient \u043d\u0438\u0442\u0438 CanvasPattern \u0458\u0435 \u0437\u0430\u043d\u0435\u043c\u0430\u0440\u0435\u043d.
EmptyGetElementByIdParam=\u041f\u0440\u0430\u0437\u0430\u043d \u0437\u043d\u0430\u043a\u043e\u0432\u043d\u0438 \u043d\u0438\u0437 \u043f\u0440\u043e\u0441\u043b\u0435\u0452\u0435\u043d \u0443 getElementById().
LowMemoryTitle=\u0423\u043f\u043e\u0437\u043e\u0440\u0435\u045a\u0435\: \u043c\u0435\u043c\u043e\u0440\u0438\u0458\u0430 \u0458\u0435 \u043d\u0430 \u0438\u0437\u043c\u0430\u043a\u0443
LowMemoryMessage=\u0421\u043a\u0440\u0438\u043f\u0442\u0430 \u043d\u0430 \u043e\u0432\u043e\u0458 \u0441\u0442\u0440\u0430\u043d\u0438 \u0458\u0435 \u0437\u0430\u0443\u0441\u0442\u0430\u0432\u0459\u0435\u043d\u0430 \u0443\u0441\u043b\u0435\u0434 \u043d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043a\u0430 \u043c\u0435\u043c\u043e\u0440\u0438\u0458\u0435.
SpeculationFailed=\u041d\u0435\u0438\u0437\u0431\u0430\u043b\u0430\u043d\u0441\u0438\u0440\u0430\u043d\u043e \u0441\u0442\u0430\u0431\u043b\u043e \u0458\u0435 \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u043e \u043a\u043e\u0440\u0438\u0441\u0442\u0435\u045b\u0438 document.write(), \u0448\u0442\u043e \u0458\u0435 \u0434\u043e\u0432\u0435\u043b\u043e \u0434\u043e \u0442\u043e\u0433\u0430 \u0434\u0430 \u043f\u043e\u0434\u0430\u0446\u0438 \u0441\u0430 \u043c\u0440\u0435\u0436\u0435 \u0431\u0443\u0434\u0443 \u043f\u043e\u043d\u043e\u0432\u043e \u0440\u0430\u0448\u0447\u043b\u0430\u045a\u0435\u043d\u0438. \u0417\u0430 \u0432\u0438\u0448\u0435 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0458\u0430 \u043f\u043e\u0441\u0435\u0442\u0438\u0442\u0435 https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing
DocumentWriteIgnored=\u041f\u043e\u0437\u0438\u0432 \u043d\u0430 document.write() \u0441\u0430 \u0430\u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043e \u0443\u0447\u0438\u0442\u0430\u043d\u043e\u043c \u0441\u043f\u043e\u0459\u043d\u043e\u043c \u0441\u043a\u0440\u0438\u043f\u0442\u043e\u043c \u0458\u0435 \u0437\u0430\u043d\u0435\u043c\u0430\u0440\u0435\u043d\u043e.
FormValidationTextTooLong=\u0421\u043a\u0440\u0430\u0442\u0438\u0442\u0435 \u043e\u0432\u0430\u0458 \u0442\u0435\u043a\u0441\u0442 \u043d\u0430 %S \u0437\u043d\u0430\u043a(\u043e\u0432\u0430) \u0438\u043b\u0438 \u043c\u0430\u045a\u0435. \u0422\u0440\u0435\u043d\u0443\u0442\u043d\u043e \u0438\u0441\u043a\u043e\u0440\u0438\u0448\u045b\u0435\u043d\u0438\u0445 \u0437\u043d\u0430\u043a\u043e\u0432\u0430\: %S.
FormValidationValueMissing=\u041f\u043e\u043f\u0443\u043d\u0438\u0442\u0435 \u043e\u0432\u043e \u043f\u043e\u0459\u0435.
FormValidationCheckboxMissing=\u0428\u0442\u0438\u043a\u043b\u0438\u0440\u0430\u0458\u0442\u0435 \u043e\u0432\u0443 \u043a\u0443\u045b\u0438\u0446\u0443, \u0430\u043a\u043e \u0436\u0435\u043b\u0438\u0442\u0435 \u0434\u0430 \u043d\u0430\u0441\u0442\u0430\u0432\u0438\u0442\u0435.
FormValidationRadioMissing=\u0418\u0437\u0430\u0431\u0435\u0440\u0438\u0442\u0435 \u0458\u0435\u0434\u043d\u0443 \u043e\u0434 \u043e\u0432\u0438\u0445 \u043e\u043f\u0446\u0438\u0458\u0430.
FormValidationFileMissing=\u0418\u0437\u0430\u0431\u0435\u0440\u0438\u0442\u0435 \u0434\u0430\u0442\u043e\u0442\u0435\u043a\u0443.
FormValidationSelectMissing=\u0418\u0437\u0430\u0431\u0435\u0440\u0438\u0442\u0435 \u0441\u0442\u0430\u0432\u043a\u0443 \u0441\u0430 \u0441\u043f\u0438\u0441\u043a\u0430.
FormValidationInvalidEmail=\u0423\u043d\u0435\u0441\u0438\u0442\u0435 \u0435-\u0430\u0434\u0440\u0435\u0441\u0443.
FormValidationInvalidURL=\u0423\u043d\u0435\u0441\u0438\u0442\u0435 \u0430\u0434\u0440\u0435\u0441\u0443.
FormValidationPatternMismatch=\u041f\u043e\u0434\u0435\u0441\u0438\u0442\u0435 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u043e\u0431\u043b\u0438\u043a.
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=\u041f\u043e\u0434\u0435\u0441\u0438\u0442\u0435 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u043e\u0431\u043b\u0438\u043a\: %S.
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=Please select a valid value. The two nearest valid values are %S and %S.
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=Please select a valid value. The nearest valid value is %S.
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 getAttributeNode() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430.  \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 getAttribute().
SetAttributeNodeWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 setAttributeNode() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430. \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 setAttribute().
GetAttributeNodeNSWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 getAttributeNodeNS() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430. \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 getAttributeNS().
SetAttributeNodeNSWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 setAttributeNodeNS() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430. \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 setAttributeNS().
RemoveAttributeNodeWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 removeAttributeNode() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430. \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 removeAttribute().
CreateAttributeWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 document.createAttribute() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430. \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 element.setAttribute().
CreateAttributeNSWarning=\u0424\u0443\u043d\u043a\u0446\u0438\u0458\u0430 document.createAttributeNS() \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430.  \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 element.setAttributeNS().
OwnerElementWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 ownerElement \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430.
NodeValueWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 nodeValue \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430. \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 value.
TextContentWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 textContent \u043d\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0443 \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430.  \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 \u0432\u0440\u0435\u0434\u043d\u043e\u0441\u0442 \u0443\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u0430.
EnablePrivilegeWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 enablePrivilege \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430.  \u041c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0438\u0442\u0442\u0435 \u043a\u043e\u0434 \u043a\u043e\u0458\u0438 \u043a\u043e\u0440\u0438\u0441\u0442\u0438 \u0441\u0438\u0441\u0442\u0435\u043c\u0441\u043a\u0438 \u043f\u0440\u043e\u0434\u0443\u0436\u0435\u0442\u0430\u043a \u0443\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u0430.
nsIJSONDecodeDeprecatedWarning=nsIJSON.decode \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043e.  \u0423\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u0430 \u043c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 JSON.parse.
nsIJSONEncodeDeprecatedWarning=nsIJSON.encode \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043e.  \u0423\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u0430 \u043c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 JSON.stringify.
nsIDOMWindowInternalWarning=nsIDOMWindowInternal \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043e.  \u0423\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u0430 \u043c\u043e\u043b\u0438\u043c\u043e \u0434\u0430 \u043a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 nsIDOMWindow.
InputEncodingWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 \u0444\u0443\u043d\u043a\u0446\u0438\u0458\u0435 inputEncoding \u0458\u0435 \u0437\u0430\u0441\u0442\u0430\u0440\u0435\u043b\u0430.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=\u0414\u043e\u0433\u0430\u0452\u0430\u0458\u0438 \u201eMozBeforePaint\u201c \u0432\u0438\u0448\u0435 \u043d\u0438\u0441\u0443 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0438. MozRequestAnimationFrame \u043c\u043e\u0440\u0430 \u0434\u0430 \u043f\u0440\u043e\u0452\u0435 \u043d\u0435\u043f\u0440\u0430\u0437\u043d\u0438 \u043f\u043e\u0432\u0440\u0430\u0442\u043d\u0438 \u0430\u0440\u0433\u0443\u043c\u0435\u043d\u0442.
FullScreenDeniedBlocked=Request for full-screen was denied because this domain has been blocked from full-screen by user.
FullScreenDeniedDisabled=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0458\u0435 \u0410\u041f\u0418 \u0437\u0430 \u0442\u043e \u043e\u043d\u0435\u043c\u043e\u0433\u0443\u045b\u0435\u043d.
FullScreenDeniedFocusedPlugin=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0458\u0435 \u0444\u043e\u043a\u0443\u0441\u0438\u0440\u0430\u043d \u043f\u0440\u0438\u043a\u0459\u0443\u0447\u0430\u043a \u0443 \u043f\u0440\u043e\u0437\u043e\u0440\u0443.
FullScreenDeniedHidden=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u0432\u0438\u0448\u0435 \u043d\u0438\u0458\u0435 \u0432\u0438\u0434\u0459\u0438\u0432.
FullScreenDeniedIframeNotAllowed=Request for full-screen was denied because at least one of the document's containing iframes does not have an "allowfullscreen" attribute.
FullScreenDeniedNotInputDriven=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u201eElement.mozRequestFullScreen()\u201c \u043d\u0438\u0458\u0435 \u043f\u043e\u0437\u0432\u0430\u043d \u0443\u043d\u0443\u0442\u0430\u0440 \u0443\u043f\u0440\u0430\u0432\u0459\u0430\u0447\u0430 \u0434\u043e\u0433\u0430\u0452\u0430\u0458\u0438\u043c\u0430.
FullScreenDeniedNotInDocument=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0441\u0435 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u0435\u043b\u0435\u043c\u0435\u043d\u0442 \u0432\u0438\u0448\u0435 \u043d\u0435 \u043d\u0430\u043b\u0430\u0437\u0438 \u0443 \u0441\u0432\u043e\u043c \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0443.
FullScreenDeniedMovedDocument=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0441\u0435 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u0435\u043b\u0435\u043c\u0435\u043d\u0442 \u043f\u0440\u0435\u043c\u0435\u0441\u0442\u0438\u043e \u043d\u0430 \u0434\u0440\u0443\u0433\u0438 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442.
FullScreenDeniedLostWindow=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435 \u0432\u0438\u0448\u0435 \u043d\u0435\u043c\u0430\u043c\u043e \u043f\u0440\u043e\u0437\u043e\u0440.
FullScreenDeniedSubDocFullScreen=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0458\u0435 \u043f\u043e\u0434\u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430 \u043a\u043e\u0458\u0438 \u0442\u0440\u0430\u0436\u0438 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0432\u0435\u045b \u0443 \u045a\u0435\u043c\u0443.
FullScreenDeniedNotDescendant=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u0435\u043b\u0435\u043c\u0435\u043d\u0442 \u043d\u0438\u0458\u0435 \u043d\u0430\u0441\u043b\u0435\u0434\u043d\u0438\u043a \u0442\u0435\u043a\u0443\u045b\u0435\u0433 \u0435\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d.
FullScreenDeniedNotFocusedTab=\u0417\u0430\u0445\u0442\u0435\u0432 \u0437\u0430 \u0446\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043e\u0434\u0431\u0438\u0458\u0435\u043d \u0458\u0435\u0440 \u0442\u0440\u0430\u0436\u0435\u043d\u0438 \u0435\u043b\u0435\u043c\u0435\u043d\u0442 \u043d\u0438\u0458\u0435 \u0443 \u0442\u0440\u0435\u043d\u0443\u0442\u043d\u043e \u0444\u043e\u043a\u0443\u0441\u0438\u0440\u0430\u043d\u043e\u043c \u0458\u0435\u0437\u0438\u0447\u043a\u0443.
FullScreenDeniedContentOnly=Request for full-screen was denied because requesting element is in the chrome document and the fullscreen API is configured for content only.
RemovedFullScreenElement=\u0426\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043d\u0430\u043f\u0443\u0448\u0442\u0435\u043d \u0458\u0435\u0440 \u0458\u0435 \u0435\u043b\u0435\u043c\u0435\u043d\u0442 \u0437\u0430 \u045a\u0435\u0433\u0430 \u0443\u043a\u043b\u043e\u045a\u0435\u043d \u0438\u0437 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430.
FocusedWindowedPluginWhileFullScreen=\u0426\u0435\u043e \u0435\u043a\u0440\u0430\u043d \u0458\u0435 \u043d\u0430\u043f\u0443\u0448\u0442\u0435\u043d \u0458\u0435\u0440 \u0458\u0435 \u0444\u043e\u043a\u0443\u0441\u0438\u0440\u0430\u043d \u043f\u0440\u0438\u043a\u0459\u0443\u0447\u0430\u043a \u0443 \u043f\u0440\u043e\u0437\u043e\u0440\u0443.
HTMLSyncXHRWarning=HTML \u0440\u0430\u0448\u0447\u043b\u0430\u045a\u0438\u0432\u0430\u045a\u0435 \u0443 \u0434\u0430\u0442\u043e\u0442\u0435\u0446\u0438 XMLHttpRequest \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e \u0443 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043e\u043c \u0440\u0435\u0436\u0438\u043c\u0443.
InvalidRedirectChannelWarning=\u041d\u0435 \u043c\u043e\u0433\u0443 \u0434\u0430 \u043f\u0440\u0435\u0443\u0441\u043c\u0435\u0440\u0438\u043c \u043d\u0430 %S \u0458\u0435\u0440 \u043a\u0430\u043d\u0430\u043b \u043d\u0435 \u0443\u0433\u0440\u0430\u0452\u0443\u0458\u0435 nsIWritablePropertyBag2.
ResponseTypeSyncXHRWarning=\u041a\u043e\u0440\u0438\u0448\u045b\u0435\u045a\u0435 XMLHttpRequest-\u043e\u0432\u043e\u0433 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 responseType \u0432\u0438\u0448\u0435 \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e \u0443 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043e\u043c \u0440\u0435\u0436\u0438\u043c\u0443 (\u0443 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u043f\u0440\u043e\u0437\u043e\u0440\u0430).
WithCredentialsSyncXHRWarning=\u041a\u043e\u0440\u0438\u0448\u045b\u0435\u045a\u0435 XMLHttpRequest-\u043e\u0432\u043e\u0433 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 withCredentials \u0432\u0438\u0448\u0435 \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e \u0443 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043e\u043c \u0440\u0435\u0436\u0438\u043c\u0443 (\u0443 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u043f\u0440\u043e\u0437\u043e\u0440\u0430).
TimeoutSyncXHRWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 timeout \u0438\u0437 XMLHttpRequest \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u0430 \u0443 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u043e\u043c \u043d\u0430\u0447\u0438\u043d\u0443 \u0440\u0430\u0434\u0430 \u0443 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \u043f\u0440\u043e\u0437\u043e\u0440\u0430.
JSONCharsetWarning=\u041f\u043e\u043a\u0443\u0448\u0430\u043d\u043e \u0458\u0435 \u0434\u0430 \u0441\u0435 \u043f\u0440\u043e\u0433\u043b\u0430\u0441\u0438 \u043d\u0435-UTF-8 \u043a\u043e\u0434\u0438\u0440\u0430\u045a\u0435 \u0437\u0430 JSON \u043a\u043e\u0440\u0438\u0441\u0442\u0435\u045b\u0438 XMLHttpRequest. \u041f\u043e\u0434\u0440\u0436\u0430\u043d\u043e \u0458\u0435 \u0441\u0430\u043c\u043e UTF-8 \u043a\u043e\u0434\u0438\u0440\u0430\u045a\u0435 \u0437\u0430 \u0434\u0435\u0448\u0438\u0444\u0440\u043e\u0432\u0430\u045a\u0435 JSON-\u0430.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=Insufficient memory to resample the AudioBufferSourceNode for playback.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=The buffer passed to decodeAudioData contains an unknown content type.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=An unknown error occured while processing decodeAudioData.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=The buffer passed to decodeAudioData contains invalid content which cannot be decoded successfully.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=The buffer passed to decodeAudioData does not contain any audio.
MediaLoadExhaustedCandidates=\u041d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e \u0443\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 \u043d\u0438\u0458\u0435\u0434\u043d\u043e\u0433 \u043f\u043e\u0442\u0435\u043d\u0446\u0438\u0458\u0430\u043b\u043d\u043e\u0433 \u0440\u0435\u0441\u0443\u0440\u0441\u0430.  \u0423\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 \u043c\u0435\u0434\u0438\u0458\u0430 \u0458\u0435 \u043f\u0430\u0443\u0437\u0438\u0440\u0430\u043d\u043e.
MediaLoadSourceMissingSrc=\u0415\u043b\u0435\u043c\u0435\u043d\u0442 <source> \u043d\u0435\u043c\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u201esrc\u201c. \u0423\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 \u043c\u0435\u0434\u0438\u0458\u0430 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=\u0423\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 HTTP-\u0430 \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e, \u0441\u0442\u0430\u0442\u0443\u0441 \u0458\u0435 %1$S. \u0423\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 \u043c\u0435\u0434\u0438\u0458\u0430 %2$S \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=URI \u0458\u0435 \u043d\u0435\u0438\u0441\u043f\u0440\u0430\u0432\u0430\u043d.  \u0423\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 \u043c\u0435\u0434\u0438\u0458\u0430 %S \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e.
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute=Specified "type" attribute of "%1$S" is not supported. Load of media resource %2$S failed.
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched=Specified "media" attribute of "%1$S" does not match the environment. Load of media resource %2$S failed.
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType=HTTP \u0437\u0430\u0433\u043b\u0430\u0432\u0459\u0435 \u201eContent-Type\u201c \u043c\u0435\u0434\u0438\u0458\u0430 "%1$S" \u043d\u0438\u0458\u0435 \u043f\u043e\u0434\u0440\u0436\u0430\u043d\u043e. \u0423\u0447\u0438\u0442\u0430\u0432\u0430\u045a\u0435 \u043c\u0435\u0434\u0438\u0458\u0430 %2$S \u043d\u0438\u0458\u0435 \u0443\u0441\u043f\u0435\u043b\u043e.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=\u0420\u0435\u0441\u0443\u0440\u0441 \u043c\u0435\u0434\u0438\u0458\u0430 %S \u043d\u0438\u0458\u0435 \u0434\u0435\u043a\u043e\u0434\u043e\u0432\u0430\u043d.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=\u0423\u043f\u043e\u0442\u0440\u0435\u0431\u0430 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 code \u0438\u0437 DOMException \u0441\u0435 \u043d\u0435 \u043f\u0440\u0435\u043f\u043e\u0440\u0443\u0447\u0443\u0458\u0435.  \u041a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 name.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=Exposing chrome JS objects to content without __exposedProps__ is insecure and deprecated. See https\://developer.mozilla.org/en/XPConnect_wrappers for more information.
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=Use of Mutation Events is deprecated. Use MutationObserver instead.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=The Components object is deprecated. It will soon be removed.
PluginHangUITitle=Warning\: Unresponsive plugin
PluginHangUIMessage=%S may be busy, or it may have stopped responding. You can stop the plugin now, or you can continue to see if the plugin will complete.
PluginHangUIWaitButton=Continue
PluginHangUIStopButton=Stop plugin
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning='mozHidden' and 'mozVisibilityState' are deprecated.  Please use the unprefixed 'hidden' and 'visibilityState' instead.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=Calling detach() on a NodeIterator no longer has an effect.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=Ignoring get or set of property that has [LenientThis] because the "this" object is incorrect.
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=Use of nsIDOMWindowUtils.getOuterWindowWithId() is deprecated.  Instead, use the nsIWindowMediator method of the same name.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=Use of getPreventDefault() is deprecated.  Use defaultPrevented instead.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=Use of getUserData() or setUserData() is deprecated.  Use WeakMap or element.dataset instead.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=Document.load() \u0441\u0435 \u0432\u0438\u0448\u0435 \u043d\u0435 \u043a\u043e\u0440\u0438\u0441\u0442\u0438. \u0414\u0430 \u0431\u0438\u0441\u0442\u0435 \u0430\u0436\u0443\u0440\u0438\u0440\u0430\u043b\u0438 \u0441\u0432\u043e\u0458 \u043a\u043e\u0434, \u043a\u043e\u0440\u0438\u0441\u0442\u0438\u0442\u0435 \u043e\u0431\u0458\u0435\u043a\u0430\u0442 DOM XMLHttpRequest. \u0417\u0430 \u0432\u0438\u0448\u0435 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0458\u0430, \u043f\u043e\u0433\u043b\u0435\u0434\u0430\u0458\u0442\u0435 https\://developer.mozilla.org/en/XMLHttpRequest
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

