#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL on virheellinen, eik\u00e4 sit\u00e4 voida ladata.
fileNotFound=Tiedostoa ei l\u00f6ytynyt sijainnista %S.
dnsNotFound=Palvelinta osoitteessa %S ei l\u00f6ytynyt.
protocolNotFound=Osoitetta ei osata avata, koska tarvittavalle yhteysk\u00e4yt\u00e4nn\u00f6lle (%S) ei ole ohjelmaa.
connectionFailure=Yhteyden muodostus osoitteeseen %S ep\u00e4onnistui.
netInterrupt=Yhteys osoitteeseen %S katkesi kesken sivun lataamisen.
netTimeout=Palvelin osoitteessa %S vastaa pyynt\u00f6ihin liian hitaasti.
redirectLoop=Palvelin t\u00e4ss\u00e4 osoitteessa uudelleenohjaa pyynt\u00f6j\u00e4 loputtomasti.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Sivu voidaan n\u00e4ytt\u00e4\u00e4 vain l\u00e4hett\u00e4m\u00e4ll\u00e4 %Sin jo aikaisemmin l\u00e4hett\u00e4m\u00e4t tiedot. Tietojen l\u00e4hett\u00e4minen toistaa aikaisemmin suoritetun toiminnon (kuten haun tai tuotteen tilauksen verkkokaupasta).
resendButton.label=L\u00e4het\u00e4 uudestaan
unknownSocketType=Pale Moon ei osaa keskustella palvelimen kanssa.
netReset=Yhteys palvelimeen alustettiin kesken latauksen.
notCached=T\u00e4m\u00e4 dokumentti ei ole en\u00e4\u00e4 saatavilla.
netOffline=Pale Moon on t\u00e4ll\u00e4 hetkell\u00e4 yhteydett\u00f6m\u00e4ss\u00e4 tilassa, eik\u00e4 selaaminen ole mahdollista.
isprinting=Sivu ei voi muuttua, kun sit\u00e4 tulostetaan tai tulostusta esikatsellaan.
deniedPortAccess=Osoitteessa k\u00e4ytetty\u00e4 porttia ei yleens\u00e4 k\u00e4ytet\u00e4 WWW-sivujen selaamiseen. Pale Moon on keskeytt\u00e4nyt yhteyden muodostamisen turvallisuussyist\u00e4.
proxyResolveFailure=Asetettua v\u00e4lityspalvelinta ei l\u00f6ytynyt.
proxyConnectFailure=Asetettu v\u00e4lityspalvelin kielt\u00e4ytyy yhteydest\u00e4.
contentEncodingError=Avattava sivu on pakattu virheellisesti tai tuntemattomalla tavalla, eik\u00e4 sivua voida n\u00e4ytt\u00e4\u00e4.
unsafeContentType=Avattava sivu l\u00e4hetettiin tiedostomuodossa, joka ei aina ole turvallinen eik\u00e4 sivua siksi voida n\u00e4ytt\u00e4\u00e4. Ilmoita t\u00e4st\u00e4 ongelmasta sivuston omistajalle.
externalProtocolTitle=Vieraan yhteysk\u00e4yt\u00e4nn\u00f6n avauspyynt\u00f6
externalProtocolPrompt=%1$S\:-linkit t\u00e4ytyy avata toisessa ohjelmassa. Avattava linkki\:\n\n\n%2$S\nOhjelma\: %3$S\n\n\nJos et odottanut t\u00e4m\u00e4n linkin avausta, kyseess\u00e4 saattaa olla yritys hy\u00f6dynt\u00e4\u00e4 heikkouksia avattavan ohjelman turvallisuudessa. \u00c4l\u00e4 k\u00e4ynnist\u00e4 toista ohjelmaa, jos et ole selvill\u00e4 linkin alkuper\u00e4st\u00e4.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Tuntematon>
externalProtocolChkMsg=Tee aina n\u00e4in vastaaville linkeille.
externalProtocolLaunchBtn=K\u00e4ynnist\u00e4 ohjelma
malwareBlocked=Sivuston %S on ilmoitettu olevan hy\u00f6kk\u00e4yssivusto ja sen avaaminen on estetty turvallisuusasetuksiesi perusteella.
phishingBlocked=Sivuston %S on ilmoitettu olevan huijaussivusto, jonka tarkoituksena on saada k\u00e4ytt\u00e4j\u00e4t luovuttamaan henkil\u00f6- tai pankkitietojaan.
cspFrameAncestorBlocked=T\u00e4ll\u00e4 sivulla on sis\u00e4ll\u00f6n tietosuojak\u00e4yt\u00e4nt\u00f6, joka est\u00e4\u00e4 sen sis\u00e4llytt\u00e4misen toiseen sivuun t\u00e4ll\u00e4 tavalla.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Avattavaa sivua ei voida n\u00e4ytt\u00e4\u00e4, koska tiedonsiirrossa tapahtui virhe.
remoteXUL=T\u00e4m\u00e4 sivu k\u00e4ytt\u00e4\u00e4 teknologiaa, jota Pale Moon ei en\u00e4\u00e4 oletuksena tue.

