#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0648\u0627\u0635\u0644 \u0628\u0634\u0643\u0644 \u0622\u0645\u0646.  \u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f \u0644\u0627 \u064a\u062f\u0639\u0645 \u0627\u0644\u062a\u0639\u0645\u064a\u0629 \u0639\u0627\u0644\u064a\u0629 \u0627\u0644\u0645\u0633\u062a\u0648\u0649.
SSL_ERROR_US_ONLY_SERVER=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0648\u0627\u0635\u0644 \u0628\u0634\u0643\u0644 \u0622\u0645\u0646.  \u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f \u064a\u062d\u062a\u0627\u062c \u062a\u0639\u0645\u064a\u0629 \u0639\u0627\u0644\u064a\u0629 \u0627\u0644\u0645\u0633\u062a\u0648\u0649 \u0648\u0647\u064a \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629.
SSL_ERROR_NO_CYPHER_OVERLAP=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u062a\u0648\u0627\u0635\u0644 \u0628\u0634\u0643\u0644 \u0622\u0645\u0646 \u0645\u0639 \u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f\: \u0644\u0627 \u062a\u0648\u062c\u062f \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0627\u062a \u062a\u0639\u0645\u064a\u0629 \u0645\u0634\u062a\u0631\u0643\u0629.
SSL_ERROR_NO_CERTIFICATE=\u062a\u0639\u0630\u0631 \u0625\u064a\u062c\u0627\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0623\u0648 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0636\u0631\u0648\u0631\u064a \u0644\u0644\u0645\u0635\u0627\u062f\u0642\u0629.
SSL_ERROR_BAD_CERTIFICATE=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0648\u0627\u0635\u0644 \u0628\u0634\u0643\u0644 \u0622\u0645\u0646 \u0645\u0639 \u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f\: \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f \u0645\u0631\u0641\u0648\u0636\u0629.
SSL_ERROR_UNUSED_5=\u0631\u0645\u0632 \u062e\u0637\u0623 SSL \u063a\u064a\u0631 \u0645\u062a\u0639\u0631\u0651\u0641 \u0639\u0644\u064a\u0647.
SSL_ERROR_BAD_CLIENT=\u062a\u0644\u0642\u0649 \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0628\u064a\u0627\u0646\u0627\u062a \u0633\u064a\u0626\u0629 \u0645\u0646 \u0627\u0644\u0639\u0645\u064a\u0644.
SSL_ERROR_BAD_SERVER=\u062a\u0644\u0642\u0649 \u0627\u0644\u0639\u0645\u064a\u0644 \u0628\u064a\u0627\u0646\u0627\u062a \u0633\u064a\u0626\u0629 \u0645\u0646 \u0627\u0644\u062e\u0627\u062f\u0648\u0645.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=\u0646\u0648\u0639 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645.
SSL_ERROR_UNSUPPORTED_VERSION=\u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f \u064a\u0633\u062a\u062e\u062f\u0645 \u0646\u0633\u062e\u0629 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0645\u0646 \u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 \u0627\u0644\u0623\u0645\u0627\u0646.
SSL_ERROR_UNUSED_10=\u0631\u0645\u0632 \u062e\u0637\u0623 SSL \u063a\u064a\u0631 \u0645\u062a\u0639\u0631\u0651\u0641 \u0639\u0644\u064a\u0647.
SSL_ERROR_WRONG_CERTIFICATE=\u0641\u0634\u0644\u062a \u0645\u0635\u0627\u062f\u0642\u0629 \u0627\u0644\u0639\u0645\u064a\u0644\: \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u0635 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d \u0644\u0627 \u064a\u062a\u0637\u0627\u0628\u0642 \u0645\u0639 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0639\u0627\u0645 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a.
SSL_ERROR_BAD_CERT_DOMAIN=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0648\u0627\u0635\u0644 \u0628\u0634\u0643\u0644 \u0622\u0645\u0646 \u0645\u0639 \u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f\: \u0627\u0633\u0645 \u0627\u0644\u0645\u062c\u0627\u0644 \u0627\u0644\u0645\u0637\u0644\u0648\u0628 \u0644\u0627 \u064a\u062a\u0637\u0627\u0628\u0642 \u0645\u0639 \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u062e\u0627\u062f\u0648\u0645.
SSL_ERROR_POST_WARNING=\u0631\u0645\u0632 \u062e\u0637\u0623 SSL \u063a\u064a\u0631 \u0645\u062a\u0639\u0631\u0651\u0641 \u0639\u0644\u064a\u0647.
SSL_ERROR_SSL2_DISABLED=\u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f \u064a\u062f\u0639\u0645 \u0641\u0642\u0637 \u0627\u0644\u0646\u0633\u062e\u0629 2 \u0645\u0646 SSL\u060c \u0648\u0627\u0644\u062a\u064a \u0647\u064a \u0645\u0639\u0637\u0644\u0629 \u0645\u062d\u0644\u064a\u064b\u0627.
SSL_ERROR_BAD_MAC_READ=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644\u064b\u0627 \u0630\u0627 \u0631\u0645\u0632 \u0645\u0635\u0627\u062f\u0642\u0629 \u0631\u0633\u0627\u0644\u0629 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d.
SSL_ERROR_BAD_MAC_ALERT=\u0623\u062e\u0628\u0631 \u0646\u062f SSL \u0639\u0646 \u0631\u0645\u0632 \u0645\u0635\u0627\u062f\u0642\u0629 \u0631\u0633\u0627\u0644\u0629 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d.
SSL_ERROR_BAD_CERT_ALERT=\u0646\u062f SSL \u0644\u0627 \u064a\u0645\u0643\u0646\u0647 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0634\u0647\u0627\u062f\u062a\u0643.
SSL_ERROR_REVOKED_CERT_ALERT=\u0631\u0641\u0636 \u0646\u062f SSL \u0634\u0647\u0627\u062f\u062a\u0643 \u0644\u0623\u0646\u0647\u0627 \u0628\u0627\u0637\u0644\u0629.
SSL_ERROR_EXPIRED_CERT_ALERT=\u0631\u0641\u0636 \u0646\u062f SSL \u0634\u0647\u0627\u062f\u062a\u0643 \u0644\u0623\u0646\u0647\u0627 \u0645\u0646\u062a\u0647\u064a\u0629 \u0627\u0644\u0635\u0644\u0627\u062d\u064a\u0629.
SSL_ERROR_SSL_DISABLED=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u0627\u062a\u0635\u0627\u0644\: SSL \u0645\u0639\u0637\u0644.
SSL_ERROR_FORTEZZA_PQG=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u0627\u062a\u0635\u0627\u0644\: \u0646\u062f SSL \u0641\u064a \u0645\u062c\u0627\u0644 FORTEZZA \u0622\u062e\u0631.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=\u0637\u064f\u0644\u0628 \u0637\u0627\u0642\u0645 \u0634\u0641\u0631\u0629 SSL \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SSL_ERROR_NO_CIPHERS_SUPPORTED=\u0644\u0627 \u0637\u0648\u0627\u0642\u0645 \u0634\u064a\u0641\u0631\u0627\u062a \u0645\u0648\u062c\u0648\u062f\u0629 \u0648\u0645\u0641\u0639\u0644\u0629 \u0641\u064a \u0647\u0630\u0627 \u0627\u0644\u0628\u0631\u0646\u0627\u0645\u062c.
SSL_ERROR_BAD_BLOCK_PADDING=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644\u064b\u0627 \u0630\u0627 \u062a\u0648\u0633\u064a\u062f \u0643\u062a\u0644\u0627\u062a \u0633\u064a\u0626.
SSL_ERROR_RX_RECORD_TOO_LONG=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644\u064b\u0627 \u064a\u062c\u0627\u0648\u0632 \u0627\u0644\u0637\u0648\u0644 \u0627\u0644\u0623\u0642\u0635\u0649 \u0627\u0644\u0645\u0633\u0645\u0648\u062d.
SSL_ERROR_TX_RECORD_TOO_LONG=\u062d\u0627\u0648\u0644 SSL \u0623\u0646 \u064a\u0631\u0633\u0644 \u0633\u062c\u0644\u064b\u0627 \u064a\u062c\u0627\u0648\u0632 \u0627\u0644\u0637\u0648\u0644 \u0627\u0644\u0623\u0642\u0635\u0649 \u0627\u0644\u0645\u0633\u0645\u0648\u062d.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0637\u0644\u0628 \u0627\u0644\u062a\u0631\u062d\u064a\u0628 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0631\u062d\u064a\u0628 \u0628\u0627\u0644\u0639\u0645\u064a\u0644 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0631\u062d\u064a\u0628 \u0628\u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0637\u0644\u0628 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0645\u0651 \u0627\u0644\u062a\u0631\u062d\u064a\u0628 \u0628\u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0639\u0645\u064a\u0644 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_FINISHED=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0645\u0646\u062a\u0647\u064a\u0629 \u062a\u0627\u0644\u0641\u0629.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u062a\u062e\u0635\u0635 \u062a\u063a\u064a\u064a\u0631 \u0627\u0644\u0634\u0641\u0631\u0629 \u062a\u0627\u0644\u0641.
SSL_ERROR_RX_MALFORMED_ALERT=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u062a\u0646\u0628\u064a\u0647 \u062a\u0627\u0644\u0641.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0627\u0644\u0641.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u0628\u064a\u0627\u0646\u0627\u062a \u062a\u0637\u0628\u064a\u0642 \u062a\u0627\u0644\u0641.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0637\u0644\u0628 \u0627\u0644\u062a\u0631\u062d\u064a\u0628 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0631\u062d\u064a\u0628 \u0627\u0644\u0639\u0645\u064a\u0644 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0631\u062d\u064a\u0628 \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0637\u0644\u0628 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 '\u062a\u0645 \u0627\u0644\u062a\u0631\u062d\u064a\u0628 \u0628\u0627\u0644\u062e\u0627\u062f\u0648\u0645' \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0639\u0645\u064a\u0644 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_FINISHED=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0645\u0646\u062a\u0647\u064a\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u062e\u0635\u0635 \u062a\u063a\u064a\u064a\u0631 \u0627\u0644\u0634\u0641\u0631\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_UNEXPECTED_ALERT=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u062a\u0646\u0628\u064a\u0647 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u0645\u0635\u0627\u0641\u062d\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u0628\u064a\u0627\u0646\u0627\u062a \u062a\u0637\u0628\u064a\u0642 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644\u064b\u0627 \u0630\u0627 \u0646\u0648\u0639 \u0645\u062d\u062a\u0648\u0649 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0630\u0627\u062a \u0646\u0648\u0639 \u0631\u0633\u0627\u0644\u0629 \u0645\u062c\u0647\u0648\u0644.
SSL_ERROR_RX_UNKNOWN_ALERT=\u0627\u0633\u062a\u0644\u0645 SSL \u0633\u062c\u0644 \u062a\u0646\u0628\u064a\u0647 \u0630\u0627 \u0648\u0635\u0641 \u062a\u0646\u0628\u064a\u0647 \u0645\u062c\u0647\u0648\u0644.
SSL_ERROR_CLOSE_NOTIFY_ALERT=\u0646\u062f SSL \u0623\u063a\u0644\u0642 \u0647\u0630\u0627 \u0627\u0644\u0627\u062a\u0635\u0627\u0644.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=\u0644\u0645 \u064a\u0643\u0646 \u0646\u062f SSL \u064a\u062a\u0648\u0642\u0639 \u0631\u0633\u0627\u0644\u0629 \u0627\u0644\u0645\u0635\u0627\u0641\u062d\u0629 \u0627\u0644\u062a\u064a \u0627\u0633\u062a\u0644\u0645\u0647\u0627.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=\u062a\u0639\u0630\u0631 \u0639\u0644\u0649 \u0646\u062f SSL \u0641\u0643 \u0636\u063a\u0637 \u0633\u062c\u0644 SSL \u0627\u0644\u0630\u064a \u0627\u0633\u062a\u0644\u0645\u0647 \u0628\u0646\u062c\u0627\u062d.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=\u062a\u0639\u0630\u0631 \u0639\u0644\u0649 \u0646\u062f SSL \u0627\u0644\u062a\u0641\u0627\u0648\u0636 \u0639\u0644\u0649 \u0645\u062c\u0645\u0648\u0639\u0629 \u0645\u0639\u0637\u064a\u0627\u062a \u0623\u0645\u0646 \u0645\u0642\u0628\u0648\u0644\u0629.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=\u0631\u0641\u0636 \u0646\u062f SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u0644\u0623\u0646 \u0645\u062d\u062a\u0648\u0627\u0647\u0627 \u063a\u064a\u0631 \u0642\u0628\u0648\u0644.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=\u0644\u0627 \u064a\u062f\u0639\u0645 \u0646\u062f SSL \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0630\u064a \u0627\u0633\u062a\u0644\u0645\u0647.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=\u0644\u062f\u0649 \u0646\u062f SSL \u0645\u0634\u0643\u0644\u0629 \u063a\u064a\u0631 \u0645\u062d\u062f\u062f\u0629 \u0645\u0639 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u062a\u064a \u0627\u0633\u062a\u0644\u0645\u0647\u0627.
SSL_ERROR_GENERATE_RANDOM_FAILURE=\u0639\u0627\u0646\u0649 SSL \u0645\u0646 \u0641\u0634\u0644 \u0645\u0639 \u0645\u0648\u0644\u062f \u0623\u0631\u0642\u0627\u0645\u0647 \u0627\u0644\u0639\u0634\u0648\u0627\u0626\u064a.
SSL_ERROR_SIGN_HASHES_FAILURE=\u062a\u0639\u0630\u0631 \u062a\u0648\u0642\u064a\u0639 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a \u0631\u0642\u0645\u064a\u064b\u0627 \u0644\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0634\u0647\u0627\u062f\u062a\u0643.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=\u062a\u0639\u0630\u0631 \u0639\u0644\u0649 SSL \u0627\u0633\u062a\u062e\u0631\u0627\u062c \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0639\u0627\u0645 \u0645\u0646 \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=\u062d\u062f\u062b \u0641\u0634\u0644 \u063a\u064a\u0631 \u0645\u062d\u062f\u062f \u0623\u062b\u0646\u0627\u0621 \u0645\u0639\u0627\u0644\u062c\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0644 SSL.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=\u062d\u062f\u062b \u0641\u0634\u0644 \u063a\u064a\u0631 \u0645\u062d\u062f\u062f \u0623\u062b\u0646\u0627\u0621 \u0645\u0639\u0627\u0644\u062c\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0639\u0645\u064a\u0644 \u0644 SSL.
SSL_ERROR_ENCRYPTION_FAILURE=\u0641\u0634\u0644\u062a \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u062a\u0639\u0645\u064a\u0629 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0636\u062e\u0645\u0629 \u0641\u064a \u0637\u0627\u0642\u0645 \u0627\u0644\u0634\u0641\u0631\u0629 \u0627\u0644\u0645\u062e\u062a\u0627\u0631.
SSL_ERROR_DECRYPTION_FAILURE=\u0641\u0634\u0644\u062a \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u0627\u0633\u062a\u062e\u0631\u0627\u062c \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0636\u062e\u0645\u0629 \u0641\u064a \u0637\u0627\u0642\u0645 \u0627\u0644\u0634\u0641\u0631\u0629 \u0627\u0644\u0645\u062e\u062a\u0627\u0631.
SSL_ERROR_SOCKET_WRITE_FAILURE=\u0641\u0634\u0644\u062a \u0645\u062d\u0627\u0648\u0644\u0629 \u0643\u062a\u0627\u0628\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0645\u0634\u0641\u0631\u0629 \u0625\u0644\u0649 \u0645\u0642\u0628\u0633 \u0645\u0633\u062a\u0628\u0637\u0646.
SSL_ERROR_MD5_DIGEST_FAILURE=\u0641\u0634\u0644\u062a \u062f\u0627\u0644\u0629 \u0628\u0639\u062b\u0631\u0629 MD5.
SSL_ERROR_SHA_DIGEST_FAILURE=\u0641\u0634\u0644\u062a \u062f\u0627\u0644\u0629 \u0628\u0639\u062b\u0631\u0629 SHA-1.
SSL_ERROR_MAC_COMPUTATION_FAILURE=\u0641\u0634\u0644\u062a \u062d\u0648\u0633\u0628\u0629 MAC.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=\u0641\u0634\u0644 \u0625\u0646\u0634\u0627\u0621 \u0633\u064a\u0627\u0642 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0645\u062a\u0646\u0627\u0638\u0631.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=\u0641\u0634\u0644 \u0625\u0632\u0627\u0644\u0629 \u063a\u0644\u0627\u0641 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0645\u062a\u0646\u0627\u0638\u0631 \u0641\u064a \u0631\u0633\u0627\u0644\u0629 \u062a\u0628\u0627\u062f\u0644\u0645 \u0641\u062a\u0627\u062d \u0627\u0644\u0639\u0645\u064a\u0644.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=\u062d\u0627\u0648\u0644 \u062e\u0627\u062f\u0648\u0645 SSL \u0623\u0646 \u064a\u0633\u062a\u062e\u062f\u0645 \u0645\u0641\u062a\u0627\u062d\u064b\u0627 \u0639\u0627\u0645\u064b\u0627 \u0630\u0648 \u0645\u0633\u062a\u0648\u0649 \u0645\u0646\u0632\u0644\u064a \u0645\u0639 \u0637\u0627\u0642\u0645 \u0634\u0641\u0631\u0629 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.
SSL_ERROR_IV_PARAM_FAILURE=\u0641\u0634\u0644 \u0631\u0645\u0632 PKCS11 \u0641\u064a \u062a\u0631\u062c\u0645\u0629 IV \u0625\u0644\u0649 \u0645\u0639\u0637\u0649.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=\u0641\u0634\u0644 \u0628\u062f\u0621 \u0637\u0627\u0642\u0645 \u0627\u0644\u0634\u0641\u0631\u0629 \u0627\u0644\u0645\u062d\u062f\u062f\u0629.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=\u0641\u0634\u0644 \u0627\u0644\u0639\u0645\u064a\u0644 \u0641\u064a \u0625\u0646\u0634\u0627\u0621 \u0645\u0641\u0627\u062a\u064a\u062d \u0627\u0644\u062c\u0644\u0633\u0627\u062a \u0644\u062c\u0644\u0633\u0629 SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=\u0644\u0627 \u064a\u0645\u0644\u0643 \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0623\u064a \u0645\u0641\u062a\u0627\u062d \u0644\u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u062a\u0628\u0627\u062f\u0644 \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d \u0627\u0644\u0645\u062c\u0631\u0651\u0628\u0629.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=\u0623\u0636\u064a\u0641\u062a \u0642\u0637\u0639\u0629 PKCS\#11 \u0627\u0644\u0623\u0645\u0646\u064a\u0629 \u0623\u0648 \u0623\u0632\u064a\u0644\u062a \u0623\u062b\u0646\u0627\u0621 \u0625\u062c\u0631\u0627\u0621 \u0627\u0644\u0639\u0645\u0644\u064a\u0629.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=\u0644\u0645 \u064a\u0645\u0643\u0646 \u0625\u064a\u062c\u0627\u062f \u0623\u064a \u0642\u0637\u0639\u0629 PKCS\#11 \u0627\u0644\u0623\u0645\u0646\u064a\u0629 \u0644\u0644\u0642\u064a\u0627\u0645 \u0628\u0627\u0644\u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629.
SSL_ERROR_NO_COMPRESSION_OVERLAP=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u062a\u0648\u0627\u0635\u0644 \u0628\u0634\u0643\u0644 \u0622\u0645\u0646 \u0645\u0639 \u0627\u0644\u062c\u0647\u0627\u0632 \u0627\u0644\u0646\u062f\: \u0644\u0627 \u064a\u0648\u062c\u062f \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0627\u062a \u0636\u063a\u0637 \u0645\u0634\u062a\u0631\u0643\u0629.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0628\u062f\u0621 \u0645\u0635\u0627\u0641\u062d\u0629 SSL \u0623\u062e\u0631\u0649 \u062d\u062a\u0649 \u062a\u0643\u062a\u0645\u0644 \u0627\u0644\u0645\u0635\u0627\u0641\u062d\u0629 \u0627\u0644\u062d\u0627\u0644\u064a\u0629.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=\u0627\u0633\u062a\u064f\u0644\u0645\u062a \u0642\u064a\u0645 \u0628\u0639\u062b\u0631\u0629 \u0645\u0635\u0627\u0641\u062d\u0627\u062a \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u0629 \u0645\u0646 \u0627\u0644\u0646\u062f.
SSL_ERROR_CERT_KEA_MISMATCH=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0623\u0646 \u062a\u064f\u0633\u062a\u062e\u062f\u0645 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u0632\u0648\u062f\u0629 \u0645\u0639 \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u062a\u0628\u0627\u062f\u0644 \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=\u0644\u064a\u0633 \u0647\u0646\u0627\u0643 \u0633\u0644\u0637\u0627\u062a \u0634\u0647\u0627\u062f\u0627\u062a \u0645\u0648\u062b\u0648\u0642\u0629 \u0645\u0646 \u0623\u062c\u0644 \u0645\u0635\u0627\u062f\u0642\u0629 \u0639\u0645\u064a\u0644 SSL.
SSL_ERROR_SESSION_NOT_FOUND=\u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0639\u0644\u0649 \u0645\u0639\u0631\u0641 \u062c\u0644\u0633\u0629 SSL \u0644\u0644\u0639\u0645\u064a\u0644 \u0641\u064a \u0645\u062e\u0628\u0623 \u062c\u0644\u0633\u0627\u062a \u0627\u0644\u062e\u0627\u062f\u0648\u0645.
SSL_ERROR_DECRYPTION_FAILED_ALERT=\u0644\u0645 \u064a\u062a\u0645\u0643\u0646 \u0627\u0644\u0646\u062f \u0645\u0646 \u0627\u0633\u062a\u062e\u0631\u0627\u062c \u0633\u062c\u0644 SSL \u0627\u0644\u0630\u064a \u0627\u0633\u062a\u0644\u0645\u0647.
SSL_ERROR_RECORD_OVERFLOW_ALERT=\u0627\u0633\u062a\u0644\u0645 \u0627\u0644\u0646\u062f \u0633\u062c\u0644 SSL \u0623\u0637\u0648\u0644 \u0645\u0646 \u0627\u0644\u0645\u0633\u0645\u0648\u062d.
SSL_ERROR_UNKNOWN_CA_ALERT=\u0644\u0645 \u064a\u062a\u0639\u0631\u0641 \u0627\u0644\u0646\u062f \u0639\u0644\u0649 \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a \u0627\u0644\u062a\u064a \u0632\u0648\u0651\u062f\u062a \u0634\u0647\u0627\u062f\u062a\u0643 \u0648\u0644\u0645 \u064a\u062b\u0642 \u0628\u0647\u0627.
SSL_ERROR_ACCESS_DENIED_ALERT=\u0627\u0633\u062a\u0644\u0645 \u0627\u0644\u0646\u062f \u0634\u0647\u0627\u062f\u0629 \u0635\u0627\u0644\u062d\u0629\u060c \u0648\u0644\u0643\u0646 \u0627\u0644\u0648\u0635\u0648\u0644 \u0645\u0631\u0641\u0648\u0636.
SSL_ERROR_DECODE_ERROR_ALERT=\u0644\u0645 \u064a\u0633\u062a\u0637\u0639 \u0627\u0644\u0646\u062f \u0641\u0643 \u062a\u0631\u0645\u064a\u0632 \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=\u064a\u062e\u0628\u0631 \u0627\u0644\u0646\u062f \u0639\u0646 \u0641\u0634\u0644 \u0641\u064a \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u062a\u0648\u0642\u064a\u0639 \u0623\u0648 \u062a\u0628\u0627\u062f\u0644 \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=\u064a\u062e\u0628\u0631 \u0627\u0644\u0646\u062f \u0623\u0646 \u0627\u0644\u062a\u0641\u0627\u0648\u0636 \u0644\u0627 \u064a\u0637\u064a\u0639 \u0623\u0646\u0638\u0645\u0629 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.
SSL_ERROR_PROTOCOL_VERSION_ALERT=\u064a\u062e\u0628\u0631 \u0627\u0644\u0646\u062f \u0639\u0646 \u0646\u0633\u062e\u0629 \u0628\u0631\u0648\u062a\u0648\u0643\u0648\u0644 \u063a\u064a\u0631 \u0645\u0644\u0627\u0626\u0645\u0629 \u0623\u0648 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=\u064a\u062d\u062a\u0627\u062c \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0634\u064a\u0641\u0631\u0627\u062a \u0623\u0643\u062b\u0631 \u0623\u0645\u0627\u0646\u064b\u0627 \u0645\u0646 \u062a\u0644\u0643 \u0627\u0644\u0645\u062f\u0639\u0648\u0645\u0629 \u0645\u0646 \u0627\u0644\u0639\u0645\u064a\u0644.
SSL_ERROR_INTERNAL_ERROR_ALERT=\u064a\u062e\u0628\u0631 \u0627\u0644\u0646\u062f \u0623\u0646\u0647 \u0648\u0627\u062c\u0647 \u062e\u0637\u0623 \u062f\u0627\u062e\u0644\u064a\u064b\u0627.
SSL_ERROR_USER_CANCELED_ALERT=\u0623\u0644\u063a\u0649 \u0645\u0633\u062a\u062e\u062f\u0645 \u0627\u0644\u0646\u062f \u0627\u0644\u0645\u0635\u0627\u0641\u062d\u0629.
SSL_ERROR_NO_RENEGOTIATION_ALERT=\u0644\u0627 \u064a\u0633\u0645\u062d \u0627\u0644\u0646\u062f \u0628\u0625\u0639\u0627\u062f\u0629 \u0627\u0644\u062a\u0641\u0627\u0648\u0636 \u0639\u0644\u0649 \u0645\u0639\u0637\u064a\u0627\u062a \u0623\u0645\u0646 SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=\u0645\u062e\u0628\u0623 \u062e\u0627\u062f\u0648\u0645 SSL \u063a\u064a\u0631 \u0645\u0639\u062f\u0651 \u0648\u063a\u064a\u0631 \u0645\u0639\u0637\u0644 \u0644\u0647\u0630\u0627 \u0627\u0644\u0645\u0642\u0628\u0633.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=\u0644\u0627 \u064a\u062f\u0639\u0645 \u0646\u062f SSL \u0627\u0645\u062a\u062f\u0627\u062f \u062a\u0631\u062d\u064a\u0628 TLS \u0627\u0644\u0645\u0637\u0644\u0648\u0628.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=\u0644\u0645 \u064a\u0633\u062a\u0637\u0639 \u0646\u062f SSL \u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0634\u0647\u0627\u062f\u062a\u0643 \u0645\u0646 \u0645\u062d\u062f\u062f \u0627\u0644\u0645\u0648\u0642\u0639 \u0627\u0644\u0645\u0632\u0648\u0651\u064e\u062f.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=\u0644\u0627 \u064a\u0645\u0644\u0643 \u0646\u062f SSL \u0634\u0647\u0627\u062f\u0627\u062a \u0644\u0627\u0633\u0645 DNS \u0627\u0644\u0645\u0637\u0644\u0648\u0628.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=\u0639\u062c\u0632 \u0646\u062f SSL \u0639\u0646 \u0627\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0625\u062c\u0627\u0628\u0629 OCSP \u0644\u0634\u0647\u0627\u062f\u062a\u0647.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=\u0623\u062e\u0628\u0631 \u0646\u062f SSL \u0639\u0646 \u0642\u064a\u0645\u0629 \u0628\u0639\u062b\u0631\u0629 \u0634\u0647\u0627\u062f\u0629 \u0633\u064a\u0626\u0629.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0630\u0643\u0631\u0629 \u062c\u0644\u0633\u0629 \u062c\u062f\u064a\u062f\u0629 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=\u0627\u0633\u062a\u0644\u0645 SSL \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0630\u0643\u0631\u0629 \u062c\u0644\u0633\u0629 \u062c\u062f\u064a\u062f\u0629 \u0633\u064a\u0626\u0629 \u0627\u0644\u062a\u0643\u0648\u064a\u0646.
SSL_ERROR_DECOMPRESSION_FAILURE=\u0627\u0633\u062a\u0644\u0645 SSL \u062a\u0633\u062c\u064a\u0644\u064b\u0627 \u0645\u0636\u063a\u0648\u0637\u064b\u0627 \u062a\u0639\u0630\u0631 \u0641\u0643 \u0636\u063a\u0637\u0647.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=\u0625\u0639\u0627\u062f\u0629 \u0627\u0644\u062a\u0641\u0627\u0648\u0636 \u063a\u064a\u0631 \u0645\u0633\u0645\u0648\u062d\u0629 \u0641\u064a \u0645\u0642\u0628\u0633 SSL \u0647\u0630\u0627.
SSL_ERROR_UNSAFE_NEGOTIATION=\u062d\u0627\u0648\u0644 \u0627\u0644\u0646\u062f \u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0645\u0635\u0627\u0641\u062d\u0629 \u0642\u062f\u064a\u0645\u0629 \u0627\u0644\u0637\u0631\u0627\u0632 (\u0641\u064a\u0647\u0627 \u062b\u063a\u0631\u0627\u062a \u0643\u0627\u0645\u0646\u0629).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=\u0627\u0633\u062a\u0644\u0645 SSL \u062a\u0633\u062c\u064a\u0644\u064b\u0627 \u063a\u064a\u0631 \u0645\u0636\u063a\u0648\u0637 \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=\u0627\u0633\u062a\u0644\u0645 SSL \u0645\u0641\u062a\u0627\u062d ephemeral Diffie-Hellman \u0641\u064a \u0631\u0633\u0627\u0644\u0629 \u0645\u0635\u0627\u0641\u062d\u0629 \u062a\u0628\u0627\u062f\u0644 \u0645\u0641\u0627\u062a\u064a\u062d \u0627\u0644\u062e\u0627\u062f\u0648\u0645\u0627\u062a.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=\u0627\u0633\u062a\u0644\u0645 SSL \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0645\u062a\u062f\u0627\u062f NPN \u063a\u064a\u0631 \u0633\u0644\u064a\u0645\u0629.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=\u062e\u0627\u0635\u064a\u0629 SSL \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0641\u064a \u0627\u062a\u0635\u0627\u0644\u0627\u062a SSL\u200f 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=\u062e\u0627\u0635\u064a\u0629 SSL \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0644\u0644\u062e\u0648\u0627\u062f\u064a\u0645.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=\u062e\u0627\u0635\u064a\u0629 SSL \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0644\u0644\u0639\u0645\u0644\u0627\u0621.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=\u062d\u0635\u0644 \u062e\u0637\u0623 \u062f\u062e\u0644/\u062e\u0631\u062c \u0623\u062b\u0646\u0627\u0621 \u0627\u0644\u0645\u0635\u0627\u062f\u0642\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629.
SEC_ERROR_LIBRARY_FAILURE=\u0641\u0634\u0644 \u0641\u064a \u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629.
SEC_ERROR_BAD_DATA=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0627\u0633\u062a\u064f\u0644\u0645\u062a \u0628\u064a\u0627\u0646\u0627\u062a \u0633\u064a\u0626\u0629.
SEC_ERROR_OUTPUT_LEN=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u062e\u0637\u0623 \u0641\u064a \u0637\u0648\u0644 \u0627\u0644\u062e\u0631\u062c.
SEC_ERROR_INPUT_LEN=\u0648\u0627\u062c\u0647\u062a \u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629 \u062e\u0637\u0623 \u0641\u064a \u0637\u0648\u0644 \u0627\u0644\u0625\u062f\u062e\u0627\u0644.
SEC_ERROR_INVALID_ARGS=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0645\u0639\u0637\u064a\u0627\u062a \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_INVALID_ALGORITHM=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_INVALID_AVA=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: AVA \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_INVALID_TIME=\u0646\u0635 \u0627\u0644\u0648\u0642\u062a \u0645\u0646\u0633\u0642 \u0628\u0634\u0643\u0644 \u063a\u064a\u0631 \u0633\u064a\u0626.
SEC_ERROR_BAD_DER=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0631\u0633\u0627\u0644\u0629 \u0645\u0631\u0645\u0632\u0629 \u0628 DER \u0645\u0646\u0633\u0642\u0629 \u0628\u0634\u0643\u0644 \u0633\u064a\u0626.
SEC_ERROR_BAD_SIGNATURE=\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f \u0644\u062f\u064a\u0647\u0627 \u062a\u0648\u0642\u064a\u0639 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_EXPIRED_CERTIFICATE=\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f \u0645\u0646\u062a\u0647\u064a\u0629 \u0627\u0644\u0635\u0644\u0627\u062d\u064a\u0629.
SEC_ERROR_REVOKED_CERTIFICATE=\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f \u0645\u0641\u0633\u0648\u062e\u0629.
SEC_ERROR_UNKNOWN_ISSUER=\u0644\u0645 \u064a\u064f\u062a\u0639\u0631\u0641 \u0639\u0644\u0649 \u0645\u0632\u0648\u0651\u062f \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f.
SEC_ERROR_BAD_KEY=\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0646\u062f \u0627\u0644\u0639\u0627\u0645 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_BAD_PASSWORD=\u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631 \u0627\u0644\u0623\u0645\u0646\u064a\u0629 \u0627\u0644\u0645\u062f\u062e\u0644\u0629 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u0629.
SEC_ERROR_RETRY_PASSWORD=\u0623\u062f\u062e\u0644\u062a \u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631 \u0627\u0644\u062c\u062f\u064a\u062f\u0629 \u0628\u0634\u0643\u0644 \u062e\u0637\u0623.  \u0631\u062c\u0627\u0621\u064b \u062d\u0627\u0648\u0644 \u062b\u0627\u0646\u064a\u0629.
SEC_ERROR_NO_NODELOCK=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0644\u0627 \u0642\u0641\u0644 \u0644\u0644\u0639\u0642\u062f.
SEC_ERROR_BAD_DATABASE=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0634\u064a\u0626\u0629.
SEC_ERROR_NO_MEMORY=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0641\u0634\u0644 \u062a\u062e\u0635\u064a\u0635 \u0627\u0644\u0630\u0627\u0643\u0631\u0629.
SEC_ERROR_UNTRUSTED_ISSUER=\u0627\u0639\u062a\u0628\u0631 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0645\u0632\u0648\u0651\u062f \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f \u063a\u064a\u0631 \u0645\u0648\u062b\u0648\u0642.
SEC_ERROR_UNTRUSTED_CERT=\u0627\u0639\u062a\u0628\u0631 \u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0646\u062f \u063a\u064a\u0631 \u0645\u0648\u062b\u0648\u0642\u0629.
SEC_ERROR_DUPLICATE_CERT=\u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0645\u0648\u062c\u0648\u062f\u0629 \u0645\u0633\u0628\u0642\u064b\u0627 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a\u0643.
SEC_ERROR_DUPLICATE_CERT_NAME=\u0627\u0633\u0645 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u062d\u0645\u0651\u0644\u0629 \u0645\u0648\u062c\u0648\u062f \u0645\u0633\u0628\u0642\u064b\u0627 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a\u0643.
SEC_ERROR_ADDING_CERT=\u062d\u062f\u062b \u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0625\u0636\u0627\u0641\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0625\u0644\u0649 \u0642\u0627\u0639\u062f\u0629 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a.
SEC_ERROR_FILING_KEY=\u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0625\u0639\u0627\u062f\u0629 \u0635\u0641 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0644\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_NO_KEY=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u0639\u062b\u0648\u0631 \u0639\u0644\u0649 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u0635 \u0644\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d
SEC_ERROR_CERT_VALID=\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_CERT_NOT_VALID=\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_CERT_NO_RESPONSE=\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a\: \u0644\u0627 \u0625\u062c\u0627\u0628\u0629
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=\u0627\u0646\u062a\u0647\u062a \u0635\u0644\u0627\u062d\u064a\u0629 \u0634\u0647\u0627\u062f\u0629 \u0645\u0632\u0648\u0651\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629.  \u062a\u062d\u0642\u0642 \u0645\u0646 \u062a\u0627\u0631\u064a\u062e \u0646\u0638\u0627\u0645\u0643 \u0648\u0648\u0642\u062a\u0647.
SEC_ERROR_CRL_EXPIRED=\u0627\u0646\u062a\u0647\u062a \u0635\u0644\u0627\u062d\u064a\u0629 CRL \u0627\u0644\u062e\u0627\u0635 \u0628\u0645\u0632\u0648\u0651\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629.  \u062d\u062f\u0651\u062b\u0647 \u0623\u0648 \u062a\u062d\u0642\u0642 \u0645\u0646 \u062a\u0627\u0631\u064a\u062e \u0648\u0648\u0642\u062a \u0646\u0638\u0627\u0645\u0643.
SEC_ERROR_CRL_BAD_SIGNATURE=CRL \u0627\u0644\u062e\u0627\u0635 \u0628\u0645\u0632\u0648\u0651\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u064a\u0645\u0644\u0643 \u062a\u0648\u0642\u064a\u0639\u064b\u0627 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_CRL_INVALID=\u0644\u0642\u200c\u0633\u200c\u0634 \u0627\u0644\u062c\u062f\u064a\u062f\u0629 \u0647\u064a\u0626\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_EXTENSION_VALUE_INVALID=\u0642\u064a\u0645\u0629 \u0627\u0645\u062a\u062f\u0627\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_EXTENSION_NOT_FOUND=\u0627\u0645\u062a\u062f\u0627\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u0648\u062c\u0648\u062f.
SEC_ERROR_CA_CERT_INVALID=\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u0632\u0648\u0651\u062f \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=\u062a\u0642\u064a\u064a\u062f \u0637\u0648\u0644 \u0645\u0633\u0627\u0631 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_CERT_USAGES_INVALID=\u062d\u0642\u0644 \u0627\u0633\u062a\u062e\u062f\u0627\u0645\u0627\u062a \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_INTERNAL_ONLY=**\u0627\u0644\u0648\u062d\u062f\u0629 \u0627\u0644\u062f\u0627\u062e\u0644\u064a\u0629 \u0627\u0644\u0648\u062d\u064a\u062f\u0629**
SEC_ERROR_INVALID_KEY=\u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0644\u0627 \u064a\u062f\u0639\u0645 \u0627\u0644\u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=\u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u062a\u062d\u062a\u0648\u064a \u0639\u0644\u0649 \u0627\u0645\u062a\u062f\u0627\u062f \u062d\u0631\u062c \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SEC_ERROR_OLD_CRL=\u0627\u0644 CRL \u0627\u0644\u062c\u062f\u064a\u062f \u0644\u064a\u0633 \u0623\u062d\u062f\u062b \u0645\u0646 \u0627\u0644\u062d\u0627\u0644\u064a.
SEC_ERROR_NO_EMAIL_CERT=\u063a\u064a\u0631 \u0645\u0634\u0641\u0631 \u0623\u0648 \u0645\u0648\u0642\u0651\u0639\: \u0623\u0646\u062a \u0644\u0627 \u062a\u0645\u0644\u0643 \u062d\u062a\u0649 \u0627\u0644\u0622\u0646 \u0634\u0647\u0627\u062f\u0629 \u0628\u0631\u064a\u062f \u0625\u0644\u0643\u062a\u0631\u0648\u0646\u064a.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=\u063a\u064a\u0631 \u0645\u0634\u0641\u0631\: \u0623\u0646\u062a \u0644\u0627 \u062a\u0645\u0644\u0643 \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a \u0644\u0643\u0644 \u0645\u0646 \u0627\u0644\u0645\u0633\u062a\u0644\u0645\u064a\u0646.
SEC_ERROR_NOT_A_RECIPIENT=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u0627\u0633\u062a\u062e\u0631\u0627\u062c\: \u0623\u0646\u062a \u0644\u0633\u062a \u0645\u0646 \u0627\u0644\u0645\u0633\u062a\u0644\u0645\u064a\u0646\u060c \u0623\u0648 \u0623\u0646\u0647 \u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0648\u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u0635 \u0627\u0644\u0645\u062a\u0637\u0627\u0628\u0642\u064a\u0646.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u0627\u0633\u062a\u062e\u0631\u0627\u062c\: \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u062a\u0639\u0645\u064a\u0629 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0644\u0627 \u062a\u062a\u0637\u0627\u0628\u0642 \u0645\u0639 \u0634\u0647\u0627\u062f\u062a\u0643.
SEC_ERROR_PKCS7_BAD_SIGNATURE=\u0641\u0634\u0644 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u062a\u0648\u0642\u064a\u0639\: \u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0639\u0644\u0649 \u0645\u0648\u0642\u0651\u0639\u060c \u0623\u0648 \u0639\u064f\u062b\u0631 \u0639\u0644\u0649 \u0627\u0644\u0643\u062b\u064a\u0631 \u062c\u062f\u064b\u0627 \u0645\u0646 \u0627\u0644\u0645\u0648\u0642\u0651\u0639\u064a\u0646\u060c \u0623\u0648 \u0623\u0646 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a \u062a\u0627\u0644\u0641\u0629 \u0623\u0648 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u0629.
SEC_ERROR_UNSUPPORTED_KEYALG=\u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u0645\u0641\u062a\u0627\u062d \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0623\u0648 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641\u0629.
SEC_ERROR_DECRYPTION_DISALLOWED=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0627\u0644\u0627\u0633\u062a\u062e\u0631\u0627\u062c\: \u0645\u0639\u0645\u0651\u0627\u0629 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u063a\u064a\u0631 \u0645\u0633\u0645\u0648\u062d\u0629 \u0623\u0648 \u062d\u062c\u0645 \u0645\u0641\u062a\u0627\u062d \u063a\u064a\u0631 \u0645\u0633\u0645\u0648\u062d.
XP_SEC_FORTEZZA_BAD_CARD=\u0644\u0645 \u062a\u064f\u0646\u0634\u0651\u0637 \u0628\u0637\u0627\u0642\u0629 \u0641\u0648\u0631\u062a\u064a\u0632\u0627 \u0628\u0634\u0643\u0644 \u0635\u062d\u064a\u062d.  \u0631\u062c\u0627\u0621\u064b \u0623\u0632\u0644\u0647\u0627 \u0648\u0623\u0639\u062f\u0647\u0627 \u0625\u0644\u0649 \u0645\u0632\u0648\u0651\u062f\u0647\u0627.
XP_SEC_FORTEZZA_NO_CARD=\u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0639\u0644\u0649 \u0628\u0637\u0627\u0642\u0627\u062a \u0641\u0648\u0631\u062a\u064a\u0632\u0627
XP_SEC_FORTEZZA_NONE_SELECTED=\u0644\u0645 \u062a\u064f\u062e\u062a\u0631 \u0623\u064a \u0628\u0637\u0627\u0642\u0629 \u0641\u0648\u0631\u062a\u064a\u0632\u0627
XP_SEC_FORTEZZA_MORE_INFO=\u0631\u062c\u0627\u0621\u064b \u0627\u062e\u062a\u0631 \u0634\u062e\u0635\u064a\u0629 \u0644\u0644\u062d\u0635\u0648\u0644 \u0639\u0644\u0649 \u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0623\u0643\u062b\u0631 \u0639\u0646\u0647\u0627
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=\u0627\u0644\u0634\u062e\u0635\u064a\u0629 \u063a\u064a\u0631 \u0645\u0648\u062c\u0648\u062f\u0629
XP_SEC_FORTEZZA_NO_MORE_INFO=\u0644\u0627 \u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0625\u0636\u0627\u0641\u064a\u0629 \u0639\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u062e\u0635\u064a\u0629
XP_SEC_FORTEZZA_BAD_PIN=\u062f\u0628\u0648\u0633 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d
XP_SEC_FORTEZZA_PERSON_ERROR=\u0644\u0645 \u064a\u0645\u0643\u0646 \u0628\u062f\u0621 \u0634\u062e\u0635\u064a\u0627\u062a \u0641\u0648\u0631\u062a\u064a\u0632\u0627.
SEC_ERROR_NO_KRL=\u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0639\u0644\u0649 \u0623\u064a KRL \u0644\u0634\u0647\u0627\u062f\u0629 \u0647\u0630\u0627 \u0627\u0644\u0645\u0648\u0642\u0639.
SEC_ERROR_KRL_EXPIRED=\u0627\u0646\u062a\u0647\u062a \u0635\u0644\u0627\u062d\u064a\u0629 KRL \u0627\u0644\u062e\u0627\u0635 \u0628\u0647\u0630\u0627 \u0627\u0644\u0645\u0648\u0642\u0639.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL \u0627\u0644\u062e\u0627\u0635 \u0628\u0634\u0647\u0627\u062f\u0629 \u0647\u0630\u0627 \u0627\u0644\u0645\u0648\u0642\u0639 \u0644\u062f\u064a\u0647 \u062a\u0648\u0642\u064a\u0639 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_REVOKED_KEY=\u0645\u0641\u062a\u0627\u062d \u0634\u0647\u0627\u062f\u0629 \u0647\u0630\u0627 \u0627\u0644\u0645\u0648\u0642\u0639 \u0642\u062f \u0641\u064f\u0633\u062e.
SEC_ERROR_KRL_INVALID=\u0627\u0644 KRL \u0627\u0644\u062c\u062f\u064a\u062f \u0644\u062f\u064a\u0647 \u062a\u0646\u0633\u064a\u0642 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_NEED_RANDOM=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u062a\u062d\u062a\u0627\u062c \u0628\u064a\u0627\u0646\u0627\u062a \u0639\u0634\u0648\u0627\u0626\u064a\u0629.
SEC_ERROR_NO_MODULE=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629\: \u0644\u0627 \u0648\u062d\u062f\u0629 \u0623\u0645\u0646 \u064a\u0645\u0643\u0646\u0647\u0627 \u0625\u062c\u0631\u0627\u0621 \u0627\u0644\u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629.
SEC_ERROR_NO_TOKEN=\u0628\u0637\u0627\u0642\u0629 \u0627\u0644\u0623\u0645\u0646 \u0623\u0648 \u0627\u0644\u0642\u0637\u0639\u0629 \u0627\u0644\u0623\u0645\u0646\u064a\u0629 \u063a\u064a\u0631 \u0645\u0648\u062c\u0648\u062f\u0629\u060c \u0623\u0648 \u062a\u062d\u062a\u0627\u062c \u062a\u0641\u0639\u064a\u0644\u0647\u0627\u060c \u0623\u0648 \u0623\u0632\u064a\u0644\u062a.
SEC_ERROR_READ_ONLY=\u0627\u0644\u0645\u0643\u062a\u0628\u0629 \u0627\u0644\u0627\u0645\u0646\u064a\u0629\: \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0644\u0644\u0642\u0631\u0627\u0621\u0629 \u0641\u0642\u0637.
SEC_ERROR_NO_SLOT_SELECTED=\u0644\u0645 \u062a\u064f\u062e\u062a\u0631 \u0623\u064a \u0641\u062a\u062d\u0629 \u0623\u0648 \u0642\u0637\u0639\u0629 \u0623\u0645\u0646\u064a\u0629.
SEC_ERROR_CERT_NICKNAME_COLLISION=\u0647\u0646\u0627\u0643 \u0634\u0647\u0627\u062f\u0629 \u0628\u0646\u0641\u0633 \u0627\u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u0639\u0627\u0631 \u0645\u0648\u062c\u0648\u062f\u0629 \u0645\u0633\u0628\u0642\u064b\u0627.
SEC_ERROR_KEY_NICKNAME_COLLISION=\u0647\u0646\u0627\u0643 \u0645\u0641\u062a\u0627\u062d \u0628\u0646\u0641\u0633 \u0627\u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u0639\u0627\u0631 \u0645\u0648\u062c\u0648\u062f \u0645\u0633\u0628\u0642\u064b\u0627.
SEC_ERROR_SAFE_NOT_CREATED=\u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0625\u0646\u0634\u0627\u0621 \u0627\u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0622\u0645\u0646
SEC_ERROR_BAGGAGE_NOT_CREATED=\u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0625\u0646\u0634\u0627\u0621 \u0643\u0627\u0626\u0646 \u0627\u0644\u0623\u0645\u062a\u0639\u0629
XP_JAVA_REMOVE_PRINCIPAL_ERROR=\u062a\u0639\u0630\u0631\u062a \u0625\u0632\u0627\u0644\u0629 \u0627\u0644\u0631\u0626\u064a\u0633\u064a
XP_JAVA_DELETE_PRIVILEGE_ERROR=\u062a\u0639\u0630\u0631\u062a \u0625\u0632\u0627\u0644\u0629 \u0627\u0644\u0627\u0645\u062a\u064a\u0627\u0632
XP_JAVA_CERT_NOT_EXISTS_ERROR=\u0647\u0630\u0627 \u0627\u0644\u0631\u0626\u064a\u0633 \u0644\u0627 \u064a\u0645\u0644\u0643 \u0634\u0647\u0627\u062f\u0629
SEC_ERROR_BAD_EXPORT_ALGORITHM=\u0627\u0644\u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629 \u063a\u064a\u0631 \u0645\u0633\u0645\u0648\u062d \u0628\u0647\u0627.
SEC_ERROR_EXPORTING_CERTIFICATES=\u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0645\u062d\u0627\u0648\u0644\u0629 \u062a\u0635\u062f\u064a\u0631 \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a.
SEC_ERROR_IMPORTING_CERTIFICATES=\u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0645\u062d\u0627\u0648\u0644\u0629 \u0627\u0633\u062a\u064a\u0631\u0627\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a.
SEC_ERROR_PKCS12_DECODING_PFX=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u062e\u0637\u0623 \u0641\u064a \u0641\u0643 \u0627\u0644\u062a\u0631\u0645\u064a\u0632.  \u0627\u0644\u0645\u0644\u0641 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_PKCS12_INVALID_MAC=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  MAC \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.  \u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631 \u062e\u0637\u0623 \u0623\u0648 \u0627\u0644\u0645\u0644\u0641 \u062a\u0627\u0644\u0641.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 MAC \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u0623\u0646\u0645\u0627\u0637 \u062e\u0635\u0648\u0635\u064a\u0629 \u0648\u062a\u0643\u0627\u0645\u0644 \u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631 \u0645\u062f\u0639\u0648\u0645\u0629 \u0641\u0642\u0637.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u0628\u0646\u064a\u0629 \u0627\u0644\u0645\u0644\u0641 \u062a\u0627\u0644\u0641\u0629.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u0627\u0644\u062a\u0639\u0645\u064a\u0629 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u0646\u0633\u062e\u0629 \u0627\u0644\u0645\u0644\u0641 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645\u0629.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u0643\u0644\u0645\u0629 \u0633\u0631 \u0627\u0644\u062e\u0635\u0648\u0635\u064a\u0629 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d\u0629.
SEC_ERROR_PKCS12_CERT_COLLISION=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u0627\u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u0639\u0627\u0631 \u0646\u0641\u0633\u0647 \u0645\u0648\u062c\u0648\u062f \u0645\u0633\u0628\u0642\u064b\u0627 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a.
SEC_ERROR_USER_CANCELLED=\u0627\u0644\u0645\u0633\u062a\u062e\u062f\u0645 \u0636\u063a\u0637 \u0639\u0644\u0649 \u0632\u0631 \u0627\u0644\u0625\u0644\u063a\u0627\u0621.
SEC_ERROR_PKCS12_DUPLICATE_DATA=\u063a\u064a\u0631 \u0645\u0633\u062a\u0648\u0631\u062f\u060c \u0645\u0648\u062c\u0648\u062f \u0645\u0633\u0628\u0642\u064b\u0627 \u0641\u064a \u0642\u0627\u0639\u062f\u0629 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a.
SEC_ERROR_MESSAGE_SEND_ABORTED=\u0644\u0645 \u062a\u064f\u0631\u0633\u0644 \u0627\u0644\u0631\u0633\u0627\u0644\u0629.
SEC_ERROR_INADEQUATE_KEY_USAGE=\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0645\u0641\u062a\u0627\u062d \u0627\u0644\u0634\u0647\u0627\u062c\u0629 \u063a\u064a\u0631 \u0643\u0627\u0641 \u0644\u0639\u0645\u0644\u064a\u0629 \u0627\u0644\u0645\u062c\u0631\u0651\u0628\u0629.
SEC_ERROR_INADEQUATE_CERT_TYPE=\u0646\u0648\u0639 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u0635\u0627\u062f\u0642 \u0639\u0644\u064a\u0647 \u0645\u0646 \u0623\u062c\u0644 \u0627\u0644\u062a\u0637\u0628\u064a\u0642.
SEC_ERROR_CERT_ADDR_MISMATCH=\u0627\u0644\u0639\u0646\u0648\u0627\u0646 \u0641\u064a \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u0648\u0642\u0639\u0629 \u0644\u0627 \u064a\u0637\u0627\u0628\u0642 \u0627\u0644\u0639\u0646\u0648\u0627\u0646 \u0641\u064a \u062a\u0631\u0648\u064a\u0633\u0627\u062a \u0627\u0644\u0631\u0633\u0627\u0644\u0629.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0645\u062d\u0627\u0648\u0644\u0629 \u0627\u0633\u062a\u064a\u0631\u0627\u062f \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u0635.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u062e\u0637\u0623 \u0623\u062b\u0646\u0627\u0621 \u0645\u062d\u0627\u0648\u0644\u0629 \u0627\u0633\u062a\u064a\u0631\u0627\u062f \u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.  \u062a\u0639\u0630\u0631 \u062a\u062d\u062f\u064a\u062f \u0645\u0648\u0642\u0639 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0623\u0648 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0627\u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u0633\u062a\u0639\u0627\u0631.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.  \u0644\u0645 \u064a\u0645\u0643\u0646 \u062a\u062d\u062f\u064a\u062f \u0645\u0648\u0642\u0639 \u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062e\u0627\u0635 \u0648\u062a\u0635\u062f\u064a\u0631\u0647.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.  \u062a\u0639\u0630\u0631\u062a \u0643\u062a\u0627\u0628\u0629 \u0645\u0644\u0641 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.
SEC_ERROR_PKCS12_UNABLE_TO_READ=\u062a\u0639\u0630\u0631 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.  \u062a\u0639\u0630\u0631\u062a \u0642\u0631\u0627\u0621\u0629 \u0645\u0644\u0641 \u0627\u0644\u0627\u0633\u062a\u064a\u0631\u0627\u062f.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=\u062a\u0639\u0630\u0631 \u0627\u0644\u062a\u0635\u062f\u064a\u0631.  \u0642\u0627\u0639\u062f\u0629 \u0628\u064a\u0627\u0646\u0627\u062a \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d \u062a\u0627\u0644\u0641\u0629 \u0623\u0648 \u0645\u062d\u0630\u0648\u0641\u0629.
SEC_ERROR_KEYGEN_FAIL=\u062a\u0639\u0630\u0631 \u062a\u0648\u0644\u064a\u062f \u0632\u0648\u062c \u0645\u0641\u0627\u062a\u064a\u062d \u0639\u0627\u0645/\u062e\u0627\u0635.
SEC_ERROR_INVALID_PASSWORD=\u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631 \u0627\u0644\u0645\u064f\u062f\u062e\u0644\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.  \u0631\u062c\u0627\u0621\u064b \u0627\u062e\u062a\u0631 \u0648\u0627\u062d\u062f\u0629 \u0623\u062e\u0631\u0649.
SEC_ERROR_RETRY_OLD_PASSWORD=\u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631 \u0627\u0644\u0642\u062f\u064a\u0645\u0629 \u0623\u064f\u062f\u062e\u0644\u062a \u0628\u0634\u0643\u0644 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d.  \u0631\u062c\u0627\u0621\u064b \u062d\u0627\u0648\u0644 \u062b\u0627\u0646\u064a\u0629.
SEC_ERROR_BAD_NICKNAME=\u0627\u0633\u0645 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u0633\u062a\u0639\u0627\u0631 \u0645\u0633\u062a\u062e\u062f\u0645 \u0645\u0633\u0628\u0642\u064b\u0627.
SEC_ERROR_NOT_FORTEZZA_ISSUER=\u0633\u0644\u0633\u0644\u0629 \u0646\u062f \u0641\u0648\u0631\u062a\u064a\u0632\u0627 \u0644\u062f\u064a\u0647\u0627 \u0634\u0647\u0627\u062f\u0629 \u0644\u064a\u0633\u062a \u0645\u0646 \u0646\u0648\u0639 \u0641\u0648\u0631\u062a\u064a\u0632\u0627.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=\u0627\u0644\u0645\u0641\u062a\u0627\u062d \u0627\u0644\u062d\u0633\u0627\u0633 \u0644\u0627 \u064a\u0645\u0643\u0646 \u0646\u0642\u0644\u0647 \u063a\u0644\u0649 \u0627\u0644\u0641\u062a\u062d\u0629 \u0627\u0644\u062a\u064a \u064a\u064f\u062d\u062a\u0627\u062c \u0625\u0644\u064a\u0647 \u0641\u064a\u0647\u0627.
SEC_ERROR_JS_INVALID_MODULE_NAME=\u0627\u0633\u0645 \u0648\u062d\u062f\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_JS_INVALID_DLL=\u0627\u0633\u0645 \u0645\u0644\u0641/\u0645\u0633\u0627\u0631 \u0627\u0644\u0648\u062d\u062f\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d
SEC_ERROR_JS_ADD_MOD_FAILURE=\u062a\u0639\u0630\u0651\u0631 \u0625\u0636\u0627\u0641\u0629 \u0627\u0644\u0648\u062d\u062f\u0629
SEC_ERROR_JS_DEL_MOD_FAILURE=\u062a\u0639\u0630\u0651\u0631 \u062d\u0630\u0641 \u0627\u0644\u0648\u062d\u062f\u0629
SEC_ERROR_OLD_KRL=KRL \u0627\u0644\u062c\u062f\u064a\u062f \u0644\u064a\u0633 \u0623\u062d\u062f\u062b \u0645\u0646 \u0627\u0644\u062d\u0627\u0644\u064a.
SEC_ERROR_CKL_CONFLICT=CKL \u0627\u0644\u062c\u062f\u064a\u062f \u0644\u062f\u064a\u0647 \u0645\u0632\u0648\u0651\u062f \u0645\u062e\u062a\u0644\u0641 \u0639\u0646 CKL \u0627\u0644\u062d\u0627\u0644\u064a.  \u0627\u062d\u0630\u0641 CKL \u0627\u0644\u062d\u0627\u0644\u064a.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=\u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u062e\u0627\u0635\u0629 \u0628\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u063a\u064a\u0631 \u0645\u0633\u0645\u0648\u062d \u0644\u0647\u0627 \u0623\u0646 \u062a\u0639\u0637\u064a \u0634\u0647\u0627\u062f\u0629 \u0628\u0647\u0630\u0627 \u0627\u0644\u0627\u0633\u0645.
SEC_ERROR_KRL_NOT_YET_VALID=\u0642\u0627\u0626\u0645\u0629 \u0641\u0633\u062e \u0627\u0644\u0645\u0641\u0627\u062a\u064a\u062d \u0644\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0644\u064a\u0633\u062a \u0635\u0627\u0644\u062d\u0629 \u062d\u062a\u0649 \u0627\u0644\u0622\u0646.
SEC_ERROR_CRL_NOT_YET_VALID=\u0642\u0627\u0626\u0645\u0629 \u0641\u0633\u062e \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a \u0644\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0644\u064a\u0633\u062a \u0635\u0627\u0644\u062d\u0629 \u062d\u062a\u0649 \u0627\u0644\u0622\u0646.
SEC_ERROR_UNKNOWN_CERT=\u0644\u0645 \u064a\u0645\u0643\u0646 \u0627\u0644\u0639\u062b\u0648\u0631 \u0639\u0644\u0649 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629.
SEC_ERROR_UNKNOWN_SIGNER=\u0644\u0645 \u064a\u0645\u0643\u0646 \u0627\u0644\u0639\u062b\u0648\u0631 \u0639\u0644\u0649 \u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u0645\u0648\u0642\u0651\u0639.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=\u0645\u0648\u0642\u0639 \u062e\u0627\u062f\u0648\u0645 \u062d\u0627\u0644\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0641\u064a \u0647\u064a\u0626\u0629 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=\u0644\u0627 \u064a\u0645\u0643\u0646 \u0641\u0643 \u062a\u0631\u0645\u064a\u0632 \u0625\u062c\u0627\u0628\u0629 OCSP \u0628\u0634\u0643\u0644 \u0643\u0627\u0645\u0644\u061b \u0625\u0646\u0647\u0627 \u0645\u0646 \u0646\u0648\u0639 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=\u0623\u0631\u062c\u0639 \u062e\u0627\u062f\u0648\u0645 OCSP \u0628\u064a\u0627\u0646\u0627\u062a HTTP \u063a\u064a\u0631 \u0645\u062a\u0648\u0642\u0639\u0629/\u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629.
SEC_ERROR_OCSP_MALFORMED_REQUEST=\u0648\u062c\u062f \u062e\u0627\u062f\u0648\u0645 OCSP \u0623\u0646 \u0627\u0644\u0637\u0644\u0628 \u062a\u0627\u0644\u0641 \u0623\u0648 \u0645\u0635\u0646\u0648\u0639 \u0628\u0634\u0643\u0644 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d.
SEC_ERROR_OCSP_SERVER_ERROR=\u0648\u0627\u062c\u0647 \u062e\u0627\u062f\u0648\u0645 OCSP \u062e\u0637\u0623 \u062f\u0627\u062e\u0644\u064a\u064b\u0627.
SEC_ERROR_OCSP_TRY_SERVER_LATER=\u064a\u0642\u062a\u0631\u062d \u062e\u0627\u062f\u0648\u0645 OCSP \u0627\u0644\u0645\u062d\u0627\u0648\u0644\u0629 \u0645\u062c\u062f\u064b\u0627 \u0641\u064a \u0648\u0642\u062a \u0644\u0627\u062d\u0642.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=\u064a\u062d\u062a\u0627\u062c \u062e\u0627\u062f\u0648\u0645 OCSP \u062a\u0648\u0642\u064a\u0639\u064b\u0627 \u0639\u0644\u0649 \u0647\u0630\u0627 \u0627\u0644\u0637\u0644\u0628.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=\u0631\u0641\u0636 \u062e\u0627\u062f\u0648\u0645 OCSP \u0647\u0630\u0627 \u0627\u0644\u0637\u0644\u0628 \u0648\u0627\u0639\u062a\u0628\u0631\u0647 \u063a\u064a\u0631 \u0645\u0635\u0627\u062f\u0642 \u0639\u0644\u064a\u0647.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=\u0623\u0631\u062c\u0639 \u062e\u0627\u062f\u0648\u0645 OCSP \u062d\u0627\u0644\u0629 \u063a\u064a\u0631 \u0645\u062a\u0639\u0631\u0651\u0641 \u0639\u0644\u064a\u0647\u0627.
SEC_ERROR_OCSP_UNKNOWN_CERT=\u0644\u0627 \u064a\u0645\u0644\u0643 \u062e\u0627\u062f\u0648\u0645 OCSP \u062d\u0627\u0644\u0629 \u0644\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_OCSP_NOT_ENABLED=\u0639\u0644\u064a\u0643 \u0623\u0646 \u062a\u0641\u0639\u0651\u0644 OCSP \u0642\u0628\u0644 \u0623\u062f\u0627\u0621 \u0647\u0630\u0647 \u0627\u0644\u0639\u0645\u0644\u064a\u0629.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=\u0639\u0644\u064a\u0643 \u0623\u0646 \u062a\u0639\u062f\u0651 \u0645\u062c\u064a\u0628 OCSP \u0627\u0644\u0627\u0641\u062a\u0631\u0627\u0636\u064a \u0642\u0628\u0644 \u0625\u062c\u0631\u0627\u0621 \u0647\u0630\u0647 \u0627\u0644\u0639\u0645\u0644\u064a\u0629.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=\u0627\u0644\u0625\u062c\u0627\u0628\u0629 \u0645\u0646 \u062e\u0627\u062f\u0648\u0645 OCSP \u062a\u0627\u0644\u0641\u0629 \u0623\u0648 \u0645\u0635\u0646\u0648\u0639\u0629 \u0628\u0634\u0643\u0644 \u063a\u064a\u0631 \u0635\u062d\u064a\u062d.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=\u0645\u0648\u0642\u0651\u0639 \u0625\u062c\u0627\u0628\u0629 OCSP \u063a\u064a\u0631 \u0645\u0635\u0631\u0651\u062d \u0644\u0647 \u0644\u0625\u0639\u0637\u0627\u0621 \u0627\u0644\u062d\u0627\u0644\u0629 \u0644\u0647\u0630\u0647 \u0627\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_OCSP_FUTURE_RESPONSE=\u0625\u062c\u0627\u0628\u0629 OCSP \u0644\u064a\u0633\u062a \u0635\u0627\u0644\u062d\u0629 \u062d\u062a\u0649 \u0627\u0644\u0622\u0646 (\u062a\u062d\u062a\u0648\u064a \u062a\u0627\u0631\u064a\u062e\u064b\u0627 \u0641\u064a \u0627\u0644\u0645\u0633\u062a\u0642\u0628\u0644).
SEC_ERROR_OCSP_OLD_RESPONSE=\u0625\u062c\u0627\u0628\u0629 OCSP \u062a\u062d\u062a\u0648\u064a \u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0645\u0646\u062a\u0647\u064a\u0629 \u0627\u0644\u062a\u0627\u0631\u064a\u062e.
SEC_ERROR_DIGEST_NOT_FOUND=\u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0639\u0644\u0649 \u0627\u0644\u200d CMS \u0623\u0648 \u0628\u0639\u062b\u0631\u0629 PKCS \#7 \u0641\u064a \u0627\u0644\u0631\u0633\u0627\u0644\u0629 \u0627\u0644\u0645\u0648\u0642\u0639\u0629.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=\u0646\u0648\u0639 \u0627\u0644\u200d CMS \u0623\u0648 \u0628\u0639\u062b\u0631\u0629 PKCS \#7 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645.
SEC_ERROR_MODULE_STUCK=\u0644\u0645 \u064a\u0645\u0643\u0646 \u0625\u0632\u0627\u0644\u0629 \u0648\u062d\u062f\u0629 PKCS \#11 \u0644\u0623\u0646\u0647\u0627 \u0644\u0627 \u062a\u0632\u0627\u0644 \u0642\u064a\u062f \u0627\u0644\u0627\u0633\u062a\u062e\u062f\u0627\u0645.
SEC_ERROR_BAD_TEMPLATE=\u0644\u0645 \u064a\u0645\u0643\u0646 \u0641\u0643 \u062a\u0631\u0645\u064a\u0632 \u0628\u064a\u0627\u0646\u0627\u062a ASN.1. \u0627\u0644\u0642\u0627\u0644\u0628 \u0627\u0644\u0645\u062d\u062f\u062f \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_CRL_NOT_FOUND=\u0644\u0645 \u064a\u064f\u0639\u062b\u0631 \u0639\u0644\u0649 \u0623\u064a CRL \u0645\u0637\u0627\u0628\u0642.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=\u0623\u0646\u062a \u062a\u062d\u0627\u0648\u0644 \u0627\u0633\u062a\u064a\u0631\u0627\u062f \u0634\u0647\u0627\u062f\u0629 \u0644\u0647\u0627 \u0646\u0641\u0633 \u0627\u0644\u0645\u0632\u0648\u062f/\u0627\u0644\u062a\u0633\u0644\u0633\u0644 \u0627\u0644\u062e\u0627\u0635 \u0628\u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0627\u0644\u062d\u0627\u0644\u064a\u0629\u060c \u0648\u0644\u0643\u0646\u0647\u0627 \u0644\u064a\u0633\u062a \u0646\u0641\u0633 \u0627\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_BUSY=NSS \u0644\u0645 \u064a\u0645\u0643\u0646\u0647 \u0623\u0646 \u064a\u0646\u0637\u0641\u0626. \u0627\u0644\u0643\u0627\u0626\u0646\u0627\u062a \u0644\u0627 \u062a\u0632\u0627\u0644 \u0642\u064a\u062f \u0627\u0644\u0627\u0633\u062a\u062e\u062f\u0627\u0645.
SEC_ERROR_EXTRA_INPUT=\u0627\u0644\u0631\u0633\u0627\u0644\u0629 \u0627\u0644\u0645\u0631\u0645\u0632\u0629 \u0648\u0641\u0642 DER \u062a\u062d\u062a\u0648\u064a \u0628\u064a\u0627\u0646\u0627\u062a \u0625\u0636\u0627\u0641\u064a\u0629 \u063a\u064a\u0631 \u0645\u0633\u062a\u062e\u062f\u0645\u0629.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=\u0645\u0646\u062d\u0646\u0649 \u0625\u0647\u0644\u064a\u0644\u062c\u064a \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=\u0634\u0643\u0644 \u062a\u0646\u0642\u064a\u0637 \u0645\u0646\u062d\u0646\u0649 \u0625\u0647\u0644\u064a\u0644\u062c\u064a \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645.
SEC_ERROR_UNRECOGNIZED_OID=\u0645\u0639\u0631\u0651\u0641 \u0643\u0627\u0626\u0646 \u063a\u064a\u0631 \u0645\u062a\u0639\u0631\u0651\u0641 \u0639\u0644\u064a\u0647.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=\u0634\u0647\u0627\u062f\u0629 \u062a\u0648\u0642\u064a\u0639 OCSP \u063a\u064a\u0631 \u0635\u0627\u0644\u062d\u0629 \u0641\u064a \u0625\u062c\u0627\u0628\u0629 OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=\u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0645\u0641\u0633\u0648\u062e\u0629 \u0641\u064a \u0642\u0627\u0626\u0645\u0629 \u0641\u0633\u062e \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a \u0644\u0644\u0645\u0632\u0648\u0651\u062f.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=\u0645\u062c\u064a\u0628 OCSP \u0644\u0644\u0644\u0645\u0632\u0648\u0651\u062f \u064a\u062e\u0628\u0631 \u0623\u0646 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0645\u0641\u0633\u0648\u062e\u0629.
SEC_ERROR_CRL_INVALID_VERSION=\u0642\u0627\u0626\u0645\u0629 \u0641\u0633\u062e \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a \u0644\u0644\u0645\u0632\u0648\u0651\u062f \u0644\u0647\u0627 \u0631\u0642\u0645 \u0646\u0633\u062e\u0629 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=\u0642\u0627\u0626\u0645\u0629 \u0641\u0633\u062e \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a V1 \u0644\u0644\u0645\u0632\u0648\u0651\u062f \u0644\u062f\u064a\u0647\u0627 \u0627\u0645\u062a\u062f\u0627\u062f \u062d\u0631\u062c.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=\u0642\u0627\u0626\u0645\u0629 \u0641\u0633\u062e \u0627\u0644\u0634\u0647\u0627\u062f\u0627\u062a V2 \u0644\u0644\u0645\u0632\u0648\u0651\u062f \u0644\u062f\u064a\u0647\u0627 \u0627\u0645\u062a\u062f\u0627\u062f \u062d\u0631\u062c \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=\u0646\u0648\u0639 \u0627\u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0645\u062d\u062f\u062f \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SEC_ERROR_INCOMPATIBLE_PKCS11=\u0633\u0627\u0626\u0642 PKCS \#11 \u0627\u0646\u062a\u0647\u0643 \u0627\u0644\u062a\u062e\u0635\u064a\u0635 \u0628\u0637\u0631\u064a\u0642\u0629 \u063a\u064a\u0631 \u0645\u0644\u0627\u0626\u0645\u0629.
SEC_ERROR_NO_EVENT=\u0644\u0627 \u062d\u062f\u062b \u0641\u062a\u062d\u0629 \u062c\u062f\u064a\u062f \u0645\u062a\u0627\u062d \u0641\u064a \u0627\u0644\u0648\u0642\u062a \u0627\u0644\u062d\u0627\u0644\u064a.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL \u0645\u0648\u062c\u0648\u062f \u0645\u0633\u0628\u0642\u064b\u0627.
SEC_ERROR_NOT_INITIALIZED=\u0644\u0645 \u064a\u064f\u0633\u062a\u0628\u062f\u0623 NSS.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=\u0641\u0634\u0644\u062a \u0627\u0644\u0639\u0645\u0644\u064a\u0629 \u0644\u0623\u0646 \u0642\u0637\u0639\u0629 PKCS\#11 \u0627\u0644\u0623\u0645\u0646\u064a\u0629 \u0644\u0645 \u062a\u064f\u062f\u062e\u0644.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=\u0634\u0647\u0627\u062f\u0629 \u0645\u062c\u064a\u0628 OCSP \u0627\u0644\u0645\u0639\u062f\u0651\u0629 \u063a\u064a\u0631 \u0633\u0644\u064a\u0645\u0629.
SEC_ERROR_OCSP_BAD_SIGNATURE=\u0627\u0633\u062a\u062c\u0627\u0628\u0629 OCSP \u0644\u0647\u0627 \u062a\u0648\u0642\u064a\u0639 \u063a\u064a\u0631 \u0635\u0627\u0644\u062d.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=\u0627\u0644\u0628\u062d\u062b \u0639\u0646 \u0635\u0644\u0627\u062d\u064a\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0647\u0648 \u062e\u0627\u0631\u062c \u062d\u062f\u0648\u062f \u0627\u0644\u0628\u062d\u062b
SEC_ERROR_INVALID_POLICY_MAPPING=\u062a\u062e\u0637\u064a\u0637 \u0627\u0644\u0633\u064a\u0627\u0633\u0629 \u064a\u062d\u062a\u0648\u064a \u0623\u064a \u0633\u064a\u0627\u0633\u0629
SEC_ERROR_POLICY_VALIDATION_FAILED=\u0641\u0634\u0644\u062a \u0633\u0644\u0633\u0629 \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0641\u064a \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0633\u064a\u0627\u0633\u0629
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=\u0646\u0648\u0639 \u0627\u0644\u0645\u0643\u0627\u0646 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641 \u0641\u064a \u0627\u0645\u062a\u062f\u0627\u062f \u0634\u0647\u0627\u062f\u0629 AIA
SEC_ERROR_BAD_HTTP_RESPONSE=\u0631\u062f \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0628\u0627\u0633\u062a\u062c\u0627\u0628\u0629 HTTP \u0633\u064a\u0626\u0629
SEC_ERROR_BAD_LDAP_RESPONSE=\u0631\u062f \u0627\u0644\u062e\u0627\u062f\u0648\u0645 \u0628\u0627\u0633\u062a\u062c\u0627\u0628\u0629 LDAP \u0633\u064a\u0626\u0629
SEC_ERROR_FAILED_TO_ENCODE_DATA=\u0641\u0634\u0644 \u062a\u0631\u0645\u064a\u0632 \u0627\u0644\u0628\u064a\u0627\u0646\u0627\u062a \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u0645\u0631\u0645\u0651\u0632 ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=\u0645\u0643\u0627\u0646 \u0648\u0635\u0648\u0644 \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062a \u0633\u064a\u0626 \u0641\u064a \u0627\u0645\u062a\u062f\u0627\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629
SEC_ERROR_LIBPKIX_INTERNAL=\u062d\u062f\u062b \u062e\u0637\u0623 Libpkix \u062f\u0627\u062e\u0644\u064a \u0623\u062b\u0646\u0627\u0621 \u0627\u0644\u062a\u062d\u0642\u0642 \u0645\u0646 \u0627\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_PKCS11_GENERAL_ERROR=\u0631\u062f\u0651\u062a \u0648\u062d\u062f\u0629 PKCS \#11 \u0628\u062e\u0637\u0623 CKR_GENERAL_ERROR\u060c \u0645\u0634\u064a\u0631\u0629 \u0625\u0644\u0649 \u0623\u0646 \u062e\u0637\u0623 \u0644\u0627 \u064a\u0645\u0643\u0646 \u0639\u0643\u0633 \u0623\u062b\u0631\u0647 \u0642\u062f \u0648\u0642\u0639.
SEC_ERROR_PKCS11_FUNCTION_FAILED=\u0631\u062f\u0651\u062a \u0648\u062d\u062f\u0629 PKCS \#11 \u0628\u062e\u0637\u0623 CKR_FUNCTION_FAILED\u060c \u0645\u0634\u064a\u0631\u0629 \u0625\u0644\u0649 \u0623\u0646 \u0627\u0644\u062f\u0627\u0644\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629 \u0642\u062f \u062a\u0639\u0630\u0631 \u062a\u0634\u063a\u064a\u0644\u0647\u0627.  \u0645\u062d\u0627\u0648\u0644\u0629 \u0625\u062c\u0631\u0627\u0621 \u0627\u0644\u0639\u0645\u0644\u064a\u0629 \u0645\u062c\u062f\u062f\u064b\u0627 \u0642\u062f \u062a\u062a\u0643\u0644\u0644 \u0628\u0627\u0644\u0646\u062c\u0627\u062d.
SEC_ERROR_PKCS11_DEVICE_ERROR=\u0631\u062f\u0651\u062a \u0648\u062d\u062f\u0629 PKCS \#11 \u0628\u062e\u0637\u0623 CKR_DEVICE_ERROR\u060c \u0645\u0634\u064a\u0631\u0629 \u0625\u0644\u0649 \u0645\u0634\u0643\u0644\u0629 \u062d\u0635\u0644\u062a \u0641\u064a \u0627\u0644\u200d token \u0623\u0648 \u0627\u0644\u200d slot.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=\u0637\u0631\u064a\u0642\u0629 \u0648\u0635\u0648\u0644 \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062a \u063a\u064a\u0631 \u0645\u0639\u0644\u0648\u0645\u0629 \u0641\u064a \u0627\u0645\u062a\u062f\u0627\u062f \u0627\u0644\u0634\u0647\u0627\u062f\u0629.
SEC_ERROR_CRL_IMPORT_FAILED=\u062e\u0637\u0623 \u0639\u0646\u062f \u0645\u062d\u0627\u0648\u0644\u0629 \u0627\u0633\u062a\u064a\u0631\u0627\u062f CRL.
SEC_ERROR_EXPIRED_PASSWORD=\u0627\u0646\u062a\u0647\u062a \u0635\u0644\u0627\u062d\u064a\u0629 \u0643\u0644\u0645\u0629 \u0627\u0644\u0633\u0631.
SEC_ERROR_LOCKED_PASSWORD=\u0643\u0644\u0645\u0629 \u0627\u0644\u0635\u0631 \u0645\u0642\u0641\u0644\u0629.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=\u0639\u064f\u0637\u0644 PKCS \#11 \u063a\u064a\u0631 \u0645\u0639\u0631\u0648\u0641.
SEC_ERROR_BAD_CRL_DP_URL=\u0645\u0633\u0627\u0631 \u063a\u064a\u0631 \u0633\u0644\u064a\u0645 \u0623\u0648 \u063a\u064a\u0631 \u0645\u062f\u0639\u0648\u0645 \u0641\u064a \u0627\u0633\u0645 \u0646\u0642\u0637\u0629 \u062a\u0648\u0632\u064a\u0639 CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=\u0648\u064f\u0642\u0651\u064e\u0639\u062a \u0627\u0644\u0634\u0647\u0627\u062f\u0629 \u0628\u0627\u0633\u062a\u062e\u062f\u0627\u0645 \u062e\u0648\u0627\u0631\u0632\u0645\u064a\u0629 \u0639\u064f\u0637\u0651\u0644\u062a \u0644\u0639\u062f\u0645 \u0623\u0645\u0627\u0646\u0647\u0627.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

