#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=Attenzione\: lo script non risponde
KillScriptMessage=Uno script in questa pagina potrebbe essere occupato o aver smesso di rispondere. \u00c8 possibile fermare lo script adesso o attendere per vedere se lo script conclude la sua esecuzione.
KillScriptWithDebugMessage=Uno script in questa pagina \u00e8 occupato o non risponde. \u00c8 possibile fermarlo adesso, aprirlo nel debugger o lasciarlo continuare.
KillScriptLocation=Script\: %S
StopScriptButton=Ferma lo script
DebugScriptButton=Debug dello script
WaitForScriptButton=Continua
DontAskAgain=&Non ripetere la domanda in futuro
JSURLLoadBlockedWarning=Il tentativo di caricare un URL JavaScript\: da parte di un sito\nin una finestra che visualizza contenuti provenienti da un altro sito,\n\u00e8 stato bloccato dalla gestione sicurezza.
WindowCloseBlockedWarning=Gli script non possono chiudere finestre non aperte da script.
OnBeforeUnloadTitle=Abbandonare la pagina?
OnBeforeUnloadMessage=Questa pagina richiede una conferma prima di poter uscire. I dati inseriti potrebbero non essere stati salvati.
OnBeforeUnloadStayButton=Rimani in questa pagina
OnBeforeUnloadLeaveButton=Abbandona questa pagina
UnexpectedCanvasVariantStyle=canvas\: il tentativo di impostare strokeStyle o fillStyle a un valore che non \u00e8 una stringa, un CanvasGradient o un CanvasPattern \u00e8 stato ignorato.
EmptyGetElementByIdParam=\u00c8 stata trasmessa una stringa vuota a getElementById().
LowMemoryTitle=Attenzione\: memoria insufficiente
LowMemoryMessage=Uno script in questa pagina \u00e8 stato bloccato. Il blocco \u00e8 dovuto a una condizione di memoria insufficiente.
SpeculationFailed=La scrittura di un albero non bilanciato tramite document.write() ha richiesto un ulteriore parsing dei dati dalla rete. Per maggiori informazioni consultare https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing
DocumentWriteIgnored=\u00c8 stata ignorata una chiamata a document.write() eseguita da uno script esterno caricato in modalit\u00e0 asincrona.
FormValidationTextTooLong=Ridurre la lunghezza del testo a %S caratteri o meno (attualmente si stanno utilizzando %S caratteri)
FormValidationValueMissing=Compilare questo campo
FormValidationCheckboxMissing=Selezionare questa casella per procedere
FormValidationRadioMissing=Selezionare una delle opzioni disponibili
FormValidationFileMissing=Selezionare un file
FormValidationSelectMissing=Selezionare un elemento dall'elenco
FormValidationInvalidEmail=Inserire un indirizzo email
FormValidationInvalidURL=Inserire un URL
FormValidationPatternMismatch=Inserire un valore nel formato richiesto
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=Inserire un valore nel formato richiesto\: %S
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=Selezionare un valore valido. I due valori validi pi\u00f9 vicini sono %S e %S
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=Selezionare un valore valido. Il valore valido pi\u00f9 vicino \u00e8 %S
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=L'utilizzo di getAttributeNode() \u00e8 deprecato. Al suo posto utilizzare getAttribute().
SetAttributeNodeWarning=L'utilizzo di setAttributeNode() \u00e8 deprecato. Al suo posto utilizzare setAttribute().
GetAttributeNodeNSWarning=L'utilizzo di getAttributeNodeNS() \u00e8 deprecato. Al suo posto utilizzare getAttributeNS().
SetAttributeNodeNSWarning=L'utilizzo di setAttributeNodeNS() \u00e8 deprecato. Al suo posto utilizzare setAttributeNS().
RemoveAttributeNodeWarning=L'utilizzo di removeAttributeNode() \u00e8 deprecato. Al suo posto utilizzare removeAttribute().
CreateAttributeWarning=L'utilizzo di document.createAttribute() \u00e8 deprecato. Al suo posto utilizzare element.setAttribute().
CreateAttributeNSWarning=L'utilizzo di document.createAttributeNS() \u00e8 deprecato. Al suo posto utilizzare element.setAttributeNS().
OwnerElementWarning=L'utilizzo di ownerElement su attributi \u00e8 deprecato.
NodeValueWarning=L'utilizzo di nodeValue su attributi \u00e8 deprecato. Al suo posto utilizzare value.
TextContentWarning=L'utilizzo di textContent su attributi \u00e8 deprecato. Al suo posto utilizzare value.
EnablePrivilegeWarning=L'utilizzo di enablePrivilege \u00e8 deprecato. Al suo posto utilizzare codice che venga eseguito con i privilegi del sistema (ad es. un'estensione).
nsIJSONDecodeDeprecatedWarning=L'utilizzo di nsIJSON.decode \u00e8 deprecato. Al suo posto utilizzare JSON.parse.
nsIJSONEncodeDeprecatedWarning=L'utilizzo di nsIJSON.encode \u00e8 deprecato. Al suo posto utilizzare JSON.stringify.
nsIDOMWindowInternalWarning=L'utilizzo di nsIDOMWindowInternal \u00e8 deprecato. Al suo posto utilizzare nsIDOMWindow.
InputEncodingWarning=L'utilizzo di inputEncoding \u00e8 deprecato.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=Gli eventi MozBeforePaint non sono pi\u00f9 supportati. \u00c8 necessario trasmettere a mozRequestAnimationFrame un argomento callback non null.
FullScreenDeniedBlocked=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto l'utente ha bloccato questa funzione per questo dominio.
FullScreenDeniedDisabled=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto le relative API sono state disattivate nelle preferenze dell'utente.
FullScreenDeniedFocusedPlugin=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto \u00e8 attivo un plugin con finestra nativa (windowed).
FullScreenDeniedHidden=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto il documento non \u00e8 pi\u00f9 visibile.
FullScreenDeniedIframeNotAllowed=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto almeno uno degli iframe che contiene il documento non presenta l'attributo 'allowfullscreen'.
FullScreenDeniedNotInputDriven=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto Element.mozRequestFullScreen() non \u00e8 stato chiamato da un gestore eventi rapido generato dall'utente.
FullScreenDeniedNotInDocument=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto l'elemento che l'ha richiesta non \u00e8 pi\u00f9 presente nel documento.
FullScreenDeniedMovedDocument=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto l'elemento che l'ha richiesta ha spostato il documento.
FullScreenDeniedLostWindow=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto non \u00e8 pi\u00f9 disponibile una finestra.
FullScreenDeniedSubDocFullScreen=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto un sottodocumento del documento che l'ha richiesta \u00e8 gi\u00e0 in modalit\u00e0 schermo intero.
FullScreenDeniedNotDescendant=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto l'elemento che l'ha richiesta non \u00e8 un discendente dell'elemento full-screen corrente.
FullScreenDeniedNotFocusedTab=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto l'elemento che l'ha richiesta non si trova nella scheda attualmente selezionata.
FullScreenDeniedContentOnly=Richiesta di passare alla modalit\u00e0 schermo intero rifiutata in quanto l'elemento che l'ha richiesta si trova nel documento chrome e le API fullscreen sono configurate solo per i contenuti.
RemovedFullScreenElement=Abbandonata la modalit\u00e0 schermo intero in quanto l'elemento full-screen \u00e8 stato rimosso dal documento.
FocusedWindowedPluginWhileFullScreen=Abbandonata la modalit\u00e0 schermo intero in quanto \u00e8 stato attivato un plugin con finestra nativa (windowed).
HTMLSyncXHRWarning=L'analisi (parsing) HTML non \u00e8 supportata in XMLHttpRequest in modalit\u00e0 sincrona.
InvalidRedirectChannelWarning=Impossibile reindirizzare a %S in quanto il canale non implementa nsIWritablePropertyBag2.
ResponseTypeSyncXHRWarning=L'utilizzo dell'attributo responseType di XMLHttpRequest non \u00e8 pi\u00f9 supportato in modalit\u00e0 sincrona nel contesto di una finestra.
WithCredentialsSyncXHRWarning=L'utilizzo dell'attributo withCredentials di XMLHttpRequest non \u00e8 pi\u00f9 supportato in modalit\u00e0 sincrona nel contesto di una finestra.
TimeoutSyncXHRWarning=L'utilizzo dell'attributo timeout di XMLHttpRequest non \u00e8 supportato in modalit\u00e0 sincrona nel contesto di una finestra.
JSONCharsetWarning=Si \u00e8 verificato un tentativo di dichiarare una codifica diversa da UTF-8 per JSON acquisito attraverso XMLHttpRequest. Solo UTF-8 \u00e8 supportato per la decodifica JSON.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=Memoria insufficiente per ricampionare AudioBufferSourceNode per la riproduzione.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=Il buffer trasmesso a decodeAudioData contiene contenuti di tipo sconosciuto.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=Si \u00e8 verificato un errore sconosciuto durante l'elaborazione di decodeAudioData.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=Il buffer trasmesso a decodeAudioData contiene contenuti non validi e impossibili da decodificare.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=Il buffer trasmesso a decodeAudioData non contiene dati audio.
MediaLoadExhaustedCandidates=Caricamento non riuscito per tutte le risorse candidate. Sospeso caricamento risorsa multimediale.
MediaLoadSourceMissingSrc=L'elemento <source> non ha un attributo "src". Impossibile completare il caricamento della risorsa multimediale.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=Il caricamento HTTP non \u00e8 riuscito con stato %1$S. Impossibile completare il caricamento della risorsa multimediale %2$S.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=URI non corretto. Impossibile completare il caricamento della risorsa multimediale %S.
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute=Il valore "%1$S" specificato per l\u2019attributo "type" non \u00e8 supportato. Impossibile completare il caricamento della risorsa multimediale %2$S.
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched=Il valore "%1$S" specificato per l\u2019attributo "media" non corrisponde all'ambiente. Impossibile completare il caricamento della risorsa multimediale %2$S.
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType=Il "Content-Type" HTTP "%1$S" non \u00e8 supportato. Impossibile completare il caricamento della risorsa multimediale %2$S.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=Impossibile decodificare la risorsa multimediale %S.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=L'utilizzo dell'attributo code di DOMException \u00e8 deprecato. Al suo posto utilizzare l'attributo name.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=L'esposizione di oggetti chrome JS nel contenuto senza __exposedProps__ non \u00e8 sicura ed \u00e8 deprecata. Per ulteriori informazioni consultare https\://developer.mozilla.org/en/XPConnect_wrappers.
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=L'utilizzo di Mutation Events \u00e8 deprecato. Al suo posto utilizzare MutationObserver.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=L'oggetto Components \u00e8 deprecato e verr\u00e0 presto rimosso.
PluginHangUITitle=Attenzione\: il plugin non risponde
PluginHangUIMessage=Il plugin %S risulta impegnato oppure potrebbe essersi bloccato. \u00c8 possibile interrompere il plugin adesso, oppure attendere per verificare se l'operazione verr\u00e0 completata.
PluginHangUIWaitButton=Continua
PluginHangUIStopButton=Blocca plugin
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning='mozHidden' e 'mozVisibilityState' sono deprecati. Al loro posto utilizzare le versioni senza prefisso  'hidden' e 'visibilityState'.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=La chiamata di detach() su un NodeIterator non ha pi\u00f9 alcun effetto.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=L'assegnazione o la lettura di una propriet\u00e0 con [LenientThis] \u00e8 stata ignorata in quanto l'oggetto 'this' non \u00e8 corretto.
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=L'utilizzo di nsIDOMWindowUtils.getOuterWindowWithId() \u00e8 deprecato. Al suo posto utilizzare il metodo con lo stesso nome disponibile in nsIWindowMediator.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=L'utilizzo di getPreventDefault() \u00e8 deprecato.  Al suo posto utilizzare defaultPrevented.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=L'utilizzo di getUserData() o setUserData() \u00e8 deprecato.  Al loro posto utilizzare WeakMap o element.dataset.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=L'utilizzo di Document.load() \u00e8 deprecato\: aggiornare il proprio codice utilizzando l'oggetto DOM XMLHttpRequest. Per ulteriori informazioni https\://developer.mozilla.org/en/XMLHttpRequest
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

