#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i an to\u00e0n. M\u00e1y ngang h\u00e0ng kh\u00f4ng h\u1ed7 tr\u1ee3 m\u00e3 ho\u00e1 d\u1eef li\u1ec7u c\u1ea5p cao.
SSL_ERROR_US_ONLY_SERVER=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i an to\u00e0n. M\u00e1y ngang h\u00e0ng \u0111\u00f2i h\u1ecfi m\u00e3 ho\u00e1 d\u1eef li\u1ec7u c\u1ea5p cao, m\u00e0 \u0111i\u1ec1u n\u00e0y l\u1ea1i kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SSL_ERROR_NO_CYPHER_OVERLAP=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i an to\u00e0n v\u1edbi m\u00e1y ngang h\u00e0ng\: kh\u00f4ng d\u00f9ng chung thu\u1eadt to\u00e1n m\u00e3 ho\u00e1 d\u1eef li\u1ec7u.
SSL_ERROR_NO_CERTIFICATE=Kh\u00f4ng t\u00ecm th\u1ea5y ch\u1ee9ng th\u01b0 ho\u1eb7c kh\u00f3a c\u1ea7n thi\u1ebft \u0111\u1ec3 x\u00e1c th\u1ef1c.
SSL_ERROR_BAD_CERTIFICATE=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i an to\u00e0n v\u1edbi m\u00e1y ngang h\u00e0ng\: ch\u1ee9ng th\u01b0 c\u1ee7a m\u00e1y ngang h\u00e0ng b\u1ecb t\u1eeb ch\u1ed1i.
SSL_ERROR_UNUSED_5=Kh\u00f4ng nh\u1eadn di\u1ec7n \u0111\u01b0\u1ee3c m\u00e3 l\u1ed7i SSL.
SSL_ERROR_BAD_CLIENT=M\u00e1y ch\u1ee7 g\u1eb7p d\u1eef li\u1ec7u x\u1ea5u t\u1eeb m\u00e1y kh\u00e1ch.
SSL_ERROR_BAD_SERVER=M\u00e1y kh\u00e1ch g\u1eb7p d\u1eef li\u1ec7u x\u1ea5u t\u1eeb m\u00e1y ch\u1ee7.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Ki\u1ec3u ch\u1ee9ng th\u01b0 kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SSL_ERROR_UNSUPPORTED_VERSION=M\u00e1y kh\u00e1ch s\u1eed d\u1ee5ng giao th\u1ee9c b\u1ea3o m\u1eadt kh\u00f4ng h\u1ed7 tr\u1ee3.
SSL_ERROR_UNUSED_10=Kh\u00f4ng nh\u1eadn di\u1ec7n \u0111\u01b0\u1ee3c m\u00e3 l\u1ed7i SSL.
SSL_ERROR_WRONG_CERTIFICATE=Ch\u1ee9ng th\u1ef1c m\u00e1y kh\u00e1ch th\u1ea5t b\u1ea1i\: kh\u00f3a c\u00e1 nh\u00e2n kh\u00f4ng ph\u00f9 h\u1ee3p v\u1edbi kh\u00f3a chung trong c\u01a1 s\u1edf d\u1eef li\u1ec7u ch\u1ee9ng th\u01b0.
SSL_ERROR_BAD_CERT_DOMAIN=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i an to\u00e0n v\u1edbi m\u00e1y ngang h\u00e0ng\: t\u00ean mi\u1ec1n y\u00eau c\u1ea7u kh\u00f4ng kh\u1edbp v\u1edbi ch\u1ee9ng th\u01b0 c\u1ee7a m\u00e1y ch\u1ee7.
SSL_ERROR_POST_WARNING=Kh\u00f4ng nh\u1eadn di\u1ec7n \u0111\u01b0\u1ee3c m\u00e3 l\u1ed7i SSL.
SSL_ERROR_SSL2_DISABLED=M\u00e1y kh\u00e1ch ch\u1ec9 h\u1ed7 tr\u1ee3 SSL 2 (ch\u01b0a k\u00edch ho\u1ea1t)
SSL_ERROR_BAD_MAC_READ=SSL \u0111\u00e3 nh\u1eadn 1 v\u0103n b\u1ea3n sai M\u00e3 Th\u00f4ng b\u00e1o Ch\u1ee9ng th\u1ef1c.
SSL_ERROR_BAD_MAC_ALERT=SSL m\u00e1y ngang h\u00e0ng b\u00e1o sai M\u00e3 Th\u00f4ng b\u00e1o Ch\u1ee9ng th\u1ef1c.
SSL_ERROR_BAD_CERT_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng th\u1ec3 x\u00e1c minh ch\u1ee9ng th\u01b0 c\u1ee7a b\u1ea1n.
SSL_ERROR_REVOKED_CERT_ALERT=SSL m\u00e1y ngang h\u00e0ng t\u1eeb ch\u1ed1i v\u00ec cho r\u1eb1ng ch\u1ee9ng th\u01b0 c\u1ee7a b\u1ea1n \u0111\u00e3 b\u1ecb thu h\u1ed3i.
SSL_ERROR_EXPIRED_CERT_ALERT=SSL m\u00e1y ngang h\u00e0ng t\u1eeb ch\u1ed1i v\u00ec cho r\u1eb1ng ch\u1ee9ng th\u01b0 c\u1ee7a b\u1ea1n \u0111\u00e3 b\u1ecb h\u1ebft h\u1ea1n.
SSL_ERROR_SSL_DISABLED=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i\: SSL b\u1ecb v\u00f4 hi\u1ec7u ho\u00e1.
SSL_ERROR_FORTEZZA_PQG=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i\: SSL m\u00e1y ngang h\u00e0ng \u1edf t\u00ean mi\u1ec1n FORTEZZA kh\u00e1c.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=M\u1ed9t m\u00e3 kh\u00f3a SSL ch\u01b0a bi\u1ebft v\u1eeba \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Kh\u00f4ng c\u00f3 b\u1ed9 m\u00e3 n\u00e0o \u0111\u01b0\u1ee3c k\u00edch ho\u1ea1t trong ch\u01b0\u01a1ng tr\u00ecnh n\u00e0y.
SSL_ERROR_BAD_BLOCK_PADDING=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 c\u00f3 th\u00e0nh ph\u1ea7n x\u1ea5u.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 v\u01b0\u1ee3t qu\u00e1 \u0111\u1ed9 d\u00e0i l\u1edbn nh\u1ea5t cho ph\u00e9p.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL c\u1ed1 g\u1eafng g\u1eedi m\u1ed9t h\u1ed3 s\u01a1 v\u01b0\u1ee3t qu\u00e1 \u0111\u1ed9 d\u00e0i l\u1edbn nh\u1ea5t cho ph\u00e9p.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Hello Request c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Client Hello c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Hello c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay b\u00e1o Ch\u1ee9ng th\u01b0 sai \u0111\u1ecbnh d\u1ea1ng.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Key Exchange c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay b\u00e1o Y\u00eau c\u1ea7u Ch\u1ee9ng th\u01b0 b\u1ecb sai \u0111\u1ecbnh d\u1ea1ng.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Hello Done c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay b\u00e1o X\u00e1c minh Ch\u1ee9ng th\u01b0 b\u1ecb sai \u0111\u1ecbnh d\u1ea1ng.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Client Key Exchange c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Finished c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Change Cipher Spec c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_ALERT=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Alert c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Handhshake c\u00f3 l\u1ed7i.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Application Data c\u00f3 l\u1ed7i.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Hello Request kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Client Hello kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Hello kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay b\u00e1o Ch\u1ee9ng th\u01b0 kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Key Exchange kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Certificate Request kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Hello Done kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Certificate Verify kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Client Key Exchange kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Finished kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Change Cipher kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Alert kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Handshake kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 Application Data kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 kh\u00f4ng bi\u1ebft lo\u1ea1i n\u1ed9i dung.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay kh\u00f4ng bi\u1ebft lo\u1ea1i.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL nh\u1eadn m\u1ed9t h\u1ed3 s\u01a1 c\u1ea3nh b\u00e1o c\u00f3 s\u1ef1 mi\u00eau t\u1ea3 kh\u00f4ng r\u00f5 r\u00e0ng.
SSL_ERROR_CLOSE_NOTIFY_ALERT=SSL m\u00e1y ngang h\u00e0ng ng\u1eaft k\u1ebft n\u1ed1i.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=SSL m\u00e1y ngang h\u00e0ng nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng th\u1ec3 gi\u1ea3i n\u00e9n th\u00e0nh c\u00f4ng m\u1ed9t h\u1ed3 s\u01a1 SLL nh\u1eadn \u0111\u01b0\u1ee3c.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng th\u01b0\u01a1ng l\u01b0\u1ee3ng b\u1ed9 th\u00f4ng s\u1ed1 b\u1ea3o m\u1eadt c\u00f3 th\u1ec3 ch\u1ea5p nh\u1eadn.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=SSL m\u00e1y ngang h\u00e0ng t\u1eeb ch\u1ed1i th\u00f4ng \u0111i\u1ec7p b\u1eaft tay c\u00f3 n\u1ed9i dung kh\u00f4ng ch\u1ea5p nh\u1eadn.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=SSL m\u00e1y kh\u00e1ch kh\u00f4ng h\u1ed7 tr\u1ee3 nh\u1eefng ch\u1ee9ng nh\u1eadn v\u1ec1 ki\u1ec3u nh\u1eadn \u0111\u01b0\u1ee3c.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=SSL m\u00e1y ngang h\u00e0ng c\u00f3 m\u1ed9t s\u1ed1 v\u1ea5n \u0111\u1ec1 kh\u00f4ng x\u00e1c \u0111\u1ecbnh v\u1ec1 ch\u1ee9ng nh\u1eadn nh\u1eadn \u0111\u01b0\u1ee3c.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL g\u1eb7p th\u1ea5t b\u1ea1i trong vi\u1ec7c t\u1ea1o s\u1ed1 ng\u1eabu nhi\u00ean.
SSL_ERROR_SIGN_HASHES_FAILURE=Kh\u00f4ng th\u1ec3 k\u00ed d\u1eef li\u1ec7u c\u1ea7n thi\u1ebft \u0111\u1ec3 x\u00e1c th\u1ef1c ch\u1ee9ng th\u01b0 c\u1ee7a b\u1ea1n.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL kh\u00f4ng th\u1ec3 tr\u00edch ra kh\u00f3a chung t\u1eeb ch\u1ee9ng th\u1ef1c c\u1ee7a m\u00e1y ngang h\u00e0ng.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Th\u1ea5t b\u1ea1i kh\u00f4ng x\u00e1c \u0111\u1ecbnh trong khi x\u1eed l\u00ed b\u1eaft tay SSL Server Key Exchange.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Th\u1ea5t b\u1ea1i kh\u00f4ng x\u00e1c \u0111\u1ecbnh trong khi x\u1eed l\u00ed b\u1eaft tay SSL Client Key Exchange.
SSL_ERROR_ENCRYPTION_FAILURE=Thu\u1eadt to\u00e1n m\u00e3 ho\u00e1 d\u1eef li\u1ec7u l\u1edbn th\u1ea5t b\u1ea1i trong vi\u1ec7c ch\u1ecdn l\u1ef1a b\u1ed9 s\u1ed1.
SSL_ERROR_DECRYPTION_FAILURE=Thu\u1eadt to\u00e1n gi\u1ea3i m\u00e3 d\u1eef li\u1ec7u l\u1edbn th\u1ea5t b\u1ea1i trong vi\u1ec7c ch\u1ecdn l\u1ef1a b\u1ed9 s\u1ed1.
SSL_ERROR_SOCKET_WRITE_FAILURE=C\u1ed1 g\u1eafng ghi d\u1eef li\u1ec7u \u0111\u00e3 m\u00e3 ho\u00e1 v\u00e0o h\u1ed1c d\u01b0\u1edbi b\u1ecb th\u1ea5t b\u1ea1i.
SSL_ERROR_MD5_DIGEST_FAILURE=Ch\u1ee9c n\u0103ng ph\u00e2n lo\u1ea1i MD5 th\u1ea5t b\u1ea1i.
SSL_ERROR_SHA_DIGEST_FAILURE=Ch\u1ee9c n\u0103ng ph\u00e2n lo\u1ea1i SHA-1 th\u1ea5t b\u1ea1i.
SSL_ERROR_MAC_COMPUTATION_FAILURE=T\u00ednh to\u00e1n MAC th\u1ea5t b\u1ea1i.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Th\u1ea5t b\u1ea1i trong vi\u1ec7c t\u1ea1o Symmetric Key.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Th\u1ea5t b\u1ea1i trong vi\u1ec7c m\u1edf kh\u00f3a Symmetric trong th\u00f4ng \u0111i\u1ec7p Client Key Exchange.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=SSL m\u00e1y ch\u1ee7 c\u1ed1 g\u1eafng s\u1eed d\u1ee5ng kh\u00f3a chung n\u1ed9i v\u1edbi b\u1ed9 s\u1ed1 xu\u1ea5t.
SSL_ERROR_IV_PARAM_FAILURE=M\u00e3 PKCS11 th\u1ea5t b\u1ea1i trong vi\u1ec7c d\u1ecbch IV v\u00e0o m\u1ed9t th\u00f4ng s\u1ed1.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Th\u1ea5t b\u1ea1i khi kh\u1edfi t\u1ea1o b\u1ed9 m\u00e3 s\u1ed1 \u0111\u00e3 ch\u1ecdn.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=M\u00e1y kh\u00e1ch th\u1ea5t b\u1ea1i trong vi\u1ec7c t\u1ea1o kh\u00f3a cho SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=M\u00e1y ch\u1ee7 kh\u00f4ng c\u00f3 kh\u00f3a \u0111\u1ec3 th\u1ef1c hi\u1ec7n thu\u1eadt to\u00e1n chuy\u1ec3n \u0111\u1ed5i kho\u00e1.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=D\u1ea5u hi\u1ec7u PKCS\#11 \u0111\u00e3 \u0111\u01b0\u1ee3c ch\u00e8n ho\u1eb7c g\u1ee1 b\u1ecf trong khi \u0111ang th\u1ef1c hi\u1ec7n t\u00e1c v\u1ee5.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Kh\u00f4ng t\u00ecm th\u1ea5y d\u1ea5u hi\u1ec7u PKCS\#11 \u0111\u1ec3 th\u1ef1c hi\u1ec7n t\u00e1c v\u1ee5 y\u00eau c\u1ea7u.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Kh\u00f4ng th\u1ec3 k\u1ebft n\u1ed1i an to\u00e0n v\u1edbi m\u00e1y ngang h\u00e0ng\: kh\u00f4ng d\u00f9ng chung thu\u1eadt to\u00e1n n\u00e9n.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Kh\u00f4ng th\u1ec3 kh\u1edfi \u0111\u1ea7u b\u1eaft tay SSL kh\u00e1c cho \u0111\u1ebfn khi b\u1eaft tay hi\u1ec7n t\u1ea1i ho\u00e0n t\u1ea5t.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=\u0110\u00e3 nh\u1eadn \u0111\u01b0\u1ee3c gi\u00e1 tr\u1ecb b\u1eaft tay sai t\u1eeb m\u00e1y kh\u00e1ch.
SSL_ERROR_CERT_KEA_MISMATCH=Ch\u1ee9ng th\u1ef1c \u0111\u01b0\u1ee3c cung c\u1ea5p kh\u00f4ng th\u1ec3 \u0111\u01b0\u1ee3c s\u1eed d\u1ee5ng v\u1edbi thu\u1eadt to\u00e1n chuy\u1ec3n \u0111\u1ed5i kho\u00e1 l\u1ef1a ch\u1ecdn.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Kh\u00f4ng c\u00f3 h\u00e3ng th\u1ea9m \u0111\u1ecbnh ch\u1ee9ng ch\u1ec9 \u0111\u00e1ng tin t\u01b0\u1edfng \u0111\u1ec3 x\u00e1c th\u1ef1c SSL m\u00e1y kh\u00e1ch.
SSL_ERROR_SESSION_NOT_FOUND=Kh\u00f4ng t\u00ecm th\u1ea5y \u0111\u1ecbnh danh phi\u00ean SSL m\u00e1y kh\u00e1ch trong b\u1ed9 \u0111\u1ec7m phi\u00ean l\u00e0m vi\u1ec7c c\u1ee7a m\u00e1y ch\u1ee7.
SSL_ERROR_DECRYPTION_FAILED_ALERT=M\u00e1y ngang h\u00e0ng kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3 h\u1ed3 s\u01a1 SSL nh\u1eadn \u0111\u01b0\u1ee3c.
SSL_ERROR_RECORD_OVERFLOW_ALERT=M\u00e1y ngang h\u00e0ng nh\u1eadn \u0111\u01b0\u1ee3c 1 h\u1ed3 s\u01a1 SSL d\u00e0i h\u01a1n cho ph\u00e9p.
SSL_ERROR_UNKNOWN_CA_ALERT=M\u00e1y ngang h\u00e0ng kh\u00f4ng t\u00edn nhi\u1ec7m CA cung c\u1ea5p ch\u1ee9ng th\u1ef1c cho b\u1ea1n.
SSL_ERROR_ACCESS_DENIED_ALERT=M\u00e1y ngang h\u00e0ng nh\u1eadn \u0111\u01b0\u1ee3c m\u1ed9t ch\u1ee9ng th\u1ef1c h\u1ee3p l\u1ec7, nh\u01b0ng truy c\u1eadp b\u1ecb t\u1eeb ch\u1ed1i.
SSL_ERROR_DECODE_ERROR_ALERT=M\u00e1y ngang h\u00e0ng kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3 th\u00f4ng \u0111i\u1ec7p b\u1eaft tay SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=M\u00e1y ngang h\u00e0ng b\u00e1o th\u1ea5t b\u1ea1i trong vi\u1ec7c x\u00e1c minh ch\u1eef k\u00ed ho\u1eb7c trao \u0111\u1ed5i kh\u00f3a.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=M\u00e1y ngang h\u00e0ng b\u00e1o vi\u1ec7c th\u01b0\u01a1ng l\u01b0\u1ee3ng kh\u00f4ng \u0111\u00fang v\u1edbi lu\u1eadt xu\u1ea5t.
SSL_ERROR_PROTOCOL_VERSION_ALERT=M\u00e1y ngang h\u00e0ng b\u00e1o kh\u00f4ng t\u01b0\u01a1ng th\u00edch ho\u1eb7c kh\u00f4ng h\u1ed7 tr\u1ee3 phi\u00ean b\u1ea3n giao th\u1ee9c.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=M\u00e1y ch\u1ee7 y\u00eau c\u1ea7u b\u1ed9 s\u1ed1 an to\u00e0n h\u01a1n b\u1ed9 s\u1ed1 h\u1ed7 tr\u1ee3 b\u1edfi m\u00e1y kh\u00e1ch.
SSL_ERROR_INTERNAL_ERROR_ALERT=M\u00e1y ngang h\u00e0ng b\u00e1o l\u1ed7i b\u00ean trong.
SSL_ERROR_USER_CANCELED_ALERT=Ng\u01b0\u1eddi s\u1eed d\u1ee5ng m\u00e1y ngang h\u00e0ng t\u1eeb ch\u1ed1i b\u1eaft tay.
SSL_ERROR_NO_RENEGOTIATION_ALERT=M\u00e1y ngang h\u00e0ng kh\u00f4ng cho ph\u00e9p th\u01b0\u01a1ng l\u01b0\u1ee3ng l\u1ea1i c\u00e1c th\u00f4ng s\u1ed1 b\u1ea3o m\u1eadt SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=B\u1ed9 \u0111\u1ec7m SSL m\u00e1y ch\u1ee7 kh\u00f4ng \u0111\u01b0\u1ee3c c\u00e0i \u0111\u1eb7t cho h\u1ed1c n\u00e0y.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng h\u1ed7 tr\u1ee3 ph\u1ea7n m\u1edf r\u1ed9ng ch\u00e0o h\u1ecfi TLS y\u00eau c\u1ea7u.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng th\u1ec3 \u0111\u1ea1t \u0111\u01b0\u1ee3c ch\u1ee9ng th\u1ef1c c\u1ee7a b\u1ea1n t\u1eeb URL cung c\u1ea5p.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng c\u00f3 ch\u1ee9ng th\u1ef1c cho t\u00ean DNS y\u00eau c\u1ea7u.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=SSL m\u00e1y ngang h\u00e0ng kh\u00f4ng th\u1ec3 nh\u1eadn tr\u1ea3 l\u1eddi OCSP v\u1ec1 ch\u1ee9ng th\u1ef1c.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=M\u00e1y ngang h\u00e0ng b\u00e1o gi\u00e1 tr\u1ecb ch\u1ee9ng th\u1ef1c x\u1ea5u.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay New Session Ticket kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL nh\u1eadn m\u1ed9t th\u00f4ng \u0111i\u1ec7p b\u1eaft tay New Session Ticket sai d\u1ea1ng.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL nh\u1eadn m\u1ed9t b\u1ea3n ghi n\u00e9n m\u00e0 kh\u00f4ng th\u1ec3 gi\u1ea3i n\u00e9n \u0111\u01b0\u1ee3c.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=T\u00e1i \u0111\u00e0m ph\u00e1n kh\u00f4ng \u0111\u01b0\u1ee3c ph\u00e9p tr\u00ean socket SSL n\u00e0y.
SSL_ERROR_UNSAFE_NEGOTIATION=M\u00e1y ngang h\u00e0ng c\u1ed1 m\u1ed9t ki\u1ec3u b\u1eaft tay c\u0169 (c\u00f3 th\u1ec3 ti\u1ec1m \u1ea9n \u0111i\u1ec3m y\u1ebfu).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL nh\u1eadn m\u1ed9t b\u1ea3n ghi kh\u00f4ng n\u00e9n kh\u00f4ng mong \u0111\u1ee3i.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL nh\u1eadn m\u1ed9t kh\u00f3a Diffie-Hellman y\u1ebfu trong th\u00f4ng \u0111i\u1ec7p b\u1eaft tay Server Key Exchange.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL nh\u1eadn \u0111\u01b0\u1ee3c d\u1eef li\u1ec7u m\u1edf r\u1ed9ng NPN kh\u00f4ng h\u1ee3p l\u1ec7.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=T\u00ednh n\u0103ng SSL kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 cho k\u1ebft n\u1ed1i SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=T\u00ednh n\u0103ng SSL kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 cho m\u00e1y ch\u1ee7.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=T\u00ednh n\u0103ng SSL kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 cho m\u00e1y tr\u1ea1m.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=M\u1ed9t l\u1ed7i I/O x\u1ea3y ra trong qu\u00e1 tr\u00ecnh th\u1ea9m \u0111\u1ecbnh b\u1ea3o m\u1eadt.
SEC_ERROR_LIBRARY_FAILURE=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt th\u1ea5t b\u1ea1i.
SEC_ERROR_BAD_DATA=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: nh\u1eadn d\u1eef li\u1ec7u x\u1ea5u.
SEC_ERROR_OUTPUT_LEN=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: l\u1ed7i \u0111\u1ed9 d\u00e0i \u0111\u1ea7u ra.
SEC_ERROR_INPUT_LEN=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt b\u00e1o l\u1ed7i \u0111\u1ed9 d\u00e0i \u0111\u1ea7u v\u00e0o.
SEC_ERROR_INVALID_ARGS=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: tham s\u1ed1 kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_INVALID_ALGORITHM=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: thu\u1eadt to\u00e1n kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_INVALID_AVA=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: AVA kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_INVALID_TIME=Chu\u1ed7i th\u1eddi gian thi\u1ebft l\u1eadp kh\u00f4ng \u0111\u00fang.
SEC_ERROR_BAD_DER=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: th\u00f4ng \u0111i\u1ec7p m\u00e3 ho\u00e1 DER thi\u1ebft l\u1eadp sai.
SEC_ERROR_BAD_SIGNATURE=Ch\u1ee9ng th\u1ef1c c\u1ee7a m\u00e1y ngang h\u00e0ng c\u00f3 ch\u1eef k\u00ed kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_EXPIRED_CERTIFICATE=Ch\u1ee9ng th\u1ef1c c\u1ee7a m\u00e1y ngang h\u00e0ng \u0111\u00e3 h\u1ebft h\u1ea1n.
SEC_ERROR_REVOKED_CERTIFICATE=Ch\u1ee9ng th\u1ef1c c\u1ee7a m\u00e1y ngang h\u00e0ng \u0111\u00e3 b\u1ecb thu h\u1ed3i.
SEC_ERROR_UNKNOWN_ISSUER=Ng\u01b0\u1eddi cung c\u1ea5p ch\u1ee9ng th\u1ef1c m\u00e1y ngang h\u00e0ng ch\u01b0a \u0111\u01b0\u1ee3c nh\u1eadn di\u1ec7n.
SEC_ERROR_BAD_KEY=Kho\u00e1 chung c\u1ee7a m\u00e1y ngang h\u00e0ng kh\u00f4ng \u0111\u00fang.
SEC_ERROR_BAD_PASSWORD=M\u1eadt kh\u1ea9u b\u1ea3o m\u1eadt nh\u1eadp v\u00e0o kh\u00f4ng \u0111\u00fang.
SEC_ERROR_RETRY_PASSWORD=Nh\u1eadp sai m\u1eadt kh\u1ea9u m\u1edbi. Vui l\u00f2ng th\u1eed l\u1ea1i.
SEC_ERROR_NO_NODELOCK=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: kh\u00f4ng c\u00f3 kho\u00e1 n\u1ed1t.
SEC_ERROR_BAD_DATABASE=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: c\u01a1 s\u1edf d\u1eef li\u1ec7u x\u1ea5u.
SEC_ERROR_NO_MEMORY=Th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: th\u1ea5t b\u1ea1i trong vi\u1ec7c \u0111\u1ecbnh b\u1ed9 nh\u1edb.
SEC_ERROR_UNTRUSTED_ISSUER=Ng\u01b0\u1eddi cung c\u1ea5p ch\u1ee9ng th\u1ef1c m\u00e1y ngang h\u00e0ng b\u1ecb \u0111\u00e1nh d\u1ea5u kh\u00f4ng tin t\u01b0\u1edfng b\u1edfi ng\u01b0\u1eddi s\u1eed d\u1ee5ng.
SEC_ERROR_UNTRUSTED_CERT=Ch\u1ee9ng th\u1ef1c m\u00e1y ngang h\u00e0ng b\u1ecb \u0111\u00e1nh d\u1ea5u kh\u00f4ng tin t\u01b0\u1edfng b\u1edfi ng\u01b0\u1eddi s\u1eed d\u1ee5ng.
SEC_ERROR_DUPLICATE_CERT=Ch\u1ee9ng th\u1ef1c \u0111\u00e3 t\u1ed3n t\u1ea1i trong c\u01a1 s\u1edf d\u1eef li\u1ec7u c\u1ee7a b\u1ea1n.
SEC_ERROR_DUPLICATE_CERT_NAME=T\u00ean ch\u1ee9ng th\u01b0 t\u1ea3i v\u1ec1 tr\u00f9ng v\u1edbi m\u1ed9t t\u00ean c\u00f3 s\u1eb5n trong c\u01a1 s\u1edf d\u1eef li\u1ec7u c\u1ee7a b\u1ea1n.
SEC_ERROR_ADDING_CERT=L\u1ed7i th\u00eam ch\u1ee9ng th\u1ef1c v\u00e0o c\u01a1 s\u1edf d\u1eef li\u1ec7u.
SEC_ERROR_FILING_KEY=Kh\u00f4ng th\u1ec3 s\u1eafp x\u1ebfp m\u00e3 kh\u00f3a cho ch\u1ee9ng nh\u1eadn n\u00e0y.
SEC_ERROR_NO_KEY=Kh\u00f4ng t\u00ecm th\u1ea5y m\u00e3 kh\u00f3a c\u00e1 nh\u00e2n cho ch\u1ee9ng ch\u1ec9 n\u00e0y trong c\u01a1 s\u1edf d\u1eef li\u1ec7u
SEC_ERROR_CERT_VALID=Ch\u1ee9ng nh\u1eadn n\u00e0y l\u00e0 h\u1ee3p l\u1ec7.
SEC_ERROR_CERT_NOT_VALID=Ch\u1ee9ng nh\u1eadn n\u00e0y kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_CERT_NO_RESPONSE=Th\u01b0 vi\u1ec7n Ch\u1ee9ng ch\u1ec9\: Kh\u00f4ng c\u00f3 Ph\u1ea3n h\u1ed3i
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Ch\u00fang nh\u1eadn c\u1ee7a nh\u00e0 cung c\u1ea5p \u0111\u00e3 qu\u00e1 th\u1eddi h\u1ea1n. Vui l\u00f2ng ki\u1ec3m tra l\u1ea1i ng\u00e0y gi\u1edd h\u1ec7 th\u1ed1ng c\u1ee7a b\u1ea1n.
SEC_ERROR_CRL_EXPIRED=CRL c\u1ee7a nh\u00e0 cung c\u1ea5p ch\u1ee9ng nh\u1eadn \u0111\u00e3 qu\u00e1 h\u1ea1n. Vui l\u00f2ng c\u1eadp nh\u1eadt ho\u1eb7c ki\u1ec3m tra ng\u00e0y gi\u1edd h\u1ec7 th\u1ed1ng c\u1ee7a b\u1ea1n.
SEC_ERROR_CRL_BAD_SIGNATURE=CRL c\u1ee7a nh\u00e0 c\u1ea5p ph\u00e1t ch\u1ee9ng nh\u1eadn ch\u1ee9a m\u1ed9t ch\u1eef k\u00ed kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_CRL_INVALID=CRL m\u1edbi c\u00f3 \u0111\u1ecbnh d\u1ea1ng sai.
SEC_ERROR_EXTENSION_VALUE_INVALID=Gi\u00e1 tr\u1ecb gia h\u1ea1n cho ch\u1ee9ng nh\u1eadn kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_EXTENSION_NOT_FOUND=Ch\u1ee9ng nh\u1eadn ch\u01b0a \u0111\u01b0\u1ee3c gia h\u1ea1n.
SEC_ERROR_CA_CERT_INVALID=Ch\u1ee9ng nh\u1eadn c\u1ee7a nh\u00e0 cung c\u1ea5p kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Gi\u1edbi h\u1ea1n \u0111\u1ed9 d\u00e0i \u0111\u01b0\u1eddng d\u1eabn ch\u1ee9ng ch\u1ec9 kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_CERT_USAGES_INVALID=Ph\u1ea7n m\u1ee5c \u0111\u00edch s\u1eed d\u1ee5ng (usages field) trong ch\u1ee9ng nh\u1eadn kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_INTERNAL_ONLY=**Ph\u1ea7n CH\u1ec8 d\u00e0nh cho n\u1ed9i b\u1ed9**
SEC_ERROR_INVALID_KEY=Kh\u00f3a kh\u00f4ng h\u1ed7 tr\u1ee3 thao t\u00e1c \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Ch\u1ee9ng nh\u1eadn ch\u1ee9a b\u1ea3n gia h\u1ea1n quan tr\u1ecdng nh\u01b0ng kh\u00f4ng x\u00e1c \u0111\u1ecbnh.
SEC_ERROR_OLD_CRL=CRL m\u1edbi kh\u00f4ng m\u1edbi h\u01a1n b\u1ea3n hi\u1ec7n t\u1ea1i.
SEC_ERROR_NO_EMAIL_CERT=Kh\u00f4ng \u0111\u01b0\u1ee3c m\u1eadt h\u00f3a ho\u1eb7c k\u00ed\: b\u1ea1n ch\u01b0a c\u00f3 ch\u1ee9ng ch\u1ec9 email.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Ch\u01b0a \u0111\u01b0\u1ee3c m\u00e3 h\u00f3a\: b\u1ea1n kh\u00f4ng c\u00f3 \u0111\u1ee7 ch\u1ee9ng nh\u1eadn cho c\u00e1c ng\u01b0\u1eddi nh\u1eadn.
SEC_ERROR_NOT_A_RECIPIENT=Kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3\: b\u1ea1n kh\u00f4ng ph\u1ea3i l\u00e0 ng\u01b0\u1eddi nh\u1eadn ho\u1eb7c kh\u00f4ng t\u00ecm \u0111\u01b0\u1ee3c ch\u1ee9ng nh\u1eadn hay m\u00e3 kh\u00f3a ph\u00f9 h\u1ee3p.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3\: thu\u1eadt to\u00e1n m\u00e3 h\u00f3a kh\u00f4ng kh\u1edbp v\u1edbi ch\u1ee9ng nh\u1eadn c\u1ee7a b\u1ea1n.
SEC_ERROR_PKCS7_BAD_SIGNATURE=X\u00e1c th\u1ef1c ch\u1eef k\u00ed th\u1ea5t b\u1ea1i\: kh\u00f4ng t\u00ecm th\u1ea5y ng\u01b0\u1eddi k\u00ed, qu\u00e1 nhi\u1ec1u ng\u01b0\u1eddi k\u00ed, ho\u1eb7c do d\u1eef li\u1ec7u kh\u00f4ng ph\u00f9 h\u1ee3p ho\u1eb7c h\u01b0 h\u1ecfng.
SEC_ERROR_UNSUPPORTED_KEYALG=Thu\u1eadt to\u00e1n kh\u00f3a kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 ho\u1eb7c kh\u00f4ng x\u00e1c \u0111\u1ecbnh \u0111\u01b0\u1ee3c.
SEC_ERROR_DECRYPTION_DISALLOWED=Kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3\: m\u00e3 kh\u00f3a s\u1eed d\u1ee5ng thu\u1eadt to\u00e1n ho\u1eb7c \u0111\u1ed9 d\u00e0i kh\u00f3a kh\u00f4ng \u0111\u01b0\u1ee3c c\u00f4ng nh\u1eadn.
XP_SEC_FORTEZZA_BAD_CARD=Th\u1ebb Fortezza ch\u01b0a \u0111\u01b0\u1ee3c kh\u1edfi t\u1ea1o \u0111\u00fang c\u00e1ch. Vui l\u00f2ng h\u1ee7y b\u1ecf v\u00e0 tr\u1ea3 l\u1ea1i cho nh\u00e0 cung c\u1ea5p.
XP_SEC_FORTEZZA_NO_CARD=Kh\u00f4ng t\u00ecm th\u1ea5y th\u1ebb Fortezza n\u00e0o
XP_SEC_FORTEZZA_NONE_SELECTED=Ch\u01b0a ch\u1ecdn th\u1ebb Fortezza
XP_SEC_FORTEZZA_MORE_INFO=Vui l\u00f2ng ch\u1ecdn m\u1ed9t thu\u1ed9c t\u00ednh (personality) \u0111\u1ec3 xem th\u00eam th\u00f4ng tin
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Kh\u00f4ng t\u00ecm th\u1ea5y Thu\u1ed9c t\u00ednh (personality)
XP_SEC_FORTEZZA_NO_MORE_INFO=Kh\u00f4ng t\u00ecm th\u1ea5y th\u00f4ng tin th\u00eam v\u1ec1 thu\u1ed9c t\u00ednh (Personality) \u0111\u00f3
XP_SEC_FORTEZZA_BAD_PIN=Pin kh\u00f4ng h\u1ee3p l\u1ec7
XP_SEC_FORTEZZA_PERSON_ERROR=Kh\u00f4ng th\u1ec3 kh\u1edfi t\u1ea1o c\u00e1c thu\u1ed9c t\u00ednh (personality) Fortezza.
SEC_ERROR_NO_KRL=Kh\u00f4ng t\u00ecm th\u1ea5y KRL n\u00e0o cho ch\u1ee9ng nh\u1eadn n\u00e0y.
SEC_ERROR_KRL_EXPIRED=KRL c\u1ee7a ch\u1ee9ng nh\u1eadn trong trang n\u00e0y \u0111\u00e3 qu\u00e1 h\u1ea1n.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL c\u1ee7a ch\u1ee9ng nh\u1eadn tr\u00ean trang n\u00e0y ch\u1ee9a m\u1ed9t kh\u00f3a (signature) kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_REVOKED_KEY=M\u00e3 kh\u00f3a cho ch\u1ee9ng nh\u1eadn tr\u00ean trang n\u00e0y \u0111\u00e3 b\u1ecb thu h\u1ed3i.
SEC_ERROR_KRL_INVALID=\u0110\u1ecbnh d\u1ea1ng c\u1ee7a KRL m\u1edbi kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_NEED_RANDOM=th\u01b0 vi\u1ec7n an ninh\: c\u1ea7n d\u1eef li\u1ec7u ng\u1eabu nhi\u00ean.
SEC_ERROR_NO_MODULE=th\u01b0 vi\u1ec7n b\u1ea3o m\u1eadt\: kh\u00f4ng m\u1ed9t b\u1ed9 ph\u1eadn b\u1ea3o m\u1eadt n\u00e0o c\u00f3 th\u1ec3 th\u1ef1c hi\u1ec7n \u0111\u01b0\u1ee3c y\u00eau c\u1ea7u.
SEC_ERROR_NO_TOKEN=Th\u1ebb an ninh ho\u1eb7c m\u00e3 th\u00f4ng b\u00e1o (token) kh\u00f4ng hi\u1ec7n h\u1eefu, c\u1ea7n \u0111u\u1ee3c nh\u1eadn di\u1ec7n, ho\u1eb7c \u0111\u00e3 b\u1ecb x\u00f3a.
SEC_ERROR_READ_ONLY=th\u01b0 vi\u1ec7n an ninh\: d\u1eef li\u1ec7u ch\u1ed1ng ghi.
SEC_ERROR_NO_SLOT_SELECTED=Kh\u00f4ng c\u00f3 khe hay m\u00e3 th\u00f4ng b\u00e1o n\u00e0o \u0111\u01b0\u1ee3c ch\u1ecdn.
SEC_ERROR_CERT_NICKNAME_COLLISION=\u0110\u00e3 t\u1ed3n t\u1ea1i m\u1ed9t ch\u1ee9ng ch\u1ec9 v\u1edbi c\u00f9ng bi\u1ec7t danh.
SEC_ERROR_KEY_NICKNAME_COLLISION=\u0110\u00e3 t\u1ed3n t\u1ea1i m\u1ed9t kh\u00f3a v\u1edbi c\u00f9ng bi\u1ec7t danh.
SEC_ERROR_SAFE_NOT_CREATED=ph\u00e1t sinh l\u1ed7i khi t\u1ea1o th\u1ef1c th\u1ec3 an to\u00e0n
SEC_ERROR_BAGGAGE_NOT_CREATED=l\u1ed7i ph\u00e1t sinh khi t\u1ea1o th\u1ef1c th\u1ec3 h\u00e0nh l\u00ed
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Kh\u00f4ng th\u1ec3 x\u00f3a principal
XP_JAVA_DELETE_PRIVILEGE_ERROR=Kh\u00f4ng th\u1ec3 x\u00f3a \u0111\u01b0\u1ee3c \u0111\u1eb7c quy\u1ec1n
XP_JAVA_CERT_NOT_EXISTS_ERROR=Principal n\u00e0y kh\u00f4ng c\u00f3 ch\u1ee9ng nh\u1eadn
SEC_ERROR_BAD_EXPORT_ALGORITHM=Thu\u1eadt to\u00e1n y\u00eau c\u1ea7u kh\u00f4ng \u0111\u01b0\u1ee3c ph\u00e9p.
SEC_ERROR_EXPORTING_CERTIFICATES=L\u1ed7i khi \u0111ang c\u1ed1 xu\u1ea5t ch\u1ee9ng ch\u1ec9.
SEC_ERROR_IMPORTING_CERTIFICATES=L\u1ed7i khi \u0111ang c\u1ed1 nh\u1eadp ch\u1ee9ng ch\u1ec9.
SEC_ERROR_PKCS12_DECODING_PFX=Kh\u00f4ng th\u1ec3 nh\u1eadp. Gi\u1ea3i m\u00e3 l\u1ed7i. T\u1eadp tin kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_PKCS12_INVALID_MAC=Kh\u00f4ng th\u1ec3 nh\u1eadp. MAC b\u1ea5t h\u1ee3p l\u1ec7. M\u1eadt kh\u1ea9u sai ho\u1eb7c t\u1eadp tin b\u1ecb h\u01b0.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Kh\u00f4ng th\u1ec3 nh\u1eadp. Thu\u1eadt to\u00e1n MAC kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Kh\u00f4ng th\u1ec3 nh\u1eadp. Ch\u1ec9 c\u00f3 ch\u1ebf \u0111\u1ed9 ri\u00eang t\u01b0 v\u00e0 t\u00edch h\u1ee3p m\u1eadt kh\u1ea9u m\u1edbi \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Kh\u00f4ng th\u1ec3 nh\u1eadp. C\u1ea5u tr\u00fac t\u1eadp tin b\u1ecb h\u1ecfng.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Kh\u00f4ng th\u1ec3 nh\u1eadp. Thu\u1eadt to\u00e1n m\u1eadt h\u00f3a kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Kh\u00f4ng th\u1ec3 nh\u1eadp. Phi\u00ean b\u1ea3n t\u1eadp tin kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Kh\u00f4ng th\u1ec3 nh\u1eadp. M\u1eadt kh\u1ea9u ri\u00eang kh\u00f4ng \u0111\u00fang.
SEC_ERROR_PKCS12_CERT_COLLISION=Kh\u00f4ng th\u1ec3 nh\u1eadp. B\u00ed danh nh\u01b0 th\u1ebf \u0111\u00e3 t\u1ed3n t\u1ea1i trong c\u01a1 s\u1edf d\u1eef li\u1ec7u.
SEC_ERROR_USER_CANCELLED=Ng\u01b0\u1eddi d\u00f9ng nh\u1ea5n h\u1ee7y b\u1ecf.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Kh\u00f4ng \u0111\u01b0\u1ee3c nh\u1eadp, \u0111\u00e3 c\u00f3 trong c\u01a1 s\u1edf d\u1eef li\u1ec7u.
SEC_ERROR_MESSAGE_SEND_ABORTED=Th\u00f4ng b\u00e1o kh\u00f4ng \u0111\u01b0\u1ee3c g\u1eedi.
SEC_ERROR_INADEQUATE_KEY_USAGE=Vi\u1ec7c s\u1eed d\u1ee5ng kh\u00f3a ch\u1ee9ng ch\u1ec9 l\u00e0 kh\u00f4ng ph\u00f9 h\u1ee3p cho thao t\u00e1c \u0111\u00e3 l\u00e0m.
SEC_ERROR_INADEQUATE_CERT_TYPE=Ki\u1ec3u ch\u1ee9ng ch\u1ec9 kh\u00f4ng \u0111\u01b0\u1ee3c ch\u1ea5p thu\u1eadn trong ch\u01b0\u01a1ng tr\u00ecnh.
SEC_ERROR_CERT_ADDR_MISMATCH=\u0110\u1ecba ch\u1ec9 trong ph\u1ea7n k\u00ed ch\u1ee9ng ch\u1ec9 kh\u00f4ng kh\u1edbp v\u1edbi \u0111\u1ecba ch\u1ec9 trong ph\u1ea7n \u0111\u1ea7u c\u1ee7a th\u00f4ng \u0111i\u1ec7p.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Kh\u00f4ng th\u1ec3 nh\u1eadp. L\u1ed7i khi \u0111ang c\u1ed1 nh\u1eadp kh\u00f3a c\u00e1 nh\u00e2n.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Kh\u00f4ng th\u1ec3 nh\u1eadp. L\u1ed7i khi \u0111ang c\u1ed1 nh\u1eadp m\u1ea1ch chu\u1ed7i ch\u1ee9ng ch\u1ec9.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Kh\u00f4ng th\u1ec3 xu\u1ea5t. Kh\u00f4ng th\u1ec3 x\u00e1c \u0111\u1ecbnh ch\u1ee9ng ch\u1ec9 ho\u1eb7c kh\u00f3a b\u1eb1ng bi\u1ec7t danh.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Kh\u00f4ng th\u1ec3 xu\u1ea5t. Kh\u00f3a C\u00e1 nh\u00e2n kh\u00f4ng \u0111\u01b0\u1ee3c t\u00ecm th\u1ea5y.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Kh\u00f4ng th\u1ec3 xu\u1ea5t. Kh\u00f4ng th\u1ec3 ghi t\u1eadp tin xu\u1ea5t.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Kh\u00f4ng th\u1ec3 xu\u1ea5t. Kh\u00f4ng th\u1ec3 \u0111\u1ecdc t\u1eadp tin xu\u1ea5t.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Kh\u00f4ng th\u1ec3 xu\u1ea5t. C\u01a1 s\u1edf d\u1eef li\u1ec7u Kh\u00f3a \u0111\u00e3 b\u1ecb h\u01b0 ho\u1eb7c b\u1ecb x\u00f3a.
SEC_ERROR_KEYGEN_FAIL=Kh\u00f4ng th\u1ec3 t\u1ea1o c\u1eb7p kh\u00f3a c\u00e1 nh\u00e2n/c\u00f4ng c\u1ed9ng.
SEC_ERROR_INVALID_PASSWORD=M\u1eadt kh\u1ea9u nh\u1eadp v\u00e0o b\u1ea5t h\u1ee3p l\u1ec7. Vui l\u00f2ng ch\u1ecdn c\u00e1i kh\u00e1c.
SEC_ERROR_RETRY_OLD_PASSWORD=M\u1eadt kh\u1ea9u c\u0169 nh\u1eadp v\u00e0o kh\u00f4ng ch\u00ednh x\u00e1c. Vui l\u00f2ng th\u1eed l\u1ea1i.
SEC_ERROR_BAD_NICKNAME=Bi\u1ec7t danh ch\u1ee9ng ch\u1ec9 \u0111\u00e3 \u0111\u01b0\u1ee3c d\u00f9ng.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Chu\u1ed7i FORTEZZA ngang h\u00e0ng c\u00f3 m\u1ed9t Ch\u1ee9ng ch\u1ec9 kh\u00f4ng-ph\u1ea3i-FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=M\u1ed9t kh\u00f3a nh\u1ea1y c\u1ea3m kh\u00f4ng th\u1ec3 di chuy\u1ec3n sang khe c\u1ea7n thi\u1ebft.
SEC_ERROR_JS_INVALID_MODULE_NAME=T\u00ean module kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_JS_INVALID_DLL=T\u00ean t\u1eadp tin/\u0111\u01b0\u1eddng d\u1eabn c\u1ee7a module kh\u00f4ng h\u1ee3p l\u1ec7
SEC_ERROR_JS_ADD_MOD_FAILURE=Kh\u00f4ng th\u1ec3 th\u00eam module
SEC_ERROR_JS_DEL_MOD_FAILURE=Kh\u00f4ng th\u1ec3 x\u00f3a module
SEC_ERROR_OLD_KRL=KRL m\u1edbi kh\u00f4ng m\u1edbi h\u01a1n c\u00e1i hi\u1ec7n t\u1ea1i.
SEC_ERROR_CKL_CONFLICT=CKL m\u1edbi c\u00f3 nh\u00e0 c\u1ea5p ph\u00e1t kh\u00e1c CKL hi\u1ec7n t\u1ea1i. H\u00e3y x\u00f3a CKL hi\u1ec7n t\u1ea1i.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Nh\u00e0 th\u1ea9m \u0111\u1ecbnh c\u1ee7a ch\u1ee9ng th\u01b0 n\u00e0y kh\u00f4ng \u0111\u01b0\u1ee3c ph\u00e9p c\u1ea5p ph\u00e1t ch\u1ee9ng th\u01b0 c\u00f3 t\u00ean nh\u01b0 v\u1eady.
SEC_ERROR_KRL_NOT_YET_VALID=Danh s\u00e1ch thu h\u1ed3i kh\u00f3a cho ch\u1ee9ng ch\u1ec9 n\u00e0y ch\u01b0a h\u1ee3p l\u1ec7.
SEC_ERROR_CRL_NOT_YET_VALID=Danh s\u00e1ch thu h\u1ed3i ch\u1ee9ng ch\u1ec9 cho ch\u1ee9ng ch\u1ec9 n\u00e0y ch\u01b0a h\u1ee3p l\u1ec7.
SEC_ERROR_UNKNOWN_CERT=Kh\u00f4ng t\u00ecm th\u1ea5y ch\u1ee9ng ch\u1ec9 y\u00eau c\u1ea7u.
SEC_ERROR_UNKNOWN_SIGNER=Kh\u00f4ng t\u00ecm th\u1ea5y ch\u1ee9ng ch\u1ec9 c\u1ee7a ng\u01b0\u1eddi k\u00ed.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=V\u1ecb tr\u00ed c\u1ee7a m\u00e1y ch\u1ee7 t\u00ecnh tr\u1ea1ng ch\u1ee9ng ch\u1ec9 c\u00f3 \u0111\u1ecbnh d\u1ea1ng b\u1ea5t h\u1ee3p l\u1ec7.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Ph\u1ea3n h\u1ed3i OCSP kh\u00f4ng th\u1ec3 \u0111\u01b0\u1ee3c gi\u1ea3i m\u00e3 \u0111\u1ea7y \u0111\u1ee7; n\u00f3 l\u00e0 m\u1ed9t ki\u1ec3u ch\u01b0a bi\u1ebft.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=M\u00e1y ch\u1ee7 OCSP tr\u1ea3 l\u1ea1i d\u1eef li\u1ec7u HTTP b\u1ea5t h\u1ee3p l\u1ec7/kh\u00f4ng mong \u0111\u1ee3i.
SEC_ERROR_OCSP_MALFORMED_REQUEST=M\u00e1y ch\u1ee7 OCSP b\u00e1o r\u1eb1ng truy v\u1ea5n b\u1ecb h\u1ecfng ho\u1eb7c \u1edf d\u1ea1ng kh\u00f4ng ph\u00f9 h\u1ee3p.
SEC_ERROR_OCSP_SERVER_ERROR=M\u00e1y ch\u1ee7 OCSP g\u1eb7p m\u1ed9t l\u1ed7i n\u1ed9i t\u1ea1i.
SEC_ERROR_OCSP_TRY_SERVER_LATER=M\u00e1y ch\u1ee7 OCSP \u0111\u1ec1 ngh\u1ecb th\u1eed l\u1ea1i sau.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=M\u00e1y ch\u1ee7 OCSP y\u00eau c\u1ea7u ch\u1eef k\u00ed cho truy v\u1ea5n n\u00e0y.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=M\u00e1y ch\u1ee7 OCSP t\u1eeb ch\u1ed1i v\u00ec cho r\u1eb1ng truy v\u1ea5n n\u00e0y kh\u00f4ng \u0111\u01b0\u1ee3c ph\u00e9p.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=M\u00e1y ch\u1ee7 OCSP tr\u1ea3 l\u1ea1i tr\u1ea1ng th\u00e1i kh\u00f4ng th\u1ec3 nh\u1eadn di\u1ec7n.
SEC_ERROR_OCSP_UNKNOWN_CERT=M\u00e1y ch\u1ee7 OCSP kh\u00f4ng c\u00f3 tr\u1ea1ng th\u00e1i cho ch\u1ee9ng ch\u1ec9.
SEC_ERROR_OCSP_NOT_ENABLED=B\u1ea1n ph\u1ea3i k\u00edch ho\u1ea1t OCSP tr\u01b0\u1edbc khi th\u1ef1c hi\u1ec7n thao t\u00e1c n\u00e0y.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=B\u1ea1n ph\u1ea3i c\u00e0i \u0111\u1eb7t ph\u1ea7n ph\u1ea3n h\u1ed3i m\u1eb7c \u0111\u1ecbnh cho OCSP tr\u01b0\u1edbc khi th\u1ef1c hi\u1ec7n thao t\u00e1c n\u00e0y.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Ph\u1ea3n h\u1ed3i t\u1eeb m\u00e1y ch\u1ee7 OCSP \u0111\u00e3 b\u1ecb h\u01b0 ho\u1eb7c \u1edf d\u1ea1ng kh\u00f4ng ph\u00f9 h\u1ee3p.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=B\u00ean k\u00ed ph\u1ea3n h\u1ed3i OCSP kh\u00f4ng c\u00f3 th\u1ea9m quy\u1ec1n \u0111\u1ec3 \u0111\u01b0a ra tr\u1ea1ng th\u00e1i cho ch\u1ee9ng ch\u1ec9 n\u00e0y.
SEC_ERROR_OCSP_FUTURE_RESPONSE=Ph\u1ea3n h\u1ed3i OCSP ch\u01b0a h\u1ee3p l\u1ec7 (ch\u1ee9a m\u1ed9t ng\u00e0y trong t\u01b0\u01a1ng lai).
SEC_ERROR_OCSP_OLD_RESPONSE=Ph\u1ea3n h\u1ed3i OCSP ch\u1ee9a th\u00f4ng tin l\u1ed7i th\u1eddi.
SEC_ERROR_DIGEST_NOT_FOUND=Kh\u00f4ng t\u00ecm th\u1ea5y t\u1eadp san CMS hay PKCS \#7 trong th\u00f4ng \u0111i\u1ec7p \u0111\u00e3 k\u00ed.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Ki\u1ec3u Th\u00f4ng \u0111i\u1ec7p CMS ho\u1eb7c PKCS \#7 kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_MODULE_STUCK=Kh\u00f4ng th\u1ec3 g\u1ee1 b\u1ecf module PKCS \#11 v\u00ec n\u00f3 v\u1eabn \u0111ang \u0111\u01b0\u1ee3c d\u00f9ng.
SEC_ERROR_BAD_TEMPLATE=Kh\u00f4ng th\u1ec3 gi\u1ea3i m\u00e3 d\u1eef li\u1ec7u ASN.1. Khu\u00f4n m\u1eabu \u0111\u01b0\u1ee3c ch\u1ec9 \u0111\u1ecbnh kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_CRL_NOT_FOUND=Kh\u00f4ng t\u00ecm th\u1ea5y CRL ph\u00f9 h\u1ee3p.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=B\u1ea1n \u0111ang c\u1ed1 nh\u1eadp m\u1ed9t ch\u1ee9ng ch\u1ec9 c\u00f3 serial/t\u00ean nh\u00e0 c\u1ea5p ph\u00e1t tr\u00f9ng v\u1edbi m\u1ed9t ch\u1ee9ng ch\u1ec9 \u0111\u00e3 c\u00f3, nh\u01b0ng \u0111\u00f3 kh\u00f4ng ph\u1ea3i l\u00e0 c\u00f9ng m\u1ed9t ch\u1ee9ng ch\u1ec9.
SEC_ERROR_BUSY=NSS kh\u00f4ng th\u1ec3 t\u1eaft. \u0110\u1ed1i t\u01b0\u1ee3ng v\u1eabn \u0111ang \u0111\u01b0\u1ee3c d\u00f9ng.
SEC_ERROR_EXTRA_INPUT=Th\u00f4ng \u0111i\u1ec7p m\u00e3 h\u00f3a DER ch\u1ee9a th\u00eam d\u1eef li\u1ec7u kh\u00f4ng \u0111\u01b0\u1ee3c d\u00f9ng t\u1edbi.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=\u0110\u01b0\u1eddng cong elliptic kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Bi\u1ec3u m\u1eabu \u0111i\u1ec3m \u0111\u01b0\u1eddng cong elliptic kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3.
SEC_ERROR_UNRECOGNIZED_OID=Kh\u00f4ng nh\u1eadn di\u1ec7n \u0111\u01b0\u1ee3c tr\u00ecnh \u0110\u1ecbnh danh \u0110\u1ed1i t\u01b0\u1ee3ng.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Ch\u1ee9ng ch\u1ec9 k\u00ed OCSP b\u1ea5t h\u1ee3p l\u1ec7 trong ph\u1ea3n h\u1ed3i OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Ch\u1ee9ng ch\u1ec9 b\u1ecb thu h\u1ed3i trong danh s\u00e1ch thu h\u1ed3i ch\u1ee9ng ch\u1ec9 c\u1ee7a nh\u00e0 c\u1ea5p ph\u00e1t.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Ph\u1ea3n h\u1ed3i OCSP c\u1ee7a nh\u00e0 c\u1ea5p ph\u00e1t b\u00e1o r\u1eb1ng ch\u1ee9ng ch\u1ec9 \u0111\u00e3 b\u1ecb thu h\u1ed3i.
SEC_ERROR_CRL_INVALID_VERSION=Danh s\u00e1ch Thu h\u1ed3i Ch\u1ee9ng ch\u1ec9 c\u1ee7a nh\u00e0 C\u1ea5p ph\u00e1t c\u00f3 s\u1ed1 phi\u00ean b\u1ea3n kh\u00f4ng x\u00e1c \u0111\u1ecbnh.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Danh s\u00e1ch Thu h\u1ed3i Ch\u1ee9ng ch\u1ec9 V1 c\u1ee7a nh\u00e0 C\u1ea5p ph\u00e1t c\u00f3 ph\u1ea7n gia h\u1ea1n nghi\u00eam tr\u1ecdng.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Danh s\u00e1ch Thu h\u1ed3i Ch\u1ee9ng ch\u1ec9 V2 c\u1ee7a nh\u00e0 C\u1ea5p ph\u00e1t c\u00f3 ph\u1ea7n gia h\u1ea1n nghi\u00eam tr\u1ecdng ch\u01b0a x\u00e1c \u0111\u1ecbnh.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Ki\u1ec3u \u0111\u1ed1i t\u01b0\u1ee3ng ch\u01b0a bi\u1ebft \u0111\u01b0\u1ee3c ch\u1ec9 \u0111\u1ecbnh.
SEC_ERROR_INCOMPATIBLE_PKCS11=Tr\u00ecnh \u0111i\u1ec1u khi\u1ec3n PKCS \#11 vi ph\u1ea1m \u0111\u1eb7c t\u1ea3 trong m\u1ed9t c\u00e1ch th\u1ee9c kh\u00f4ng t\u01b0\u01a1ng th\u00edch.
SEC_ERROR_NO_EVENT=Kh\u00f4ng c\u00f3 s\u1ef1 ki\u1ec7n khe m\u1edbi n\u00e0o hi\u1ec7n h\u1eefu l\u00fac n\u00e0y.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL \u0111\u00e3 t\u1ed3n t\u1ea1i.
SEC_ERROR_NOT_INITIALIZED=NSS kh\u00f4ng \u0111\u01b0\u1ee3c nh\u1eadn di\u1ec7n.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Thao t\u00e1c th\u1ea5t b\u1ea1i v\u00ec m\u00e3 th\u00f4ng b\u00e1o PKCS \#11 kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u0103ng nh\u1eadp.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Ch\u1ee9ng ch\u1ec9 c\u1ee7a ph\u1ea7n ph\u1ea3n h\u1ed3i OCSP \u0111\u01b0\u1ee3c c\u1ea5u h\u00ecnh kh\u00f4ng h\u1ee3p l\u1ec7.
SEC_ERROR_OCSP_BAD_SIGNATURE=Ph\u1ea3n h\u1ed3i OCSP c\u00f3 m\u1ed9t ch\u1eef k\u00ed b\u1ea5t h\u1ee3p l\u1ec7.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=T\u00ecm ki\u1ebfm ki\u1ec3m \u0111\u1ecbnh ch\u1ee9ng th\u01b0 b\u1ecb ngo\u00e0i gi\u1edbi h\u1ea1n t\u00ecm ki\u1ebfm
SEC_ERROR_INVALID_POLICY_MAPPING=\u0110\u1ecbnh tuy\u1ebfn ch\u00ednh s\u00e1ch ch\u1ee9a anypolicy
SEC_ERROR_POLICY_VALIDATION_FAILED=Chu\u1ed7i ch\u1ee9ng th\u01b0 b\u1ecb th\u1ea5t b\u1ea1i khi ki\u1ec3m \u0111\u1ecbnh ch\u00ednh s\u00e1ch
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Ki\u1ec3u \u0111\u1ecba \u0111i\u1ec3m ch\u01b0a bi\u1ebft trong m\u1edf r\u1ed9ng AIA ch\u1ee9ng th\u01b0
SEC_ERROR_BAD_HTTP_RESPONSE=M\u00e1y ch\u1ee7 tr\u1ea3 l\u1ea1i ph\u1ea3n h\u1ed3i HTTP x\u1ea5u
SEC_ERROR_BAD_LDAP_RESPONSE=M\u00e1y ch\u1ee7 tr\u1ea3 l\u1ea1i ph\u1ea3n h\u1ed3i LDAP x\u1ea5u
SEC_ERROR_FAILED_TO_ENCODE_DATA=Th\u1ea5t b\u1ea1i khi m\u00e3 h\u00f3a d\u1eef li\u1ec7u v\u1edbi tr\u00ecnh m\u00e3 h\u00f3a ANSI
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=\u0110\u1ecba \u0111i\u1ec3m truy c\u1eadp th\u00f4ng tin x\u1ea5u trong m\u1edf r\u1ed9ng ch\u1ee9ng th\u01b0
SEC_ERROR_LIBPKIX_INTERNAL=L\u1ed7i n\u1ed9i b\u1ed9 Libpkix x\u1ea3y ra trong qu\u00e1 tr\u00ecnh ki\u1ec3m \u0111\u1ecbnh ch\u1ee9ng th\u01b0.
SEC_ERROR_PKCS11_GENERAL_ERROR=M\u1ed9t module PKCS\#11 tr\u1ea3 l\u1ea1i CKR_GENERAL_ERROR, cho bi\u1ebft r\u1eb1ng m\u1ed9t l\u1ed7i kh\u00f4ng th\u1ec3 kh\u00f4i ph\u1ee5c \u0111\u00e3 x\u1ea3y ra.
SEC_ERROR_PKCS11_FUNCTION_FAILED=M\u1ed9t module PKCS\#11 tr\u1ea3 l\u1ea1i CKR_FUNCTION_FAILED, cho bi\u1ebft r\u1eb1ng h\u00e0m y\u00eau c\u1ea7u kh\u00f4ng th\u1ec3 th\u1ef1c hi\u1ec7n \u0111\u01b0\u1ee3c. Th\u1eed l\u1ea1i thao t\u00e1c m\u1ed9t l\u1ea7n n\u1eefa c\u00f3 th\u1ec3 s\u1ebd th\u00e0nh c\u00f4ng.
SEC_ERROR_PKCS11_DEVICE_ERROR=M\u1ed9t module PKCS\#11 tr\u1ea3 l\u1ea1i CKR_DEVICE_ERROR, cho bi\u1ebft r\u1eb1ng m\u1ed9t v\u1ea5n \u0111\u1ec1 \u0111\u00e3 x\u1ea3y ra v\u1edbi token ho\u1eb7c slot.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Kh\u00f4ng r\u00f5 ph\u01b0\u01a1ng th\u1ee9c truy c\u1eadp th\u00f4ng tin trong m\u1edf r\u1ed9ng ch\u1ee9ng th\u01b0.
SEC_ERROR_CRL_IMPORT_FAILED=L\u1ed7i khi \u0111ang c\u1ed1 nh\u1eadp m\u1ed9t CRL.
SEC_ERROR_EXPIRED_PASSWORD=M\u1eadt kh\u1ea9u \u0111\u00e3 h\u1ebft h\u1ea1n.
SEC_ERROR_LOCKED_PASSWORD=M\u1eadt kh\u1ea9u b\u1ecb kh\u00f3a.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=L\u1ed7i PKCS \#11 kh\u00f4ng x\u00e1c \u0111\u1ecbnh.
SEC_ERROR_BAD_CRL_DP_URL=URL sai ho\u1eb7c kh\u00f4ng \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3 trong t\u00ean \u0111i\u1ec3m ph\u00e2n ph\u1ed1i CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Ch\u1ee9ng th\u01b0 \u0111\u01b0\u1ee3c k\u00fd theo thu\u1eadt to\u00e1n k\u00fd \u0111\u00e3 b\u1ecb h\u1ee7y b\u1ecf do kh\u00f4ng an to\u00e0n.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

