#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=Adressen ser ikke ud til at v\u00e6re en webadresse.
fileNotFound=Pale Moon kan ikke finde filen %S.
dnsNotFound=Pale Moon kan ikke finde serveren %S.
protocolNotFound=Pale Moon ved ikke hvordan den skal \u00e5bne denne adresse, fordi protokollen (%S) ikke er tilknyttet noget program.
connectionFailure=Pale Moon kan ikke oprette en forbindelse til serveren %S.
netInterrupt=Forbindelsen til %S blev afbrudt mens siden var ved at blive indl\u00e6st.
netTimeout=Serveren %S er for lang tid om at svare.
redirectLoop=Pale Moon har opdaget at webstedet viderestiller foresp\u00f8rgslen til sig selv p\u00e5 en m\u00e5de, der forhindrer den i nogensinde at blive f\u00e6rdig.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=For at vise denne side m\u00e5 %S sende informationer som gentager en handling (s\u00f8gning eller ordrebekr\u00e6ftelse) som blev udf\u00f8rt tidligere.
resendButton.label=Gensend
unknownSocketType=Pale Moon ved ikke hvordan den skal kommunikere med serveren.
netReset=Forbindelsen til serveren blev nulstillet, mens siden blev indl\u00e6st.
notCached=Dette dokument er ikke l\u00e6ngere tilg\u00e6ngeligt.
netOffline=Pale Moon er pt. i offline mode og kan ikke browse nettet.
isprinting=Dokumentet kan ikke \u00e6ndres under udskrift eller under fremvisning i 'Vis udskrift'.
deniedPortAccess=Denne adresse benytter en netv\u00e6rksport, som normalt anvendes til andre form\u00e5l end webbrowsing. Pale Moon har, for din sikkerheds skyld, annulleret foresp\u00f8rgslen.
proxyResolveFailure=Pale Moon er konfigureret til at benytte en proxyserver, som ikke kan findes.
proxyConnectFailure=Pale Moon er konfigureret til at benytte en proxyserver, som afviser forbindelser.
contentEncodingError=Siden kan ikke vises da den bruger en ugyldig eller ikke underst\u00f8ttet form for komprimering.
unsafeContentType=Siden kan ikke vises da den er registreret med en filtype som ikke er sikker at \u00e5bne. Kontakt venligst ejeren af webstedet omkring dette problem.
externalProtocolTitle=Ekstern protokolforesp\u00f8rgsel.
externalProtocolPrompt=Et eksternt program skal startes for at h\u00e5ndtere %1$S\: links. Forespurgt link\:\n\n\n%2$S\nProgram\: %3$S\n\n\nHvis du ikke forventede denne foresp\u00f8rgsel, kan det v\u00e6re et fors\u00f8g p\u00e5 at udnytte en svaghed i det andet program. Annuller denne foresp\u00f8rgsel, medmindre du er sikker p\u00e5 at den ikke er ondsindet.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Ukendt>
externalProtocolChkMsg=Husk mit valg for alle links af denne type.
externalProtocolLaunchBtn=Start program
malwareBlocked=Webstedet %S er blevet anmeldt som et angrebswebsted og er blevet blokeret baseret p\u00e5 dine sikkerhedsindstillinger.
phishingBlocked=Webstedet %S er blevet anmeldt som v\u00e6rende netsvindel, der narrer folk til at r\u00f8be personlige eller \u00f8konomiske detaljer.
cspFrameAncestorBlocked=Denne side har en indholdssikkerhedspolitik, der forhindrer den i at blive indlejret p\u00e5 denne m\u00e5de.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=Siden kan ikke vises da der er fundet en fejl i transmissionen af data.
remoteXUL=Denne side bruger en ikke-underst\u00f8ttet teknologi som ikke l\u00e6ngere er tilg\u00e6ngelig som standard i Pale Moon.

