#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=No se pudo comunicar de modo seguro. El par no soporta cifrado de alta complejidad.
SSL_ERROR_US_ONLY_SERVER=No se pudo comunicar de modo seguro. El par requiere cifrado de alta complejidad, el cual no es soportado.
SSL_ERROR_NO_CYPHER_OVERLAP=No se pudo comunicar seguramente con el par\: no hay algoritmo/s de cifrado est\u00e1ndares.
SSL_ERROR_NO_CERTIFICATE=No se pudo encontrar el certificado o clave necesaria para la autenticaci\u00f3n.
SSL_ERROR_BAD_CERTIFICATE=No se pudo comunicar de modo seguro con el par\: se rechaz\u00f3 el certificado del mismo.
SSL_ERROR_UNUSED_5=C\u00f3digo de error SSL no reconocido.
SSL_ERROR_BAD_CLIENT=El servidor encontr\u00f3 datos corruptos del cliente.
SSL_ERROR_BAD_SERVER=El cliente encontr\u00f3 datos corruptos del servidor.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Tipo de certificado no soportado.
SSL_ERROR_UNSUPPORTED_VERSION=El par est\u00e1 usando una versi\u00f3n no soportada del protocolo de seguridad.
SSL_ERROR_UNUSED_10=C\u00f3digo de error SSL no reconocido.
SSL_ERROR_WRONG_CERTIFICATE=Fall\u00f3 la autenticaci\u00f3n del cliente\: la clave privada en la base de datos de claves no coincide la clave p\u00fablica con la base de datos certificada.
SSL_ERROR_BAD_CERT_DOMAIN=No se pudo comunicar de modo seguro con el cliente\: el nombre de dominio solicitado no coincide con el certificado del servidor.
SSL_ERROR_POST_WARNING=C\u00f3digo de error SSL no reconocido.
SSL_ERROR_SSL2_DISABLED=El par s\u00f3lo soporta SSL versi\u00f3n 2, la cual est\u00e1 localmente deshabilitada.
SSL_ERROR_BAD_MAC_READ=SSL recibi\u00f3 un registro con un c\u00f3digo de autenticaci\u00f3n de mensaje incorrecto.
SSL_ERROR_BAD_MAC_ALERT=El par de SSL informar de un c\u00f3digo de autenticaci\u00f3n de mensaje incorrecto.
SSL_ERROR_BAD_CERT_ALERT=El par de SSL no puede verificar tu certificado.
SSL_ERROR_REVOKED_CERT_ALERT=El par de SSL rechaz\u00f3 tu certificado como revocado.
SSL_ERROR_EXPIRED_CERT_ALERT=El par de SSL rechaz\u00f3 tu certificado como vencido.
SSL_ERROR_SSL_DISABLED=No se puede conectar\: SSL est\u00e1 deshabilitado.
SSL_ERROR_FORTEZZA_PQG=No se puede conectar\: el par SSL est\u00e1 en otro dominio FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Se solicit\u00f3 una suite de cifrado SSL desconocida.
SSL_ERROR_NO_CIPHERS_SUPPORTED=No hay suite de cifrado presente y habilitada en este programa.
SSL_ERROR_BAD_BLOCK_PADDING=SSL recibi\u00f3 un registro con un relleno de bloque corrupto.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL recibi\u00f3 un registro que excede la longitud m\u00e1xima permitida.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL intent\u00f3 enviar un registro que excede la longitud m\u00e1xima permitida.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL recibi\u00f3 un mensaje de negociaci\u00f3n solicitada "Hello" corrupto.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL recibi\u00f3 un mensaje de negociaci\u00f3n "Hello" de cliente corrupto.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL recibi\u00f3 un mensaje de negociaci\u00f3n "Hello" de servidor corrupto.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de certificado corrupto.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de intercambio de clave de servidor corrupto.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL recibi\u00f3 un mensaje de negociaci\u00f3n solicitada de certificado corrupto.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL recibi\u00f3 un mensaje de negociaci\u00f3n finalizada "Hello" de servidor corrupto.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de verificaci\u00f3n de certificado corrupto.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de intercambio de clave de cliente corrupto.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL recibi\u00f3 un mensaje de negociaci\u00f3n finalizada corrupto.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL recibi\u00f3 un registro de especificaciones de cambio de cifrado corrupto.
SSL_ERROR_RX_MALFORMED_ALERT=SSL recibi\u00f3 un registro de alerta corrupto.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL recibi\u00f3 un registro de negociaci\u00f3n corrupto.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL recibi\u00f3 un registro de datos de aplicaci\u00f3n corrupto.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL recibi\u00f3 un mensaje de negociaci\u00f3n solicitada "Hello" inesperado.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL recibi\u00f3 un mensaje de negociaci\u00f3n "Hello" de cliente inesperado.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL recibi\u00f3 un mensaje de negociaci\u00f3n "Hello" de servidor inesperado.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de certificado inesperado.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de intercambio de clave de servidor inesperado.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de solicitud de certificado inesperado.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL recibi\u00f3 un mensaje de negociaci\u00f3n "Hello" de servidor finalizado inesperado.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de verificaci\u00f3n de certificado inesperado.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de intercambio de clave de cliente inesperado.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL recibi\u00f3 un mensaje de negociaci\u00f3n finalizado inesperado.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL recibi\u00f3 un registro de especificaciones de cambio de cifrado inesperado.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL recibi\u00f3 un registro de alerta inesperado.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL recibi\u00f3 un registro de negociaci\u00f3n inesperado.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL recibi\u00f3 un registro de datos de aplicaci\u00f3n inesperado.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL recibi\u00f3 un registro con un tipo de contenido desconocido.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL recibi\u00f3 un mensaje de negociaci\u00f3n con un tipo de mensaje desconocido.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL recibi\u00f3 un registro de alerta con una descripci\u00f3n desconocida.
SSL_ERROR_CLOSE_NOTIFY_ALERT=El par SSL cerr\u00f3 esta conexi\u00f3n.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=El par SSL no esperaba el mensaje de negociaci\u00f3n que recibi\u00f3.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=El par SSL no pudo descomprimir correctamente un registro SSL que recibi\u00f3.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=El par SSL no pudo negociar un conjunto aceptable de par\u00e1metros de seguridad.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=El par SSL rechaz\u00f3 un mensaje de negociaci\u00f3n por contenido inaceptable.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=El par SSL no soporta los certificados del tipo que recibi\u00f3.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=El par SSL tuvo un problema no especificado con el certificado que recibi\u00f3.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL experiment\u00f3 una falla de su generador de n\u00famero aleatorio.
SSL_ERROR_SIGN_HASHES_FAILURE=No se pudo firmar digitalmente los datos solicitados para verificar tu certificado.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL no pudo extraer la clave p\u00fablica del certificado del par.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Problema no especificado al procesar negociaci\u00f3n de intercambio de clave de servidor SSL.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Problema no especificado al procesar negociaci\u00f3n de intercambio de clave de cliente SSL.
SSL_ERROR_ENCRYPTION_FAILURE=El algoritmo de cifrado de datos masivo fall\u00f3 en la suite de cifrado seleccionada.
SSL_ERROR_DECRYPTION_FAILURE=El algoritmo de decifrado de datos masivo fall\u00f3 en la suite de cifrado seleccionada.
SSL_ERROR_SOCKET_WRITE_FAILURE=Fall\u00f3 el intento de escribir datos cifrados a la ranura subyacente.
SSL_ERROR_MD5_DIGEST_FAILURE=Fall\u00f3 la funci\u00f3n de asimilaci\u00f3n MD5.
SSL_ERROR_SHA_DIGEST_FAILURE=Fall\u00f3 la funci\u00f3n de asimilaci\u00f3n SHA-1.
SSL_ERROR_MAC_COMPUTATION_FAILURE=Fall\u00f3 el c\u00f3mputo MAC.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Falla al crear el contexto de clave sim\u00e9trica.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Fallo al desenvolver la clave sim\u00e9trica en el mensaje de intercambio de clave de cliente.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=El servidor SSL intent\u00f3 usar una clave p\u00fablica de complejidad hogare\u00f1a con exportaci\u00f3n a suite de cifrado.
SSL_ERROR_IV_PARAM_FAILURE=Fall\u00f3 el c\u00f3dgio PKCS11 al trasladar un IV a un par\u00e1metro.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Fall\u00f3 la inicializaci\u00f3n del la suite de cifrado seleccionada.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Fall\u00f3 el cliente al generar claves de sesi\u00f3n para la sesi\u00f3n de SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=El servidor no tiene clave para el intento del algoritmo de intercambio de clave.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=Se insert\u00f3 o quit\u00f3 la ficha PKCS\#11 mientras la operaci\u00f3n estaba en progreso.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=No se encontr\u00f3 ninguna ninguna ficha PKCS\#11 para la operaci\u00f3n solicitada.
SSL_ERROR_NO_COMPRESSION_OVERLAP=No se pudo comunicar de modo seguro con el par\: no hay algoritmo/s de cifrado est\u00e1ndares.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=No se puede iniciar otra negociaci\u00f3n SSL hasta que la negociaci\u00f3n actual est\u00e9 completa.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Se recibi\u00f3 valores hash de negociaci\u00f3n incorrectos del par.
SSL_ERROR_CERT_KEA_MISMATCH=El certificado provisto no puede ser usado con el algoritmo de intercambio de clave seleccionado.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=No hay autoridad de certificado de confianza para la autenticaci\u00f3n de cliente SSL.
SSL_ERROR_SESSION_NOT_FOUND=No se encontr\u00f3 la identificaci\u00f3n de sesi\u00f3n SSL del cliente en la cach\u00e9 de sesi\u00f3n del servidor.
SSL_ERROR_DECRYPTION_FAILED_ALERT=El par no pufo descifrar un registro SSL que recibi\u00f3.
SSL_ERROR_RECORD_OVERFLOW_ALERT=El par recibi\u00f3 un registro SSL que era m\u00e1s largo de lo permitido.
SSL_ERROR_UNKNOWN_CA_ALERT=El par no reconoce ni conf\u00eda en la autoridad de certificado que emiti\u00f3 tu certificado.
SSL_ERROR_ACCESS_DENIED_ALERT=El par recibi\u00f3 un certificado v\u00e1lido, pero se deneg\u00f3 el acceso.
SSL_ERROR_DECODE_ERROR_ALERT=El par no pudo decodificar un mensaje de negociaci\u00f3n SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=El par informa fallo de verificaci\u00f3n de firma o intercambio de clave.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=El par informa negociaci\u00f3n no compatible con las regulaciones de exportaci\u00f3n.
SSL_ERROR_PROTOCOL_VERSION_ALERT=El par informa versi\u00f3n de protocolo incompatible o no soportada.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=El servidor solicitar cifradores m\u00e1s seguros que los soportados por el cliente.
SSL_ERROR_INTERNAL_ERROR_ALERT=El par informa que experiment\u00f3 un error interno.
SSL_ERROR_USER_CANCELED_ALERT=El par cancel\u00f3 la negociaci\u00f3n.
SSL_ERROR_NO_RENEGOTIATION_ALERT=El par no permite renegociaci\u00f3n de par\u00e1metros de seguridad SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=La cach\u00e9 de servidor SSL no est\u00e1 configurada o no est\u00e1 deshabilitada para esta ranura.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=El par SSL no soporta la extensi\u00f3n "Hello" TLS solicitada.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=El par SSL no pudo obtener tu certificado de la direcci\u00f3n web ofrecida.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=El par SSL no tiene certificado para el nombre de DNS solicitado.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=El par SSL no pudo obtener una respuesta OCSP para su certificado.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=El par SSL inform\u00f3 de un valor hash corrupto.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de tiquet de nueva sesi\u00f3n inesperado.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de tiquet de nueva sesi\u00f3n corrupto.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL recibi\u00f3 un registro comprimido que no se pudo descomprimir.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Renegociaci\u00f3n no permitida en este tipo de ranura SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=El par intent\u00f3 una negociaci\u00f3n de estilo antiguo (potencialmente vulnerable).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL recibi\u00f3 un registro no comprimido inesperado.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de intercambio de clave de servidor de clave ef\u00edmera Diffie-Hellman d\u00e9bil.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL recibi\u00f3 datos de extensi\u00f3n NPN no v\u00e1lida.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Funci\u00f3n SSL no soportada en conexiones SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Funci\u00f3n SSL no soportada para servidores.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Funci\u00f3n SSL no soportada para clientes.
SSL_ERROR_INVALID_VERSION_RANGE=El rango de versi\u00f3n SSL no es v\u00e1lido.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=El par SSL seleccion\u00f3 una suite de cifrado no permitida para la versi\u00f3n del protocolo seleccionado.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de verificaci\u00f3n Hello malformado.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de verificaci\u00f3n Hello no esperado.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=La funci\u00f3n SSL no est\u00e1 soportada para la versi\u00f3n del protocolo.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL recibi\u00f3 un mensaje de negociaci\u00f3n de estado de certificado no esperado.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Algoritmo hash usado no soportado por par TLS.
SSL_ERROR_DIGEST_FAILURE=Fall\u00f3 la funci\u00f3n de compilado.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Algoritmo de firma especificado incorrecto en un elemento firmado digitalmente.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=La extensi\u00f3n de negociaci\u00f3n del siguiente protocolo estaba habilitada, pero la devoluci\u00f3n de llamada fue limpiada antes de ser requerida.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=El servidor no soporta el protocolo que anuncia el cliente en la extensi\u00f3n ALPN.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=El servidor rechaz\u00f3 la negociaci\u00f3n porque el cliente descendi\u00f3 a una versi\u00f3n de TLS m\u00e1s antigua de la que soporta el servidor.
SEC_ERROR_IO=Ocurri\u00f3 un error I/O durante la autorizaci\u00f3n de seguridad.
SEC_ERROR_LIBRARY_FAILURE=fallo de la biblioteca de seguridad.
SEC_ERROR_BAD_DATA=biblioteca de seguridad\: se recibieron datos corruptos.
SEC_ERROR_OUTPUT_LEN=biblioteca de seguridad\: error de longitud de salida.
SEC_ERROR_INPUT_LEN=la biblioteca de seguridad experiment\u00f3 un error de longitud de entrada.
SEC_ERROR_INVALID_ARGS=librer\u00eda de seguridad\: argumentos no v\u00e1lidos.
SEC_ERROR_INVALID_ALGORITHM=librer\u00eda de seguridad\: algoritmo no v\u00e1lido.
SEC_ERROR_INVALID_AVA=biblioteca de seguridad\: AVA no v\u00e1lido.
SEC_ERROR_INVALID_TIME=Cadena de tiempo formateada inapropiadamente.
SEC_ERROR_BAD_DER=biblioteca de seguridad\: mensaje codificado en DER formateado inapropiadamente.
SEC_ERROR_BAD_SIGNATURE=El certificado del par tiene una firma no v\u00e1lida.
SEC_ERROR_EXPIRED_CERTIFICATE=Venci\u00f3 el certificado del par.
SEC_ERROR_REVOKED_CERTIFICATE=Fue revocado el certificado del par.
SEC_ERROR_UNKNOWN_ISSUER=El emisor del certificado del par no es reconocido.
SEC_ERROR_BAD_KEY=La clave p\u00fablica del par no es v\u00e1lida.
SEC_ERROR_BAD_PASSWORD=La contrase\u00f1a de seguridad ingresada es incorrecta.
SEC_ERROR_RETRY_PASSWORD=Nueva contrase\u00f1a ingresada incorrectamente. Por favor, prob\u00e1 de nuevo.
SEC_ERROR_NO_NODELOCK=biblioteca de seguridad\: sin bloqueo de nodo.
SEC_ERROR_BAD_DATABASE=biblioteca de seguridad\: base de datos corrupta.
SEC_ERROR_NO_MEMORY=biblioteca de seguridad\: falla en la locaci\u00f3n de memoria.
SEC_ERROR_UNTRUSTED_ISSUER=El emisor del certificado del par fue marcado como de no confianza por el usuario.
SEC_ERROR_UNTRUSTED_CERT=El certificado del par fue marcado como de no confianza por el usuario.
SEC_ERROR_DUPLICATE_CERT=El certificado ya existe en tu base de datos.
SEC_ERROR_DUPLICATE_CERT_NAME=El nombre del certificado descargado duplica al que ya est\u00e1 en tu base de datos.
SEC_ERROR_ADDING_CERT=Error al agregar certificado a la base de datos.
SEC_ERROR_FILING_KEY=Error al rellenar la clave para este certificado.
SEC_ERROR_NO_KEY=No se encontr\u00f3 la clave privada para este certificado en la base de datos de claves.
SEC_ERROR_CERT_VALID=Este certificado es v\u00e1lido.
SEC_ERROR_CERT_NOT_VALID=Este certificado no es v\u00e1lido.
SEC_ERROR_CERT_NO_RESPONSE=Biblioteca de certificado\: sin respuesta
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Venci\u00f3 el certificado del emisor de certificados. Revis\u00e1 la fecha y hora de tu sistema.
SEC_ERROR_CRL_EXPIRED=Venci\u00f3 el CRL del emisor de certificados. Actualizalo o revis\u00e1 la fecha y hora de tu sistema.
SEC_ERROR_CRL_BAD_SIGNATURE=El CRL del emisor de certificados tiene una firma no v\u00e1lida.
SEC_ERROR_CRL_INVALID=El nuevo CRL tiene un formato no v\u00e1lido.
SEC_ERROR_EXTENSION_VALUE_INVALID=El valor de extensi\u00f3n de certificado no es v\u00e1lido.
SEC_ERROR_EXTENSION_NOT_FOUND=No se encontr\u00f3 la extensi\u00f3n de certificado.
SEC_ERROR_CA_CERT_INVALID=El certificado del emisor no es v\u00e1lido.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=La longitud de la ruta del certificado no es v\u00e1lida.
SEC_ERROR_CERT_USAGES_INVALID=El campo "usages" del certificado no es v\u00e1lido.
SEC_INTERNAL_ONLY=**S\u00d3LO m\u00f3dulo interno**
SEC_ERROR_INVALID_KEY=La clave no soporta la operaci\u00f3n solicitada.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=El certificado contiene una extensi\u00f3n cr\u00edtica desconocida.
SEC_ERROR_OLD_CRL=El nuevo CRL no es m\u00e1s reciente que el actual.
SEC_ERROR_NO_EMAIL_CERT=No cifrado o firmado\: todav\u00eda no ten\u00e9s ning\u00fan certificado de correo electr\u00f3nico.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=No cifrado\: no ten\u00e9s certificados para cada uno de los destinatarios.
SEC_ERROR_NOT_A_RECIPIENT=No se puede descifrar\: no sos un destinatario, o no se encontr\u00f3 una coincidencia de certificado y clave p\u00fablica.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=No se puede descifrar\: el algoritmo de cifrado de clave no coincide con tu certificado.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Fall\u00f3 la verificaci\u00f3n de firma\: no se encontr\u00f3 firmante, o se encontraron demasiados firmantes, o hay datos corruptos o inapropiados.
SEC_ERROR_UNSUPPORTED_KEYALG=Algoritmo de clave desconocido o no soportado.
SEC_ERROR_DECRYPTION_DISALLOWED=No se puede descifrar\: cifrado usando un algoritmo o tama\u00f1o de clave no permitidos.
XP_SEC_FORTEZZA_BAD_CARD=No se inicializ\u00f3 correctamente la tarjeta Fortezza. Por favor, quitala y devolv\u00e9sela a su emisor.
XP_SEC_FORTEZZA_NO_CARD=No se encontraron tarjetas Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=No se seleccion\u00f3 tarjeta Fortezza
XP_SEC_FORTEZZA_MORE_INFO=Por favor, seleccion\u00e1 una personalidad para obtener m\u00e1s informaci\u00f3n al respecto
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Personalidad no encontrada
XP_SEC_FORTEZZA_NO_MORE_INFO=No hay m\u00e1s informaci\u00f3n sobre esa personalidad
XP_SEC_FORTEZZA_BAD_PIN=PIN no v\u00e1lido
XP_SEC_FORTEZZA_PERSON_ERROR=No se pudo inicializar las personalidades de Fortezza.
SEC_ERROR_NO_KRL=No se encontr\u00f3 KRL para el certificado de este sitio.
SEC_ERROR_KRL_EXPIRED=Venci\u00f3 el KRL para el certificado de este sitio.
SEC_ERROR_KRL_BAD_SIGNATURE=El KRL para el certificado de este sitio tiene una firma no v\u00e1lida.
SEC_ERROR_REVOKED_KEY=Se revoc\u00f3 la clave para el certificado de este sitio.
SEC_ERROR_KRL_INVALID=El nuevo KRL tiene un formato no v\u00e1lido.
SEC_ERROR_NEED_RANDOM=biblioteca de seguridad\: se necesita datos aleatorios.
SEC_ERROR_NO_MODULE=biblioteca de seguridad\: no hay m\u00f3dulo de seguridad que pueda realizar la operaci\u00f3n solicitada.
SEC_ERROR_NO_TOKEN=La tarjeta de seguridad o la ficha no existe. Necesita ser inicializada o fue quitada.
SEC_ERROR_READ_ONLY=biblioteca de seguridad\: base de datos de s\u00f3lo lectura.
SEC_ERROR_NO_SLOT_SELECTED=No se seleccion\u00f3 ranura o ficha.
SEC_ERROR_CERT_NICKNAME_COLLISION=Ya existe un certificado con el mismo nombre.
SEC_ERROR_KEY_NICKNAME_COLLISION=Ya existe una clave con el mismo nombre.
SEC_ERROR_SAFE_NOT_CREATED=error al crear un objeto seguro
SEC_ERROR_BAGGAGE_NOT_CREATED=error al crear un objeto de equipaje
XP_JAVA_REMOVE_PRINCIPAL_ERROR=No se pudo quitar lo principal
XP_JAVA_DELETE_PRIVILEGE_ERROR=No se pudo eliminar el privilegio
XP_JAVA_CERT_NOT_EXISTS_ERROR=Este principal no tiene certificado
SEC_ERROR_BAD_EXPORT_ALGORITHM=El algoritmo solicitado no est\u00e1 permitido.
SEC_ERROR_EXPORTING_CERTIFICATES=Error al intentar exportar certificados.
SEC_ERROR_IMPORTING_CERTIFICATES=Error al intentar importar certificados.
SEC_ERROR_PKCS12_DECODING_PFX=No se pudo importar. Error de decodificaci\u00f3n. Archivo no v\u00e1lido.
SEC_ERROR_PKCS12_INVALID_MAC=No se pudo importar. MAC no v\u00e1lida. Contrase\u00f1a incorrecta o archivo corrupto.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=No se pudo importar. Algoritmo de MAC no soportado.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=No se pudo importar. S\u00f3lo se soportan los modos de privacidad e integridad de contrase\u00f1a.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=No se pudo importar. La estructura del archivo est\u00e1 corrupta.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=No se pudo importar. El algoritmo de cifrado no est\u00e1 soportado.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=No se pudo importar. La versi\u00f3n del archivo no est\u00e1 soportada.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=No se pudo importar. Contrase\u00f1a de privacidad incorrecta.
SEC_ERROR_PKCS12_CERT_COLLISION=No se pudo importar. Ya existe el mismo nombre en la base de datos.
SEC_ERROR_USER_CANCELLED=El usuario presion\u00f3 "Cancelar".
SEC_ERROR_PKCS12_DUPLICATE_DATA=No importado, ya est\u00e1 en la base de datos.
SEC_ERROR_MESSAGE_SEND_ABORTED=Mensaje no enviado.
SEC_ERROR_INADEQUATE_KEY_USAGE=Uso inadecuado de clave de certificado para la operaci\u00f3n intentada.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tipo de certificado no aprobado para la aplicaci\u00f3n.
SEC_ERROR_CERT_ADDR_MISMATCH=La direcci\u00f3n en el certificado de firma no coincide con la direcci\u00f3n en los encabezados del mensaje.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=No se pudo importar. Error al intentar importar clave privada.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=No se pudo importar. Error al intentar importar cadena de certificado.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=No se pudo exportar. No se pudo localizar el certificado o la clave por nombre.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=No se pudo exportar. No se pudo localizar y exportar la clave privada.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=No se pudo exportar. No se pudo escribir el archivo a exportar.
SEC_ERROR_PKCS12_UNABLE_TO_READ=No se pudo importar. No se puedo leer el archivo a importar.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=No se pudo exportar. La base de datos de claves est\u00e1 corrupta o fue eliminada.
SEC_ERROR_KEYGEN_FAIL=No se pudo generar par de claves p\u00fablicas/privadas.
SEC_ERROR_INVALID_PASSWORD=La contrase\u00f1a ingresada no es v\u00e1lida. Por favor, eleg\u00ed una diferente.
SEC_ERROR_RETRY_OLD_PASSWORD=La contrase\u00f1a antigua se ingres\u00f3 incorrectamente. Por favor, prob\u00e1 de nuevo.
SEC_ERROR_BAD_NICKNAME=El nombre del certificado ya est\u00e1 en uso.
SEC_ERROR_NOT_FORTEZZA_ISSUER=La cadena de par FORTEZZA tiene un certificado no FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Una clave sensible no pudo ser movida a la ranura donde se necesitaba
SEC_ERROR_JS_INVALID_MODULE_NAME=Nombre de m\u00f3dulo no v\u00e1lido.
SEC_ERROR_JS_INVALID_DLL=M\u00f3dulo ruta/nombredearchivo no v\u00e1lido
SEC_ERROR_JS_ADD_MOD_FAILURE=No se pudo agregar m\u00f3dulo
SEC_ERROR_JS_DEL_MOD_FAILURE=No se pudo eliminar m\u00f3dulo
SEC_ERROR_OLD_KRL=El nuevo KRL no es m\u00e1s reciente que el actual.
SEC_ERROR_CKL_CONFLICT=El nuevo CKL tiene un diferente emisor que el actual. Elimin\u00e1 el actual.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=La autoridad de certificado para este certificado no est\u00e1 permitida de emitir un certificado con este nombre.
SEC_ERROR_KRL_NOT_YET_VALID=La lista de revocaci\u00f3n de clave para este certificado no es v\u00e1lida a\u00fan.
SEC_ERROR_CRL_NOT_YET_VALID=La lista de revocaci\u00f3n de certificado para este certificado no es v\u00e1lida a\u00fan.
SEC_ERROR_UNKNOWN_CERT=No se encontr\u00f3 el certificado solicitado.
SEC_ERROR_UNKNOWN_SIGNER=No se encontr\u00f3 el certificado del firmante.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=La ubicaci\u00f3n de para el servidor del estado de certificado tiene formato no v\u00e1lido.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=La respuesta OCSP no puede ser totalmente decodificada; es de un tipo desconocido.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=El servidor OCSP devolvi\u00f3 datos de HTTP no esperados / no v\u00e1lidos.
SEC_ERROR_OCSP_MALFORMED_REQUEST=El servidor OCSP encontr\u00f3 que la solicitud est\u00e1 corrupta o inapropiadamente formada.
SEC_ERROR_OCSP_SERVER_ERROR=El servidor OCSP experiment\u00f3 un error interno.
SEC_ERROR_OCSP_TRY_SERVER_LATER=El servidor OCSP sugiere probar de nuevo m\u00e1s tarde.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=El servidor OCSP solicita una firma en esta solicitud.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=El servidor OCSP rechaz\u00f3 esta solicitud como no autorizada.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=El servidor OCSP devolvi\u00f3 un estado no reconocible.
SEC_ERROR_OCSP_UNKNOWN_CERT=El servidor OCSP no tiene estado para el certificado.
SEC_ERROR_OCSP_NOT_ENABLED=Ten\u00e9s que habilitar OCSP antes de realizar esta operaci\u00f3n.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Ten\u00e9s que establecer el respondedor predeterminado de OCSP antes de realizar esta operaci\u00f3n.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=La respuesta del servidor OCSP fue corrupta o inapropiadamente formada.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=El firmante de la respuesta OCSP no est\u00e1 autorizada para dar estado de este certificado.
SEC_ERROR_OCSP_FUTURE_RESPONSE=La respuesta OCSP no es a\u00fan v\u00e1lida (contiene una fecha futura).
SEC_ERROR_OCSP_OLD_RESPONSE=La respuesta OCSP contiene informaci\u00f3n desactualizada.
SEC_ERROR_DIGEST_NOT_FOUND=No se encontr\u00f3 la asimilaci\u00f3n del CMS o PKCS \#7 en el mensaje firmado.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=El tipo de mensaje de CMS o PKCS \#7 no est\u00e1 soportado.
SEC_ERROR_MODULE_STUCK=No se pudo quitar el m\u00f3dulo PKCS \#11 porque todav\u00eda est\u00e1 en uso.
SEC_ERROR_BAD_TEMPLATE=No se pudo decodificar datos de ASN.1. La plantilla especificada no es v\u00e1lida.
SEC_ERROR_CRL_NOT_FOUND=No se encontr\u00f3 CRL coincidente.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Est\u00e1s intentando importar un certificado con el mismo emisor/serial de un certificado existente, pero no es el mismo certificado.
SEC_ERROR_BUSY=No se pudo cerrar NSS. Los objetos todav\u00eda est\u00e1n en uso.
SEC_ERROR_EXTRA_INPUT=El mensaje decodificado en DER conten\u00eda datos extras sin usar.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Curva el\u00edptica no soportada.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Forma de punto de curva el\u00edptica no soportada.
SEC_ERROR_UNRECOGNIZED_OID=Identificador de objeto no reconocido.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Certificado de firma de OCSP no v\u00e1lido en respuesta OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=El certificado es revocado en la lista de revocaci\u00f3n de certificado del emisor.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=El respondedor OCSP del emisor informa que el certificado es revocado.
SEC_ERROR_CRL_INVALID_VERSION=La lista de revocaci\u00f3n del certificado del emisor tiene un n\u00famero de versi\u00f3n desconocido.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=La lista de revocaci\u00f3n de certificado V1 del emisor tiene una extensi\u00f3n cr\u00edtica.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=La lista de revocaci\u00f3n de certificado V2 del emisor tiene una extensi\u00f3n cr\u00edtica.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Tipo de objeto desconocido especificado.
SEC_ERROR_INCOMPATIBLE_PKCS11=El controlador PKCS \#11 driver viola las especificaciones en un modo incompatible.
SEC_ERROR_NO_EVENT=No hay evento de nueva ranura disponible por ahora.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL ya existe.
SEC_ERROR_NOT_INITIALIZED=NSS no est\u00e1 inicializado.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=La operaci\u00f3n fall\u00f3 porque la ficha PKCS\#11 no inici\u00f3 sesi\u00f3n.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=El certificado del respondedor OCSP configurado no es v\u00e1lido.
SEC_ERROR_OCSP_BAD_SIGNATURE=La respuesta de OCSP tiene una firma no v\u00e1lida.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=La b\u00fasqueda de validaci\u00f3n de certificado est\u00e1 fuera de los l\u00edmites
SEC_ERROR_INVALID_POLICY_MAPPING=El mapeo de pol\u00edtica contiene "anypolicy"
SEC_ERROR_POLICY_VALIDATION_FAILED=La cadena de certificados falla en la validaci\u00f3n de pol\u00edticas
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Tipo de ubicaci\u00f3n desconocida en extensi\u00f3n de certificado AIA
SEC_ERROR_BAD_HTTP_RESPONSE=El servidor devolvi\u00f3 una respuesta HTTP mala
SEC_ERROR_BAD_LDAP_RESPONSE=El servidor devolvi\u00f3 una respuesta LDAP mala
SEC_ERROR_FAILED_TO_ENCODE_DATA=Fallo al codificar datos como ASN1
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Ubicaci\u00f3n de acceso de informaci\u00f3n mala en la extensi\u00f3n del certificado
SEC_ERROR_LIBPKIX_INTERNAL=Error interno en libpkix durante validaci\u00f3n de certificado.
SEC_ERROR_PKCS11_GENERAL_ERROR=Un m\u00f3dulo PKCS \#11 devolvi\u00f3 CKR_GENERAL_ERROR, indicando que ocurri\u00f3 un error irrecuperable.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Un m\u00f3dulo PKCS \#11 devolvi\u00f3 CKR_FUNCTION_FAILED, indicando que la funci\u00f3n solicitada no se pudo ejecutar. Probando la misma operaci\u00f3n de nuevo puede funcionar.
SEC_ERROR_PKCS11_DEVICE_ERROR=Un m\u00f3dulo PKCS \#11 devolvi\u00f3 CKR_DEVICE_ERROR, indicando que ocurri\u00f3 un problema con la ficha o ranura.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=M\u00e9todo de acceso a la informaci\u00f3n desconocido en extensi\u00f3n de certificado.
SEC_ERROR_CRL_IMPORT_FAILED=Error intentando importar un CRL.
SEC_ERROR_EXPIRED_PASSWORD=La contrase\u00f1a venci\u00f3.
SEC_ERROR_LOCKED_PASSWORD=La contrase\u00f1a est\u00e1 bloqueada.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Error PKCS \#11 desconocido.
SEC_ERROR_BAD_CRL_DP_URL=Direcci\u00f3n web no v\u00e1lida o no soportada en el nombre de punto de distribuci\u00f3n CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=El certificado fue firmado usando un algoritmo de firma que est\u00e1 deshabilitado porque no es seguro.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=El servidor usa clavado de clave (HPKP) pero no se pudo construir ninguna cadena de certificado de confianza que coincida con el conjunto de clavado. Las violaciones a los clavados de clave no se pueden reemplazar.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=El servidor usa un certificado con una extensi\u00f3n de restricciones b\u00e1sicas identific\u00e1ndola como una autoridad de certificado. Para un certificado emitido apropiadamente, este no deber\u00eda ser el caso.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=El servidor present\u00f3 un certificado con un tama\u00f1o de clave que es demasiado peque\u00f1o para establecer una conexi\u00f3n segura.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=Un certificado X.509 versi\u00f3n 1 que no es un ancla de confianza fue usado para emitir el certificado del servidor. Los certificados X.509 versi\u00f3n 1 son obsoletos y no deber\u00edan ser usados para firmar otros certificados.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=El servidor present\u00f3 un certificado que todav\u00eda no es v\u00e1lido.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=Un certificado que todav\u00eda no es v\u00e1lido fue usado para emitir el certificado del servidor.

