#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=La URL no es v\u00e1lida y no puede ser cargada.
fileNotFound=Pale Moon no puede encontrar el archivo en %S.
dnsNotFound=Pale Moon no puede encontrar el servidor en %S.
protocolNotFound=Pale Moon no sabe c\u00f3mo abrir esta direcci\u00f3n, porque el protocolo (%S) no est\u00e1 asociado con ninguna aplicaci\u00f3n.
connectionFailure=Pale Moon no puede establecer una conexi\u00f3n con el servidor en %S.
netInterrupt=La conexi\u00f3n a %S fue interrumpida mientras la p\u00e1gina se cargaba.
netTimeout=El servidor %S est\u00e1 tardando demasiado en responder.
redirectLoop=Pale Moon ha detectado que el servidor est\u00e1 redirigiendo la solicitud a esta direcci\u00f3n de una manera en la que nunca terminar\u00e1.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Para mostrar esta p\u00e1gina, %S necesita enviar informaci\u00f3n que repetir\u00e1 cualquier acci\u00f3n (como una b\u00fasqueda o una confirmaci\u00f3n de compra) realizada anteriormente.
resendButton.label=Reenviar
unknownSocketType=Pale Moon no sabe c\u00f3mo comunicarse con el servidor.
netReset=La conexi\u00f3n al servidor fue reiniciada mientras la p\u00e1gina se cargaba.
notCached=Este documento ya no est\u00e1 disponible.
netOffline=Pale Moon est\u00e1 actualmente en modo sin conexi\u00f3n y no puede navegar por la web.
isprinting=El documento no puede cambiar mientras se imprime o se abra su vista preliminar.
deniedPortAccess=Esta direcci\u00f3n usa un puerto de red que normalmente se utiliza con fines distintos a la navegaci\u00f3n web. Para su protecci\u00f3n, Pale Moon ha cancelado la petici\u00f3n.
proxyResolveFailure=Pale Moon est\u00e1 configurado para usar un servidor proxy que no puede ser localizado.
proxyConnectFailure=Pale Moon est\u00e1 configurado para usar un servidor proxy que est\u00e1 rechazando las conexiones.
contentEncodingError=La p\u00e1gina que est\u00e1 intentando visualizar no puede mostrarse porque utiliza un formato de compresi\u00f3n no v\u00e1lido o no admitido.
unsafeContentType=La p\u00e1gina que est\u00e1 intentando ver no puede ser mostrada porque est\u00e1 contenida en un tipo de archivo que puede no ser seguro al abrise. Por favor, contacte con los due\u00f1os para informarles de este problema.
externalProtocolTitle=Solicitud de protocolo externo
externalProtocolPrompt=Se debe ejecutar una aplicaci\u00f3n externa para manejar enlaces %1$S\:.\n\n\nEnlace solicitado\:\n\n%2$S\n\nAplicaci\u00f3n\: %3$S\n\n\nSi no esperaba esta solicitud, es posible que sea un intento de explotar una vulnerabilidad en ese otro programa. Cancele esta solicitud a menos que est\u00e9 seguro de que no es maliciosa.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Desconocido>
externalProtocolChkMsg=Recordar mi elecci\u00f3n para todos los enlaces de este tipo.
externalProtocolLaunchBtn=Ejecutar aplicaci\u00f3n
malwareBlocked=El sitio en %S ha sido identificado como un sitio atacante y ha sido bloqueado bas\u00e1ndose en sus preferencias de seguridad.
phishingBlocked=El sitio web en %S ha sido identificado como una copia fraudulenta que ha sido dise\u00f1ada para enga\u00f1ar a los usuarios para introducir informaci\u00f3n personal o bancaria.
cspFrameAncestorBlocked=Esta p\u00e1gina tiene una pol\u00edtica de seguridad de contenido que impide que pueda ser incrustado de esta forma.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=La p\u00e1gina que est\u00e1 intentando ver no puede ser mostrada porque se detect\u00f3 un error en la transmisi\u00f3n de los datos.
remoteXUL=Esta p\u00e1gina usa una tecnolog\u00eda no admitida que ya no est\u00e1 disponible por defecto en Pale Moon.

