#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2,\u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c86\u0c95\u0cb0 \u0c95\u0ca1\u0ca4\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0c93\u0ca6\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2.\n\n\u0cb8\u0ccd\u0cb5\u0cb2\u0ccd\u0caa \u0cb8\u0cae\u0caf\u0ca6 \u0ca8\u0c82\u0ca4\u0cb0 \u0cae\u0cb0\u0cb3\u0cbf \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cc1, \u0c85\u0ca5\u0cb5 \u0caa\u0cb0\u0cbf\u0c9a\u0cbe\u0cb0\u0c95 \u0cb5\u0ccd\u0caf\u0cb5\u0cb8\u0ccd\u0ca5\u0cbe\u0caa\u0c95\u0ca8\u0ca8\u0ccd\u0ca8\u0cc1 \u0cae\u0cb0\u0cb3\u0cbf \u0cb8\u0c82\u0caa\u0cb0\u0ccd\u0c95\u0cbf\u0cb8\u0cc1.
writeError=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2, \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c92\u0c82\u0ca6\u0cc1 \u0c85\u0c9c\u0ccd\u0c9e\u0cbe\u0ca4 \u0ca6\u0ccb\u0cb7 \u0c95\u0c82\u0ca1\u0cc1\u0cac\u0c82\u0ca6\u0cbf\u0ca6\u0cc6.\n\n\u0cac\u0cc7\u0cb0\u0cca\u0c82\u0ca6\u0cc1 \u0cb8\u0ccd\u0ca5\u0cb3\u0c95\u0ccd\u0c95\u0cc6 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cc1.
launchError=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0cc6\u0cb0\u0cc6\u0caf\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2, \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c92\u0c82\u0ca6\u0cc1 \u0c85\u0c9c\u0ccd\u0c9e\u0cbe\u0ca4 \u0ca6\u0ccb\u0cb7 \u0c95\u0c82\u0ca1\u0cc1\u0cac\u0c82\u0ca6\u0cbf\u0ca6\u0cc6.\n\n\u0cae\u0cca\u0ca6\u0cb2\u0cc1 \u0ca1\u0cbf\u0cb8\u0ccd\u0c95\u0ccd\u200d\u0c97\u0cc6 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf \u0cb9\u0cbe\u0c97\u0cc1 \u0ca8\u0c82\u0ca4\u0cb0 \u0c95\u0ca1\u0ca4\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca4\u0cc6\u0cb0\u0cc6\u0caf\u0cbf\u0cb0\u0cbf.
diskFull=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0ca1\u0cbf\u0cb8\u0ccd\u0c95\u0ccd\u200d\u0ca8\u0cb2\u0ccd\u0cb2\u0cbf \u0cb8\u0cbe\u0c95\u0cb7\u0ccd\u0c9f\u0cc1 \u0cb8\u0ccd\u0ca5\u0cb3\u0cbe\u0cb5\u0c95\u0cbe\u0cb6\u0cb5\u0cbf\u0cb2\u0ccd\u0cb2.\n\n\u0c85\u0ca8\u0c97\u0ca4\u0ccd\u0caf \u0c95\u0ca1\u0ca4\u0c97\u0cb3\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca1\u0cbf\u0cb8\u0ccd\u0c95\u0ccd\u200d\u0ca8\u0cbf\u0c82\u0ca6 \u0ca4\u0cc6\u0c97\u0cc6\u0ca6\u0cc1 \u0cb9\u0cbe\u0c95\u0cbf \u0ca8\u0c82\u0ca4\u0cb0 \u0cae\u0cb0\u0cb3\u0cbf \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf,\u0c85\u0ca5\u0cb5 \u0cac\u0cc7\u0cb0\u0cca\u0c82\u0ca6\u0cc1 \u0cb8\u0ccd\u0ca5\u0cb3\u0c95\u0ccd\u0c95\u0cc6 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf.
readOnly=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2, \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0ca1\u0cbf\u0cb8\u0ccd\u0c95\u0ccd\u200d, \u0c95\u0ca1\u0ca4\u0c95\u0ccb\u0cb6, \u0c85\u0ca5\u0cb5 \u0c95\u0ca1\u0ca4\u0cb5\u0cc1 \u0cac\u0cb0\u0cc6\u0caf\u0ca6\u0c82\u0ca4\u0cc6 \u0ca8\u0cbf\u0cb0\u0ccd\u0cac\u0c82\u0ca7\u0cbf\u0cb8\u0cb2\u0ccd\u0caa\u0c9f\u0ccd\u0c9f\u0cbf\u0ca6\u0cc6 .\n\n\u0cac\u0cb0\u0cc6\u0caf\u0cb2\u0cc1 \u0cb6\u0c95\u0ccd\u0ca4\u0c97\u0cca\u0cb3\u0cbf\u0cb8\u0cbf \u0cb9\u0cbe\u0c97\u0cc1 \u0cae\u0cb0\u0cb3\u0cbf \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf, \u0c85\u0ca5\u0cb5 \u0cac\u0cc7\u0cb0\u0cca\u0c82\u0ca6\u0cc1 \u0cb8\u0ccd\u0ca5\u0cb3\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf.
accessError=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2, \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c95\u0ca1\u0ca4\u0c95\u0ccb\u0cb6\u0ca6 \u0cb5\u0cbf\u0cb7\u0caf\u0c97\u0cb3\u0ca8\u0ccd\u0ca8\u0cc1  \u0ca8\u0cc0\u0cb5\u0cc1 \u0cac\u0ca6\u0cb2\u0cbe\u0caf\u0cbf\u0cb8\u0cc1\u0cb5\u0c82\u0ca4\u0cbf\u0cb2\u0ccd\u0cb2.\n\n\u0c95\u0ca1\u0ca4\u0c95\u0ccb\u0cb6\u0ca6 \u0c97\u0cc1\u0ca3\u0cb2\u0c95\u0ccd\u0cb7\u0ca3\u0c97\u0cb3\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0ca6\u0cb2\u0cbe\u0caf\u0cbf\u0cb8\u0cbf \u0cb9\u0cbe\u0c97\u0cc1 \u0cae\u0cb0\u0cb3\u0cbf \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf, \u0c85\u0ca5\u0cb5 \u0cac\u0cc7\u0cb0\u0cca\u0c82\u0ca6\u0cc1 \u0cb8\u0ccd\u0ca5\u0cb3\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2, \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0cb8\u0cb9\u0cb5\u0cb0\u0ccd\u0ca4\u0cbf \u0cb8\u0cb9\u0cbe\u0caf\u0c95 \u0c85\u0ca8\u0ccd\u0cb5\u0caf\u0cb5\u0cc1 \u0c85\u0cb8\u0ccd\u0ca4\u0cbf\u0ca4\u0ccd\u0cb5\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf. \u0ca8\u0cbf\u0cae\u0ccd\u0cae \u0c86\u0ca6\u0ccd\u0caf\u0ca4\u0cc6\u0caf\u0cb2\u0ccd\u0cb2\u0cbf\u0ca8 \u0cb8\u0cb9\u0cb5\u0cb0\u0ccd\u0ca4\u0cbf\u0caf\u0ca8\u0ccd\u0ca8\u0cc1 \u0cac\u0ca6\u0cb2\u0cbe\u0caf\u0cbf\u0cb8\u0cbf.
noMemory=\u0ca8\u0cc0\u0cb5\u0cc1 \u0cae\u0ca8\u0cb5\u0cbf \u0cb8\u0cb2\u0ccd\u0cb2\u0cbf\u0cb8\u0cbf\u0ca6 \u0c95\u0cbe\u0cb0\u0ccd\u0caf\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca8\u0cc6\u0cb0\u0cb5\u0cc7\u0cb0\u0cbf\u0cb8\u0cb2\u0cc1 \u0cb8\u0cbe\u0c95\u0cb7\u0ccd\u0c9f\u0cc1 \u0cae\u0cc6\u0cae\u0cca\u0cb0\u0cbf\u0caf\u0cc1 \u0cb2\u0cad\u0ccd\u0caf\u0cb5\u0cbf\u0cb2\u0ccd\u0cb2.\n\n\u0c95\u0cc6\u0cb2\u0cb5\u0cca\u0c82\u0ca6\u0cc1 \u0c85\u0ca8\u0ccd\u0cb5\u0caf\u0cb5\u0ca8\u0ccd\u0ca8\u0cc1  \u0ca4\u0ccd\u0caf\u0c9c\u0cbf\u0cb8\u0cbf \u0ca8\u0c82\u0ca4\u0cb0 \u0cae\u0cb0\u0cb3\u0cbf \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf.
title=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0ca1\u0ccc\u0ca8\u0ccd\u200d\u0cb2\u0ccb\u0ca1\u0ccd\u200d \u0cae\u0cbe\u0ca1\u0cb2\u0cbe\u0c97\u0cc1\u0ca4\u0ccd\u0ca4\u0cbf\u0ca6\u0cc6
fileAlreadyExistsError=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2, \u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 '_\u0c95\u0ca1\u0ca4\u0c97\u0cb3\u0cc1' \u0c95\u0ccb\u0cb6\u0ca6 \u0cb9\u0cc6\u0cb8\u0cb0\u0cbf\u0ca8 \u0c92\u0c82\u0ca6\u0cc1 \u0c95\u0ca1\u0ca4\u0cb5\u0cc1 \u0c88\u0c97\u0cbe\u0c97\u0cb2\u0cc6 \u0c85\u0cb8\u0ccd\u0ca4\u0cbf\u0ca4\u0ccd\u0cb5\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf .\n\n\u0c85\u0ca5\u0cb5 \u0cac\u0cc7\u0cb0\u0cca\u0c82\u0ca6\u0cc1 \u0cb8\u0ccd\u0ca5\u0cb3\u0ca6\u0cb2\u0ccd\u0cb2\u0cbf \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cc1 \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf.
fileNameTooLongError=%S \u0c85\u0ca8\u0ccd\u0ca8\u0cc1 \u0c89\u0cb3\u0cbf\u0cb8\u0cb2\u0cbe\u0c97\u0cbf\u0cb2\u0ccd\u0cb2,\u0c8f\u0c95\u0cc6\u0c82\u0ca6\u0cb0\u0cc6 \u0c95\u0ca1\u0ca4\u0ca6 \u0cb9\u0cc6\u0cb8\u0cb0\u0cc1 \u0cac\u0cb9\u0cb3 \u0c89\u0ca6\u0ccd\u0ca6\u0cb5\u0cbe\u0c97\u0cbf\u0ca6\u0cc6.\n\n\u0c92\u0c82\u0ca6\u0cc1 \u0c9a\u0cbf\u0c95\u0ccd\u0c95 \u0c95\u0ca1\u0ca4 \u0cb9\u0cc6\u0cb8\u0cb0\u0cbf\u0ca8 \u0cae\u0cc2\u0cb2\u0c95 \u0cae\u0cb0\u0cb3\u0cbf \u0caa\u0ccd\u0cb0\u0caf\u0ca4\u0ccd\u0ca8\u0cbf\u0cb8\u0cbf.

