#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Nem lehet biztons\u00e1gosan kommunik\u00e1lni. A partner nem t\u00e1mogatja a magas szint\u0171 titkos\u00edt\u00e1st.
SSL_ERROR_US_ONLY_SERVER=Nem lehet biztons\u00e1gosan kommunik\u00e1lni. A partner olyan magas szint\u0171 titkos\u00edt\u00e1st k\u00edv\u00e1n meg, amely nincs t\u00e1mogatva.
SSL_ERROR_NO_CYPHER_OVERLAP=Nem lehet biztons\u00e1gosan kommunik\u00e1lni a partnerrel\: nincs k\u00f6z\u00f6s titkos\u00edt\u00f3 algoritmus.
SSL_ERROR_NO_CERTIFICATE=Nem tal\u00e1lhat\u00f3 a hiteles\u00edt\u00e9shez sz\u00fcks\u00e9ges tan\u00fas\u00edtv\u00e1ny vagy kulcs.
SSL_ERROR_BAD_CERTIFICATE=Nem lehet biztons\u00e1gosan kommunik\u00e1lni a partnerrel\: a partner tan\u00fas\u00edtv\u00e1nya vissza lett utas\u00edtva.
SSL_ERROR_UNUSED_5=Ismeretlen SSL hibak\u00f3d.
SSL_ERROR_BAD_CLIENT=A kiszolg\u00e1l\u00f3 rossz adatokat kapott az \u00fcgyf\u00e9lt\u0151l.
SSL_ERROR_BAD_SERVER=Az \u00fcgyf\u00e9l rossz adatokat kapott a kiszolg\u00e1l\u00f3t\u00f3l.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Nem t\u00e1mogatott tan\u00fas\u00edtv\u00e1nyt\u00edpus.
SSL_ERROR_UNSUPPORTED_VERSION=A partner a biztons\u00e1gi protokoll nem t\u00e1mogatott verzi\u00f3j\u00e1t haszn\u00e1lja.
SSL_ERROR_UNUSED_10=Ismeretlen SSL hibak\u00f3d.
SSL_ERROR_WRONG_CERTIFICATE=Az \u00fcgyf\u00e9l hiteles\u00edt\u00e9se sikertelen\: a kulcsadatb\u00e1zisban lev\u0151 priv\u00e1t kulcs nem illik a tan\u00fas\u00edtv\u00e1ny-adatb\u00e1zisban lev\u0151 nyilv\u00e1nos kulcshoz.
SSL_ERROR_BAD_CERT_DOMAIN=Nem lehet biztons\u00e1gosan kommunik\u00e1lni a partnerrel\: a k\u00e9rt tartom\u00e1nyn\u00e9v nem egyezik a kiszolg\u00e1l\u00f3 tan\u00fas\u00edtv\u00e1ny\u00e1ban lev\u0151vel.
SSL_ERROR_POST_WARNING=Ismeretlen SSL hibak\u00f3d.
SSL_ERROR_SSL2_DISABLED=A partnert csak az SSL 2-es verzi\u00f3j\u00e1t t\u00e1mogatja, ami helyileg le van tiltva.
SSL_ERROR_BAD_MAC_READ=Az SSL egy helytelen \u00fczenethiteles\u00edt\u0151 k\u00f3ddal rendelkez\u0151 rekordot kapott.
SSL_ERROR_BAD_MAC_ALERT=Az SSL-partner helytelen \u00fczenetazonos\u00edt\u00f3 k\u00f3dot jelentett.
SSL_ERROR_BAD_CERT_ALERT=Az SSL-partner nem tudja ellen\u0151rizni a tan\u00fas\u00edtv\u00e1ny\u00e1t.
SSL_ERROR_REVOKED_CERT_ALERT=Az SSL-partner visszautas\u00edtotta a tan\u00fas\u00edtv\u00e1ny\u00e1t, mert szerinte az vissza lett vonva.
SSL_ERROR_EXPIRED_CERT_ALERT=Az SSL-partner visszautas\u00edtotta a tan\u00fas\u00edtv\u00e1ny\u00e1t, mert szerinte az lej\u00e1rt.
SSL_ERROR_SSL_DISABLED=Nem lehet kapcsol\u00f3dni\: az SSL le van tiltva.
SSL_ERROR_FORTEZZA_PQG=Nem lehet kapcsol\u00f3dni\: az SSL egy m\u00e1sik FORTEZZA-tartom\u00e1nyban van.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Ismeretlen SSL-k\u00f3dol\u00f3k\u00e9szlet lett k\u00e9rve.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Ebben a programban egyetlen k\u00f3dol\u00f3k\u00e9szlet sincs jelen \u00e9s enged\u00e9lyezve.
SSL_ERROR_BAD_BLOCK_PADDING=Az SSL egy rossz blokkfelt\u00f6lt\u00e9ssel rendelkez\u0151 rekordot kapott.
SSL_ERROR_RX_RECORD_TOO_LONG=Az SSL a maxim\u00e1lisan megengedhet\u0151 hossz\u00fas\u00e1got meghalad\u00f3 rekordot kapott.
SSL_ERROR_TX_RECORD_TOO_LONG=Az SSL a maxim\u00e1lisan megengedhet\u0151 hossz\u00fas\u00e1got meghalad\u00f3 rekordot pr\u00f3b\u00e1lt k\u00fcldeni.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=Az SSL egy rosszul form\u00e1zott Hello Request k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=Az SSL egy rosszul form\u00e1zott Client Hello k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=Az SSL egy rosszul form\u00e1zott Server Hello k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=Az SSL egy rosszul form\u00e1zott Certificate k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=Az SSL egy rosszul form\u00e1zott Server Key Exchange k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=Az SSL egy rosszul form\u00e1zott Certificate Request k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=Az SSL egy rosszul form\u00e1zott Server Hello Done k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=Az SSL egy rosszul form\u00e1zott Certificate Verify k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=Az SSL egy rosszul form\u00e1zott Client Key Exchange k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_FINISHED=Az SSL egy rosszul form\u00e1zott Finished k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=Az SSL egy rosszul form\u00e1zott Change Cipher Spec rekordot kapott.
SSL_ERROR_RX_MALFORMED_ALERT=Az SSL egy rosszul form\u00e1zott Alert rekordot kapott.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=Az SSL egy rosszul form\u00e1zott Handshake rekordot kapott.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=Az SSL egy rosszul form\u00e1zott Application Data rekordot kapott.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=Az SSL egy v\u00e1ratlan Hello Request k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=Az SSL egy v\u00e1ratlan Client Hello k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=Az SSL egy v\u00e1ratlan Server Hello k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=Az SSL egy v\u00e1ratlan Certificate k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=Az SSL egy v\u00e1ratlan Server Key Exchange k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=Az SSL egy v\u00e1ratlan Certificate Request k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=Az SSL egy v\u00e1ratlan Server Hello Done k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=Az SSL egy v\u00e1ratlan Certificate Verify k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=Az SSL egy v\u00e1ratlan Client Key Exchange k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_FINISHED=Az SSL egy v\u00e1ratlan Finished k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=Az SSL egy v\u00e1ratlan Change Cipher Spec rekordot kapott.
SSL_ERROR_RX_UNEXPECTED_ALERT=Az SSL egy v\u00e1ratlan Alert rekordot kapott.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=Az SSL egy v\u00e1ratlan Handshake rekordot kapott.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=Az SSL egy v\u00e1ratlan Application Data rekordot kapott.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=Az SSL ismeretlen tartalomt\u00edpussal rendelkez\u0151 rekordot kapott.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=Az SSL ismeretlen \u00fczenett\u00edpussal rendelkez\u0151 k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_UNKNOWN_ALERT=Az SSL ismeretlen riaszt\u00e1si le\u00edr\u00e1ssal rendelkez\u0151 riaszt\u00e1si rekordot kapott.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Az SSL-partner lez\u00e1rta a kapcsolatot.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Az SSL-partner nem v\u00e1rta a kapott k\u00e9zfog\u00e1si \u00fczenetet.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=Az SSL-partner nem tudta kit\u00f6m\u00f6r\u00edteni a kapott SSL-rekordot.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=Az SSL-partnerrel nem lehetett megt\u00e1rgyalni a biztons\u00e1gi param\u00e9terek elfogadhat\u00f3 be\u00e1ll\u00edt\u00e1sait.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Az SSL-partner visszautas\u00edtotta az elfogadhatatlan tartalom k\u00e9zfog\u00e1si \u00fczenet\u00e9t.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Az SSL-partner nem t\u00e1mogatja a kapott tan\u00fas\u00edtv\u00e1nyt\u00edpust.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Az SSL-partnernek meg nem hat\u00e1rozott probl\u00e9m\u00e1ja volt a kapott tan\u00fas\u00edtv\u00e1nnyal.
SSL_ERROR_GENERATE_RANDOM_FAILURE=Az SSL hib\u00e1t \u00e9szlelt a v\u00e9letlensz\u00e1m-gener\u00e1tor\u00e1ban.
SSL_ERROR_SIGN_HASHES_FAILURE=Nem siker\u00fclt digit\u00e1lisan al\u00e1\u00edrni az \u00d6n tan\u00fas\u00edtv\u00e1ny\u00e1nak ellen\u0151rz\u00e9s\u00e9hez sz\u00fcks\u00e9ges adatokat.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=Az SSL nem tudta kicsomagolni a nyilv\u00e1nos kulcsot a partner tan\u00fas\u00edtv\u00e1ny\u00e1b\u00f3l.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Nem meghat\u00e1rozott hiba az SSL-kiszolg\u00e1l\u00f3kulcscsere k\u00e9zfog\u00e1s k\u00f6zben.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Nem meghat\u00e1rozott hiba az SSL-\u00fcgyf\u00e9lkulcscsere k\u00e9zfog\u00e1s k\u00f6zben.
SSL_ERROR_ENCRYPTION_FAILURE=Az adatcsomag titkos\u00edt\u00e1si algoritmusa sikertelen a kijel\u00f6lt titkos\u00edt\u00f3eszk\u00f6z\u00f6n.
SSL_ERROR_DECRYPTION_FAILURE=Az adatcsomag visszafejt\u00e9si algoritmusa sikertelen a kijel\u00f6lt titkos\u00edt\u00f3eszk\u00f6z\u00f6n.
SSL_ERROR_SOCKET_WRITE_FAILURE=A k\u00eds\u00e9rlet a titkos\u00edtott adatok az als\u00f3bb szinten lev\u0151 szoftvercsatorn\u00e1ra val\u00f3 ki\u00edr\u00e1s\u00e1ra sikertelen volt.
SSL_ERROR_MD5_DIGEST_FAILURE=Az MD5 digest f\u00fcggv\u00e9ny sikertelen.
SSL_ERROR_SHA_DIGEST_FAILURE=Az SHA-1 digest f\u00fcggv\u00e9ny sikertelen.
SSL_ERROR_MAC_COMPUTATION_FAILURE=A MAC kisz\u00e1m\u00edt\u00e1sa sikertelen.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=A szimmetrikus kulcs kontextus l\u00e9trehoz\u00e1sa sikertelen.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Nem siker\u00fclt kicsomagolni a szimmetrikus kulcsot az \u00fcgyf\u00e9lkulcscsere \u00fczenetben.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Az SSL-kiszolg\u00e1l\u00f3 belf\u00f6ldi szint\u0171 nyilv\u00e1nos kulcsot pr\u00f3b\u00e1lt meg haszn\u00e1lni exportra sz\u00e1nt titkos\u00edt\u00f3k\u00e9szlettel.
SSL_ERROR_IV_PARAM_FAILURE=A PKCS11-k\u00f3d nem tudott egy IV-t param\u00e9terr\u00e9 ford\u00edtani.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Nem siker\u00fclt inicializ\u00e1lni a kijel\u00f6lt titkos\u00edt\u00f3k\u00e9szletet.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Az \u00fcgyf\u00e9l nem tudott munkamenetkulcsokat gener\u00e1lni az SSL-munkamenethez.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=A kiszolg\u00e1l\u00f3nak nincs kulcs a megk\u00eds\u00e9relt kulcscser\u00e9l\u0151 algoritmushoz.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=PKCS\#11 token lett besz\u00farva vagy elt\u00e1vol\u00edtva m\u0171velet k\u00f6zben.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Nem tal\u00e1lhat\u00f3 PKCS\#11 token a k\u00edv\u00e1nt m\u0171velet elv\u00e9gz\u00e9s\u00e9re.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Nem lehet biztons\u00e1gosan kommunik\u00e1lni a partnerrel\: nincs k\u00f6z\u00f6s t\u00f6m\u00f6r\u00edt\u0151 algoritmus.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Nem lehet egy m\u00e1sik SSL-k\u00e9zfog\u00e1st kezdem\u00e9nyezni, am\u00edg az aktu\u00e1lis k\u00e9zfog\u00e1s nem fejez\u0151dik be.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Helytelen k\u00e9zfog\u00e1si hash-\u00e9rt\u00e9kek \u00e9rkeztek a partnert\u0151l.
SSL_ERROR_CERT_KEA_MISMATCH=A rendelkez\u00e9sre \u00e1ll\u00f3 tan\u00fas\u00edtv\u00e1ny nem haszn\u00e1lhat\u00f3 a kiv\u00e1lasztott kulcskicser\u00e9l\u0151 algoritmussal.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Nincs az SSL-\u00fcgyf\u00e9l hiteles\u00edt\u00e9s\u00e9re megb\u00edzhat\u00f3 hiteles\u00edt\u00e9sszolg\u00e1ltat\u00f3.
SSL_ERROR_SESSION_NOT_FOUND=Az \u00fcgyf\u00e9l SSL-munkamenet-azonos\u00edt\u00f3ja nem tal\u00e1lhat\u00f3 a kiszolg\u00e1l\u00f3 munkamenet-gyors\u00edt\u00f3t\u00e1r\u00e1ban.
SSL_ERROR_DECRYPTION_FAILED_ALERT=A partner nem tudta visszafejteni a kapott SSL-rekordot.
SSL_ERROR_RECORD_OVERFLOW_ALERT=A partner az enged\u00e9lyezettn\u00e9l hosszabb SSL-rekordot kapott.
SSL_ERROR_UNKNOWN_CA_ALERT=A partner nem b\u00edzik meg a hiteles\u00edt\u00e9sszolg\u00e1ltat\u00f3ban, amely az \u00d6n tan\u00fas\u00edtv\u00e1ny\u00e1t kiadta.
SSL_ERROR_ACCESS_DENIED_ALERT=A partner \u00e9rv\u00e9nyes tan\u00fas\u00edtv\u00e1nyt kapott, de a hozz\u00e1f\u00e9r\u00e9s meg lett tagadva.
SSL_ERROR_DECODE_ERROR_ALERT=A partner nem tudott dek\u00f3dolni egy SSL-k\u00e9zfog\u00e1si \u00fczenetet.
SSL_ERROR_DECRYPT_ERROR_ALERT=A partner al\u00e1\u00edr\u00e1s-ellen\u0151rz\u00e9si vagy kulcskicser\u00e9l\u00e9si hib\u00e1t jelez.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=A partner azt jelzi, hogy a t\u00e1rgyal\u00e1s nem felel meg az exportkorl\u00e1toz\u00e1si el\u0151\u00edr\u00e1soknak.
SSL_ERROR_PROTOCOL_VERSION_ALERT=A partner nem kompatibilis vagy nem t\u00e1mogatott verzi\u00f3t jelez.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=A kiszolg\u00e1l\u00f3 \u00e1ltal megk\u00f6vetelt titkos\u00edt\u00f3k biztons\u00e1gosabbak, mint amiket az \u00fcgyf\u00e9l t\u00e1mogat.
SSL_ERROR_INTERNAL_ERROR_ALERT=A partner saj\u00e1t bels\u0151 hib\u00e1t jelet.
SSL_ERROR_USER_CANCELED_ALERT=A partner megszak\u00edtotta a k\u00e9zfog\u00e1st.
SSL_ERROR_NO_RENEGOTIATION_ALERT=A partner nem engedi az SSL biztons\u00e1gi param\u00e9tereinek \u00fajrat\u00e1rgyal\u00e1s\u00e1t.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Az SSL kiszolg\u00e1l\u00f3i gyors\u00edt\u00f3t\u00e1r nincs konfigur\u00e1lva, \u00e9s nincs letiltva  sockethez.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Az SSL-partner nem t\u00e1mogatja a k\u00e9rt TLS hello kiterjeszt\u00e9st.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Az SSL-partner nem tudja let\u00f6lteni az \u00d6n tan\u00fas\u00edtv\u00e1ny\u00e1t a megadott URL-r\u0151l.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Az SSL-partnernek nincs tan\u00fas\u00edtv\u00e1nya a k\u00e9rt DNS-n\u00e9vhez.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Az SSL-patner nem kapott OCSP-v\u00e1laszt a tan\u00fas\u00edtv\u00e1ny\u00e1ra.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Az SSL-partner rossz hash-\u00e9rt\u00e9ket jelzett a tan\u00fas\u00edtv\u00e1nyhoz.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=Az SSL egy v\u00e1ratlan New Session Ticket k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=Az SSL egy rosszul form\u00e1zott New Session Ticket k\u00e9zfog\u00e1si \u00fczenetet kapott.
SSL_ERROR_DECOMPRESSION_FAILURE=Az SSL egy t\u00f6m\u00f6r\u00edtett rekordot kapott, amit nem siker\u00fclt kicsomagolni.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Az \u00fajrat\u00e1rgyal\u00e1s nem enged\u00e9lyezett ezen az SSL socketen.
SSL_ERROR_UNSAFE_NEGOTIATION=A partner r\u00e9gi st\u00edlus\u00fa (potenci\u00e1lisan sebezhet\u0151) k\u00e9zfog\u00e1ssal pr\u00f3b\u00e1lkozott.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=Az SSL egy v\u00e1ratlan t\u00f6m\u00f6r\u00edtetlen rekordot kapott.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=Az SSL egy gyenge efemer\u00e1lis Diffie-Hellman-kulcsot kapott a Server Key Exchange k\u00e9zfog\u00e1si \u00fczenetben.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=Az SSL \u00e9rv\u00e9nytelen NPN kiterjeszt\u00e9sadatokat kapott.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Az SSL szolg\u00e1ltat\u00e1s nem t\u00e1mogatott SSL 2.0 kapcsolatokhoz.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Az SSL szolg\u00e1ltat\u00e1s nem t\u00e1mogatott kiszolg\u00e1l\u00f3khoz.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Az SSL szolg\u00e1ltat\u00e1s nem t\u00e1mogatott kliensekhez.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=I/O hiba t\u00f6rt\u00e9nt a biztons\u00e1gi hiteles\u00edt\u00e9s k\u00f6zben.
SEC_ERROR_LIBRARY_FAILURE=biztons\u00e1gi k\u00f6nyvt\u00e1r hib\u00e1ja.
SEC_ERROR_BAD_DATA=biztons\u00e1gi k\u00f6nyvt\u00e1r\: rossz adatok \u00e9rkeztek.
SEC_ERROR_OUTPUT_LEN=biztons\u00e1gi k\u00f6nyvt\u00e1r\: kimeneti hossz hiba.
SEC_ERROR_INPUT_LEN=biztons\u00e1gi k\u00f6nyvt\u00e1r bemeneti hossz hib\u00e1t \u00e9szlelt.
SEC_ERROR_INVALID_ARGS=biztons\u00e1gi k\u00f6nyvt\u00e1r\: \u00e9rv\u00e9nytelen argumentumok.
SEC_ERROR_INVALID_ALGORITHM=biztons\u00e1gi k\u00f6nyvt\u00e1r\: \u00e9rv\u00e9nytelen algoritmus.
SEC_ERROR_INVALID_AVA=biztons\u00e1gi k\u00f6nyvt\u00e1r\: \u00e9rv\u00e9nytelen AVA.
SEC_ERROR_INVALID_TIME=Helytelen\u00fcl form\u00e1zott id\u0151karakterl\u00e1nc.
SEC_ERROR_BAD_DER=biztons\u00e1gi k\u00f6nyvt\u00e1r\: helytelen\u00fcl form\u00e1zott DER-k\u00f3dolt \u00fczenet.
SEC_ERROR_BAD_SIGNATURE=A partner tan\u00fas\u00edtv\u00e1ny\u00e1nak al\u00e1\u00edr\u00e1sa \u00e9rv\u00e9nytelen.
SEC_ERROR_EXPIRED_CERTIFICATE=A partner tan\u00fas\u00edtv\u00e1nya lej\u00e1rt.
SEC_ERROR_REVOKED_CERTIFICATE=A partner tan\u00fas\u00edtv\u00e1ny\u00e1t visszavont\u00e1k.
SEC_ERROR_UNKNOWN_ISSUER=A partner tan\u00fas\u00edtv\u00e1ny\u00e1nak kiad\u00f3ja nem elismert.
SEC_ERROR_BAD_KEY=A partner nyilv\u00e1nos kulcsa \u00e9rv\u00e9nytelen.
SEC_ERROR_BAD_PASSWORD=A be\u00edrt biztons\u00e1gi jelsz\u00f3 helytelen.
SEC_ERROR_RETRY_PASSWORD=Az \u00faj jelsz\u00f3t helytelen\u00fcl \u00edrta be. Pr\u00f3b\u00e1lja \u00fajra.
SEC_ERROR_NO_NODELOCK=biztons\u00e1gi k\u00f6nyvt\u00e1r\: nincs nodelock.
SEC_ERROR_BAD_DATABASE=biztons\u00e1gi k\u00f6nyvt\u00e1r\: rossz adatb\u00e1zis.
SEC_ERROR_NO_MEMORY=biztons\u00e1gi k\u00f6nyvt\u00e1r\: mem\u00f3riaallok\u00e1ci\u00f3s hiba.
SEC_ERROR_UNTRUSTED_ISSUER=A partner tan\u00fas\u00edtv\u00e1ny\u00e1nak kiad\u00f3ja nem megb\u00edzhat\u00f3nak van jel\u00f6lve a felhaszn\u00e1l\u00f3n\u00e1l.
SEC_ERROR_UNTRUSTED_CERT=A partner tan\u00fas\u00edtv\u00e1nya nem megb\u00edzhat\u00f3nak van jel\u00f6lve a felhaszn\u00e1l\u00f3n\u00e1l.
SEC_ERROR_DUPLICATE_CERT=A tan\u00fas\u00edtv\u00e1ny m\u00e1r szerepel az adatb\u00e1zisban.
SEC_ERROR_DUPLICATE_CERT_NAME=A let\u00f6lt\u00f6tt tan\u00fas\u00edtv\u00e1ny neve egyezik egy adatb\u00e1zisban lev\u0151\u00e9vel.
SEC_ERROR_ADDING_CERT=Hiba a tan\u00fas\u00edtv\u00e1ny adatb\u00e1zishoz ad\u00e1sa sor\u00e1n.
SEC_ERROR_FILING_KEY=Hiba a kulcs tan\u00fas\u00edtv\u00e1nyhoz val\u00f3 \u00fajrat\u00e1rol\u00e1sakor.
SEC_ERROR_NO_KEY=Az ehhez a tan\u00fas\u00edtv\u00e1nyhoz tartoz\u00f3 szem\u00e9lyes kulcs nem tal\u00e1lhat\u00f3 a kulcsadatb\u00e1zisban.
SEC_ERROR_CERT_VALID=Ez a tan\u00fas\u00edtv\u00e1ny \u00e9rv\u00e9nyes.
SEC_ERROR_CERT_NOT_VALID=Ez a tan\u00fas\u00edtv\u00e1ny nem \u00e9rv\u00e9nyes.
SEC_ERROR_CERT_NO_RESPONSE=Tan\u00fas\u00edtv\u00e1nyk\u00f6nyvt\u00e1r\: Nincs v\u00e1lasz
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=A tan\u00fas\u00edtv\u00e1ny kiad\u00f3j\u00e1nak tan\u00fas\u00edtv\u00e1nya lej\u00e1rt.  Ellen\u0151rizze a rendszerd\u00e1tumot \u00e9s a rendszerid\u0151t.
SEC_ERROR_CRL_EXPIRED=A tan\u00fas\u00edtv\u00e1ny kiad\u00f3j\u00e1nak CRL-je lej\u00e1rt.  Friss\u00edtse, vagy ellen\u0151rizze a rendszerd\u00e1tumot \u00e9s a rendszerid\u0151t.
SEC_ERROR_CRL_BAD_SIGNATURE=A tan\u00fas\u00edtv\u00e1ny kiad\u00f3ja CRL-j\u00e9nek al\u00e1\u00edr\u00e1sa \u00e9rv\u00e9nytelen.
SEC_ERROR_CRL_INVALID=Az \u00faj visszavont tan\u00fas\u00edtv\u00e1nyok list\u00e1j\u00e1nak (CRL) \u00e9rv\u00e9nytelen a form\u00e1tuma.
SEC_ERROR_EXTENSION_VALUE_INVALID=A tan\u00fas\u00edtv\u00e1nykiterjeszt\u00e9s \u00e9rt\u00e9ke \u00e9rv\u00e9nytelen.
SEC_ERROR_EXTENSION_NOT_FOUND=Nem tal\u00e1lhat\u00f3 tan\u00fas\u00edtv\u00e1nykiterjeszt\u00e9s.
SEC_ERROR_CA_CERT_INVALID=A kiad\u00f3 tan\u00fas\u00edtv\u00e1nya \u00e9rv\u00e9nytelen.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=A tan\u00fas\u00edtv\u00e1ny \u00fatvonalhossz\u00e1nak korl\u00e1toz\u00e1sa \u00e9rv\u00e9nytelen.
SEC_ERROR_CERT_USAGES_INVALID=A tan\u00fas\u00edtv\u00e1ny haszn\u00e1lati mez\u0151je \u00e9rv\u00e9nytelen.
SEC_INTERNAL_ONLY=**CSAK bels\u0151 modul**
SEC_ERROR_INVALID_KEY=A kulcs nem t\u00e1mogatja a k\u00e9rt m\u0171veletet.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=A tan\u00fas\u00edtv\u00e1ny ismeretlen kritikus kiterjeszt\u00e9st tartalmaz.
SEC_ERROR_OLD_CRL=Az \u00faj CRL nem k\u00e9s\u0151bbi, mint a jelenlegi.
SEC_ERROR_NO_EMAIL_CERT=Nincs titkos\u00edtva vagy al\u00e1\u00edrva\: \u00d6nnek nincs m\u00e9g e-mail tan\u00fas\u00edtv\u00e1nya.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Nincs titkos\u00edtva\: \u00d6nnek nincs tan\u00fas\u00edtv\u00e1nya az \u00f6sszes c\u00edmzetthez.
SEC_ERROR_NOT_A_RECIPIENT=Nem siker\u00fclt visszafejteni\: \u00d6n nem c\u00edmzett, vagy nem tal\u00e1lhat\u00f3 egyez\u0151 tan\u00fas\u00edtv\u00e1ny \u00e9s szem\u00e9lyes kulcs.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Nem siker\u00fclt visszafejteni\: a kulcstitkos\u00edt\u00f3 algoritmus nem egyezik a tan\u00fas\u00edtv\u00e1ny\u00e1val.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Nem siker\u00fclt az al\u00e1\u00edr\u00e1s-ellen\u0151rz\u00e9s\: nem tal\u00e1lhat\u00f3 al\u00e1\u00edr\u00f3, t\u00fal sok al\u00e1\u00edr\u00f3 van, illetve az adatok nem megfelel\u0151ek vagy s\u00e9r\u00fcltek.
SEC_ERROR_UNSUPPORTED_KEYALG=Nem t\u00e1mogatott vagy ismeretlen kulcsalgoritmus.
SEC_ERROR_DECRYPTION_DISALLOWED=Nem siker\u00fclt visszafejteni\: a titkos\u00edt\u00e1s nem enged\u00e9lyezett algoritmust vagy kulcsm\u00e9retet haszn\u00e1l.
XP_SEC_FORTEZZA_BAD_CARD=A Fortezza k\u00e1rtya nem lett megfelel\u0151en inicializ\u00e1lva. Vegye ki, \u00e9s juttassa vissza a kibocs\u00e1t\u00f3hoz.
XP_SEC_FORTEZZA_NO_CARD=Nem tal\u00e1lhat\u00f3 Fortezza k\u00e1rtya
XP_SEC_FORTEZZA_NONE_SELECTED=Nincs kiv\u00e1lasztva Fortezza k\u00e1rtya
XP_SEC_FORTEZZA_MORE_INFO=V\u00e1lasszon egy szem\u00e9lyis\u00e9get, amelyr\u0151l inform\u00e1ci\u00f3t szeretne
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=A szem\u00e9lyis\u00e9g nem tal\u00e1lhat\u00f3
XP_SEC_FORTEZZA_NO_MORE_INFO=Nincs t\u00f6bb inform\u00e1ci\u00f3 a szem\u00e9lyis\u00e9gr\u0151l
XP_SEC_FORTEZZA_BAD_PIN=\u00c9rv\u00e9nytelen PIN
XP_SEC_FORTEZZA_PERSON_ERROR=Nem siker\u00fclt inicializ\u00e1lni a Fortezza-szem\u00e9lyis\u00e9geket.
SEC_ERROR_NO_KRL=A hely tan\u00fas\u00edtv\u00e1ny\u00e1hoz nem tal\u00e1lhat\u00f3 KRL.
SEC_ERROR_KRL_EXPIRED=A hely tan\u00fas\u00edtv\u00e1ny\u00e1nak KRL-je lej\u00e1rt.
SEC_ERROR_KRL_BAD_SIGNATURE=A hely tan\u00fas\u00edtv\u00e1nya KRL-j\u00e9nek al\u00e1\u00edr\u00e1sa \u00e9rv\u00e9nytelen.
SEC_ERROR_REVOKED_KEY=A hely tan\u00fas\u00edtv\u00e1ny\u00e1nak kulcs\u00e1t visszavont\u00e1k.
SEC_ERROR_KRL_INVALID=Az \u00faj KRL form\u00e1tuma \u00e9rv\u00e9nytelen.
SEC_ERROR_NEED_RANDOM=biztons\u00e1gi k\u00f6nyvt\u00e1r\: v\u00e9letlen adatok kellenek.
SEC_ERROR_NO_MODULE=biztons\u00e1gi k\u00f6nyvt\u00e1r\: a k\u00e9rt m\u0171veletet semelyik biztons\u00e1gi modul sem tudja elv\u00e9gezni.
SEC_ERROR_NO_TOKEN=A biztons\u00e1gi k\u00e1rtya vagy token nem l\u00e9tezik, inicializ\u00e1lni kell, vagy el van t\u00e1vol\u00edtva.
SEC_ERROR_READ_ONLY=biztons\u00e1gi k\u00f6nyvt\u00e1r\: csak olvashat\u00f3 adatb\u00e1zis.
SEC_ERROR_NO_SLOT_SELECTED=Nincs kiv\u00e1lasztva slot vagy token.
SEC_ERROR_CERT_NICKNAME_COLLISION=Ezen a n\u00e9ven m\u00e1r l\u00e9tezik tan\u00fas\u00edtv\u00e1ny.
SEC_ERROR_KEY_NICKNAME_COLLISION=Ezen a n\u00e9ven m\u00e1r l\u00e9tezik kulcs.
SEC_ERROR_SAFE_NOT_CREATED=hiba a biztons\u00e1gos objektum l\u00e9trehoz\u00e1sakor
SEC_ERROR_BAGGAGE_NOT_CREATED=hiba a baggage objektum l\u00e9trehoz\u00e1sakor
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Nem siker\u00fclt elt\u00e1vol\u00edtani az egyszer\u0171 nevet
XP_JAVA_DELETE_PRIVILEGE_ERROR=Nem siker\u00fclt t\u00f6r\u00f6lni a jogosults\u00e1got
XP_JAVA_CERT_NOT_EXISTS_ERROR=Ehhez az egyszer\u0171 n\u00e9vhez nem tartozik tan\u00fas\u00edtv\u00e1ny
SEC_ERROR_BAD_EXPORT_ALGORITHM=A sz\u00fcks\u00e9ges algoritmus nem enged\u00e9lyezett.
SEC_ERROR_EXPORTING_CERTIFICATES=Hiba t\u00f6rt\u00e9nt a tan\u00fas\u00edtv\u00e1nyok export\u00e1l\u00e1sakor.
SEC_ERROR_IMPORTING_CERTIFICATES=Hiba t\u00f6rt\u00e9nt a tan\u00fas\u00edtv\u00e1nyok import\u00e1l\u00e1sakor.
SEC_ERROR_PKCS12_DECODING_PFX=Nem lehet import\u00e1lni. Dek\u00f3dol\u00e1si hiba. A f\u00e1jl \u00e9rv\u00e9nytelen.
SEC_ERROR_PKCS12_INVALID_MAC=Nem lehet import\u00e1lni. \u00c9rv\u00e9nytelen MAC. Helytelen jelsz\u00f3 vagy s\u00e9r\u00fclt f\u00e1jl.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Nem lehet import\u00e1lni. A MAC-algoritmus nem t\u00e1mogatott.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Nem lehet import\u00e1lni. Csak a jelsz\u00f3integrit\u00e1s \u00e9s az adatv\u00e9delmi m\u00f3dok t\u00e1mogatottak.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Nem lehet import\u00e1lni. A f\u00e1jlstrukt\u00fara s\u00e9r\u00fclt.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Nem lehet import\u00e1lni. A titkos\u00edt\u00f3 algoritmus nem t\u00e1mogatott.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Nem lehet import\u00e1lni. A f\u00e1jlverzi\u00f3 nem t\u00e1mogatott.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Nem lehet import\u00e1lni. Helytelen adatv\u00e9delmi jelsz\u00f3.
SEC_ERROR_PKCS12_CERT_COLLISION=Nem lehet import\u00e1lni. Ugyanez a n\u00e9v m\u00e1r szerepel az adatb\u00e1zisban.
SEC_ERROR_USER_CANCELLED=A felhaszn\u00e1l\u00f3 megszak\u00edtotta a folyamatot.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Nem lett import\u00e1lva, m\u00e1r az adatb\u00e1zisban van.
SEC_ERROR_MESSAGE_SEND_ABORTED=Az \u00fczenet nem lett elk\u00fcldve.
SEC_ERROR_INADEQUATE_KEY_USAGE=A tan\u00fas\u00edtv\u00e1ny kulcshaszn\u00e1lata nem megfelel\u0151 a megk\u00eds\u00e9relt m\u0171velethez.
SEC_ERROR_INADEQUATE_CERT_TYPE=A tan\u00fas\u00edtv\u00e1nyt\u00edpus nem j\u00f3v\u00e1hagyott az alkalmaz\u00e1shoz.
SEC_ERROR_CERT_ADDR_MISMATCH=Az al\u00e1\u00edr\u00f3 tan\u00fas\u00edtv\u00e1nyban szerepl\u0151 c\u00edm nem egyezik meg az \u00fczenet fejl\u00e9c\u00e9ben lev\u0151 c\u00edmmel.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Nem lehet import\u00e1lni. Hiba t\u00f6rt\u00e9nt a szem\u00e9lyes kulcs import\u00e1l\u00e1sakor.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Nem lehet import\u00e1lni. Hiba t\u00f6rt\u00e9nt a tan\u00fas\u00edtv\u00e1nyl\u00e1nc import\u00e1l\u00e1sakor.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Nem lehet export\u00e1lni. A tan\u00fas\u00edtv\u00e1ny vagy kulcs nem tal\u00e1lhat\u00f3 meg n\u00e9v alapj\u00e1n.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Nem lehet export\u00e1lni. A szem\u00e9lyes kulcs nem tal\u00e1lhat\u00f3 \u00e9s export\u00e1lhat\u00f3.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Nem lehet export\u00e1lni. Nem lehetett \u00edrni az exportf\u00e1jlba.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Nem lehet import\u00e1lni. Nem lehetett olvasni az importf\u00e1jlb\u00f3l.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Nem lehet export\u00e1lni. A kulcsadatb\u00e1zis s\u00e9r\u00fclt vagy t\u00f6r\u00f6lve van.
SEC_ERROR_KEYGEN_FAIL=Nem siker\u00fcl a szem\u00e9lyes/nyilv\u00e1nos kulcsp\u00e1r l\u00e9trehoz\u00e1sa.
SEC_ERROR_INVALID_PASSWORD=A be\u00edrt jelsz\u00f3 \u00e9rv\u00e9nytelen.  V\u00e1lasszon m\u00e1sikat.
SEC_ERROR_RETRY_OLD_PASSWORD=A be\u00edrt r\u00e9gi jelsz\u00f3 helytelen. Pr\u00f3b\u00e1lja \u00fajra.
SEC_ERROR_BAD_NICKNAME=Ha tan\u00fas\u00edtv\u00e1ny neve m\u00e1r haszn\u00e1latban van.
SEC_ERROR_NOT_FORTEZZA_ISSUER=A partner FORTEZZA l\u00e1nc\u00e1ban van egy nem FORTEZZA tan\u00fas\u00edtv\u00e1ny.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Az \u00e9rz\u00e9keny kulcsot nem lehet \u00e1thelyezni abba a slotba, ahol sz\u00fcks\u00e9g van r\u00e1.
SEC_ERROR_JS_INVALID_MODULE_NAME=\u00c9rv\u00e9nytelen moduln\u00e9v.
SEC_ERROR_JS_INVALID_DLL=\u00c9rv\u00e9nytelen modul\u00fatvonal/f\u00e1jln\u00e9v
SEC_ERROR_JS_ADD_MOD_FAILURE=A modul hozz\u00e1ad\u00e1sa sikertelen.
SEC_ERROR_JS_DEL_MOD_FAILURE=A modul t\u00f6rl\u00e9se sikertelen.
SEC_ERROR_OLD_KRL=Az KRL r\u00e9gebbi mint a jelenlegi.
SEC_ERROR_CKL_CONFLICT=Az \u00faj CKL kibocs\u00e1t\u00f3ja m\u00e1s, mint a jelenlegi CKL-\u00e9.  T\u00f6r\u00f6lje a jelenlegi CKL-t.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=A tan\u00fas\u00edtv\u00e1nyhoz tartoz\u00f3 hiteles\u00edt\u00e9sszolg\u00e1ltat\u00f3 sz\u00e1m\u00e1ra nem enged\u00e9lyezett, hogy ezzel a n\u00e9vvel tan\u00fas\u00edtv\u00e1nyt adjon ki.
SEC_ERROR_KRL_NOT_YET_VALID=A tan\u00fas\u00edtv\u00e1nyhoz tartoz\u00f3 kulcsvisszavon\u00e1si lista (KRL) m\u00e9g nem \u00e9rv\u00e9nyes.
SEC_ERROR_CRL_NOT_YET_VALID=A tan\u00fas\u00edtv\u00e1nyhoz tartoz\u00f3 tan\u00fas\u00edtv\u00e1ny-visszavon\u00e1si lista (CRL) m\u00e9g nem \u00e9rv\u00e9nyes.
SEC_ERROR_UNKNOWN_CERT=A k\u00e9rt tan\u00fas\u00edtv\u00e1ny nem tal\u00e1lhat\u00f3.
SEC_ERROR_UNKNOWN_SIGNER=Az al\u00e1\u00edr\u00f3 tan\u00fas\u00edtv\u00e1nya nem tal\u00e1lhat\u00f3.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=A tan\u00fas\u00edtv\u00e1nyst\u00e1tusz-kiszolg\u00e1l\u00f3 hely\u00e9nek \u00e9rv\u00e9nytelen a form\u00e1tuma.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Az OCSP-v\u00e1laszt nem lehet teljesen dek\u00f3dolni, mert ismeretlen t\u00edpus\u00fa.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Az OCSP-kiszolg\u00e1l\u00f3 v\u00e1ratlan/\u00e9rv\u00e9nytelen HTTP-adatokat k\u00fcld\u00f6tt vissza.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Az OCSP-kiszolg\u00e1l\u00f3 szerint a k\u00e9r\u00e9s s\u00e9r\u00fclt vagy nem megfelel\u0151en form\u00e1zott.
SEC_ERROR_OCSP_SERVER_ERROR=Az OCSP-kiszolg\u00e1l\u00f3nak bels\u0151 hib\u00e1ja van.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Az OCSP-kiszolg\u00e1l\u00f3 azt javasolja, hogy pr\u00f3b\u00e1lkozzon k\u00e9s\u0151bb.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Az OCSP-kiszolg\u00e1l\u00f3 al\u00e1\u00edr\u00e1st k\u00f6vetel ehhez a k\u00e9r\u00e9shez.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Az OCSP-kiszolg\u00e1l\u00f3 visszautas\u00edtotta a k\u00e9r\u00e9st, mint jogosulatlant.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Az OCSP-kiszolg\u00e1l\u00f3 felismerhetetlen st\u00e1tuszt adott vissza.
SEC_ERROR_OCSP_UNKNOWN_CERT=Az OCSP-kiszolg\u00e1l\u00f3nak nincs st\u00e1tusza a tan\u00fas\u00edtv\u00e1nyhoz.
SEC_ERROR_OCSP_NOT_ENABLED=A m\u0171velet v\u00e9grehajt\u00e1sa el\u0151tt enged\u00e9lyeznie kell az OCSP-t.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=A m\u0171velet v\u00e9grehajt\u00e1sa el\u0151tt be kell \u00e1ll\u00edtani az alap\u00e9rtelmezett OCSP-v\u00e1laszad\u00f3t.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Az OCSP-kiszolg\u00e1l\u00f3 v\u00e1lasza s\u00e9r\u00fclt vagy nem megfelel\u0151en form\u00e1zott.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Az OCSP-v\u00e1lasz al\u00e1\u00edr\u00f3ja nem jogosult kiadni a tan\u00fas\u00edtv\u00e1ny st\u00e1tusz\u00e1t.
SEC_ERROR_OCSP_FUTURE_RESPONSE=Az OCSP-v\u00e1lasz m\u00e9g nem \u00e9rv\u00e9nyes (j\u00f6v\u0151beli d\u00e1tumot tartalmaz).
SEC_ERROR_OCSP_OLD_RESPONSE=Az OCSP-v\u00e1lasz elavult inform\u00e1ci\u00f3kat tartalmaz.
SEC_ERROR_DIGEST_NOT_FOUND=A CMS vagy a PKCS \#7 Digest nem volt benne az al\u00e1\u00edrt \u00fczenetben.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=A CMS vagy a PKCS \#7 Message t\u00edpus nem t\u00e1mogatott
SEC_ERROR_MODULE_STUCK=A PKCS \#11 modult nem lehet elt\u00e1vol\u00edtani, mert m\u00e9g haszn\u00e1latban van.
SEC_ERROR_BAD_TEMPLATE=Nem siker\u00fclt dek\u00f3dolni az ASN.1 adatokat. A megadott sablon \u00e9rv\u00e9nytelen volt.
SEC_ERROR_CRL_NOT_FOUND=Nem tal\u00e1lhat\u00f3k illeszked\u0151 CRL-ek.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Egy olyan tan\u00fas\u00edtv\u00e1nyt pr\u00f3b\u00e1l import\u00e1lni, amelynek a kiad\u00f3ja/sorozatsz\u00e1ma megegyezik egy l\u00e9tez\u0151 tan\u00fas\u00edtv\u00e1nnyal, de ez a tan\u00fas\u00edtv\u00e1ny nem ugyanaz.
SEC_ERROR_BUSY=Az NSS nem tud le\u00e1llni. Az objektumok m\u00e9g haszn\u00e1latban vannak.
SEC_ERROR_EXTRA_INPUT=A DER-k\u00f3dolt \u00fczenet felesleges haszn\u00e1latlan adatot tartalmazott.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Nem t\u00e1mogatott elliptikus g\u00f6rbe.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Nem t\u00e1mogatott elliptikus g\u00f6rbepontk\u00e9plet.
SEC_ERROR_UNRECOGNIZED_OID=Nem felismert objektumazonos\u00edt\u00f3.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=\u00c9rv\u00e9nytelen OCSP-al\u00e1\u00edr\u00f3tan\u00fas\u00edtv\u00e1ny az OCSP-v\u00e1laszban.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=A tan\u00fas\u00edtv\u00e1ny vissza van vonva a kiad\u00f3 tan\u00fas\u00edtv\u00e1ny-visszavon\u00e1si list\u00e1j\u00e1n.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=A kiad\u00f3 OCSP-v\u00e1laszad\u00f3ja azt jelzi, hogy a tan\u00fas\u00edtv\u00e1ny vissza van vonva.
SEC_ERROR_CRL_INVALID_VERSION=A kiad\u00f3 tan\u00fas\u00edtv\u00e1ny-visszavon\u00e1si list\u00e1j\u00e1nak verzi\u00f3sz\u00e1ma ismeretlen.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=A kiad\u00f3 V1 tan\u00fas\u00edtv\u00e1ny-visszavon\u00f3 list\u00e1ja kritikus kiterjeszt\u00e9st tartalmaz.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=A kiad\u00f3 V2 tan\u00fas\u00edtv\u00e1ny-visszavon\u00f3 list\u00e1ja ismeretlen kritikus kiterjeszt\u00e9st tartalmaz.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Ismeretlen objektumt\u00edpus lett megadva.
SEC_ERROR_INCOMPATIBLE_PKCS11=A PKCS \#11 illeszt\u0151program inkompatibilis m\u00f3don megs\u00e9rti a specifik\u00e1ci\u00f3t.
SEC_ERROR_NO_EVENT=Jelenleg nincs \u00faj el\u00e9rhet\u0151 slot esem\u00e9ny.
SEC_ERROR_CRL_ALREADY_EXISTS=M\u00e1r van CRL.
SEC_ERROR_NOT_INITIALIZED=Az NSS nincs inicializ\u00e1lva.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=A m\u0171velet sikertelen volt, mert a PKCS\#11 token nincs bejelentkezve.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=A konfigur\u00e1lt OCSP-v\u00e1laszad\u00f3 tan\u00fas\u00edtv\u00e1nya \u00e9rv\u00e9nytelen.
SEC_ERROR_OCSP_BAD_SIGNATURE=Az OCSP-v\u00e1lasz al\u00e1\u00edr\u00e1sa \u00e9rv\u00e9nytelen.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=A tan\u00fas\u00edtv\u00e1ny-ellen\u0151rz\u00e9si keres\u00e9s k\u00edv\u00fcl esik a keres\u00e9si korl\u00e1tokon
SEC_ERROR_INVALID_POLICY_MAPPING=A h\u00e1zirendlek\u00e9pez\u00e9s tetsz\u0151leges h\u00e1zirend \u00e9rt\u00e9ket tartalmaz
SEC_ERROR_POLICY_VALIDATION_FAILED=A tan\u00fas\u00edtv\u00e1nyl\u00e1nc nem megy \u00e1t a h\u00e1zirend-ellen\u0151rz\u00e9sen
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Ismeretlen helyt\u00edpus a tan\u00fas\u00edtv\u00e1ny AIA kiterjeszt\u00e9s\u00e9ben
SEC_ERROR_BAD_HTTP_RESPONSE=A kiszolg\u00e1l\u00f3 rossz HTTP-v\u00e1laszt adott vissza
SEC_ERROR_BAD_LDAP_RESPONSE=A kiszolg\u00e1l\u00f3 rossz LDAP-v\u00e1laszt adott vissza
SEC_ERROR_FAILED_TO_ENCODE_DATA=Nem siker\u00fclt k\u00f3dolni az adatokat az ASN1 k\u00f3dol\u00f3val
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Hib\u00e1s inform\u00e1ci\u00f3-hozz\u00e1f\u00e9r\u00e9s a tan\u00fas\u00edtv\u00e1nykiterjeszt\u00e9sben
SEC_ERROR_LIBPKIX_INTERNAL=Libpkix bels\u0151 hiba t\u00f6rt\u00e9nt a tan\u00fas\u00edtv\u00e1ny \u00e9rv\u00e9nyes\u00edt\u00e9se k\u00f6zben.
SEC_ERROR_PKCS11_GENERAL_ERROR=Egy PKCS \#11 modul CKR_GENERAL_ERROR hib\u00e1t adott vissza, amely azt jelzi, hogy helyrehozhatatlan hiba t\u00f6rt\u00e9nt.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Egy PKCS \#11 modul CKR_FUNCTION_FAILED hib\u00e1t adott vissza, amely azt jelzi, hogy a k\u00e9rt m\u0171velet nem volt elv\u00e9gezhet\u0151. Ugyanez a m\u0171velet legk\u00f6zelebb siker\u00fclhet.
SEC_ERROR_PKCS11_DEVICE_ERROR=Egy PKCS \#11 modul CKR_DEVICE_ERROR hib\u00e1t adott vissza, amely azt jelzi, hogy valami probl\u00e9ma van a tokennel vagy a slottal.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Ismeretlen inform\u00e1ci\u00f3-hozz\u00e1f\u00e9r\u00e9si met\u00f3dus a tan\u00fas\u00edtv\u00e1nykiterjeszt\u00e9sben.
SEC_ERROR_CRL_IMPORT_FAILED=Hiba t\u00f6rt\u00e9nt egy CRL import\u00e1l\u00e1sa k\u00f6zben.
SEC_ERROR_EXPIRED_PASSWORD=A jelsz\u00f3 lej\u00e1rt.
SEC_ERROR_LOCKED_PASSWORD=A jelsz\u00f3 z\u00e1rolva van.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Ismeretlen PKCS \#11 hiba.
SEC_ERROR_BAD_CRL_DP_URL=\u00c9rv\u00e9nytelen vagy nem t\u00e1mogatott URL a CRL terjeszt\u00e9si pont nev\u00e9ben.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=A tan\u00fas\u00edtv\u00e1ny egy nem biztons\u00e1gos, \u00e9s emiatt letiltott al\u00e1\u00edr\u00e1si algoritmussal lett al\u00e1\u00edrva.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

