#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=La direcci\u00f3n web no es v\u00e1lida y no se puede cargar.
fileNotFound=Pale Moon no puede encontrar el archivo en %S.
dnsNotFound=Pale Moon no puede encontrar el servidor en %S.
protocolNotFound=Pale Moon no sabe c\u00f3mo abrir esta direcci\u00f3n web, porque el protocolo (%S) no est\u00e1 asociado con ning\u00fan programa.
connectionFailure=Pale Moon no puede establecer una conexi\u00f3n con el servidor en %S.
netInterrupt=La conexi\u00f3n con %S fue interrumpida mientras la p\u00e1gina se estaba cargando.
netTimeout=El servidor en %S est\u00e1 tomando demasiado tiempo para responder.
redirectLoop=Pale Moon detect\u00f3 que el servidor est\u00e1 redirigiendo el pedido para esta direcci\u00f3n web en una forma que nunca se completar\u00e1.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Para mostrar esta p\u00e1gina, %S debe enviar informaci\u00f3n que repetir\u00e1 cualquier acci\u00f3n (como una b\u00fasqueda o confirmaci\u00f3n de compra) que haya sido realizada anteriormente.
resendButton.label=Reenviar
unknownSocketType=Pale Moon no sabe c\u00f3mo comunicarse con el servidor.
netReset=La conexi\u00f3n con el servidor fue restablecida mientras se cargaba la p\u00e1gina.
notCached=Este documento ya no est\u00e1 disponible
netOffline=Pale Moon est\u00e1 actualmente en modo sin conexi\u00f3n y no puede navegar la web.
isprinting=El documento no puede cambiar mientras se est\u00e9 imprimiendo o est\u00e9 en vista previa de impresi\u00f3n.
deniedPortAccess=Esta direcci\u00f3n web usa un puerto de red normalmente es usado para prop\u00f3sitos diferentes que la navegaci\u00f3n web. Pale Moon cancel\u00f3 la solicitud para tu protecci\u00f3n.
proxyResolveFailure=Pale Moon est\u00e1 configurado para usar un servidor proxy que no puede ser encontrado.
proxyConnectFailure=Pale Moon est\u00e1 configurado para usar un servidor proxy que est\u00e1 rechazando las conexiones.
contentEncodingError=La p\u00e1gina que est\u00e1s tratando de ver no se puede mostrar porque usa un formato de compresi\u00f3n no v\u00e1lido o no soportado.
unsafeContentType=La p\u00e1gina que est\u00e1s tratando de ver no se puede mostrar porque est\u00e1 contenida en un tipo de archivo que puede no ser seguro de abrir. Por favor, ponete en contacto con los administradores del sitio web para informarles de este problema.
externalProtocolTitle=Solicitud de protocolo externo
externalProtocolPrompt=Se debe iniciar una aplicaci\u00f3n externa para manejar enlaces %1$S\:. Enlace solicitado\:\n\n\n%2$S\nAplicaci\u00f3n\: %3$S\n\n\nSi no estabas esperando esta solicitud, puede ser un intento de explotar una debilidad en aquel programa. Cancel\u00e1 la misma, a menos que est\u00e9s seguro que no es maliciosa.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<desconocida>
externalProtocolChkMsg=Recordar mi elecci\u00f3n para todos los enlaces de este tipo.
externalProtocolLaunchBtn=Iniciar aplicaci\u00f3n
malwareBlocked=El sitio web %S fue informado como un sitio de ataque y fue bloqueado basado en tus preferencias de seguridad.
phishingBlocked=El sitio web %S fue informado como un sitio fraudulento dise\u00f1ado para enga\u00f1ar usuarios para que compartan informaci\u00f3n personal o financiera.
cspFrameAncestorBlocked=Esta p\u00e1gina tiene una pol\u00edtica de seguridad de contenido que evita que sea incrustada de esta forma.
xssBlockMode=Esta p\u00e1gina contiene un ataque XSS que fue bloqueado para tu seguridad.
corruptedContentError=La p\u00e1gina que est\u00e1s tratando de ver no se puede mostrar porque se detect\u00f3 un error en la transmisi\u00f3n de los datos.
remoteXUL=Esta p\u00e1gina usa una tecnolog\u00eda no soportada que ya no est\u00e1 disponible en Pale Moon.

