#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=Aviso\: script sin respuesta
KillScriptMessage=Un script de esta p\u00e1gina puede estar ocupado, o puede haber dejado de responder. Puede detener el script, o puede continuar para ver si el script finaliza.
KillScriptWithDebugMessage=Un script en esta p\u00e1gina puede estar ocupado, o puede que haya dejado de responder. Puede detener el script ahora, abrirlo en el depurador, o dejar que contin\u00fae su ejecuci\u00f3n.
KillScriptLocation=Script\: %S
StopScriptButton=Detener script
DebugScriptButton=Depurar script
WaitForScriptButton=Continuar
DontAskAgain=&No volver a preguntarme
JSURLLoadBlockedWarning=El intento de cargar una URL javascript\: URL de un servidor\nen una ventana que muestra contenido de otro servidor\nha sido bloqueado por el administrador de seguridad.
WindowCloseBlockedWarning=Los scripts no pueden cerrar ventanas que no hayan sido abiertas por un script.
OnBeforeUnloadTitle=\u00bfEst\u00e1 seguro?
OnBeforeUnloadMessage=Esta p\u00e1gina le est\u00e1 pidiendo confirmar que quiere abandonarla - los datos que haya introducido podr\u00edan no guardarse.
OnBeforeUnloadStayButton=Permanecer en la p\u00e1gina
OnBeforeUnloadLeaveButton=Abandonar p\u00e1gina
UnexpectedCanvasVariantStyle=canvas\: se ha ignorado un intento de establecer strokeStyle o fillStyle a un valor que no es ni una cadena, ni un CanvasGradient, ni un CanvasPattern.
EmptyGetElementByIdParam=Cadena vac\u00eda pasada a getElementById().
LowMemoryTitle=Advertencia\: poca memoria
LowMemoryMessage=Se ha detenido un script en esta p\u00e1gina por escasez de memoria.
SpeculationFailed=Se ha escrito un \u00e1rbol no equilibrado usando document.write() lo que ha provocado que los datos de red se hayan reinterpretado ("reparsed"). Para m\u00e1s informaci\u00f3n, https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing
DocumentWriteIgnored=Se ha ignorado una llamada a document.write() desde un script externo cargado as\u00edncronamente.
FormValidationTextTooLong=Por favor, reduzca este texto a %S caracteres o menos (actualmente est\u00e1 usando %S caracteres).
FormValidationValueMissing=Por favor, rellene este campo.
FormValidationCheckboxMissing=Por favor, marque esta casilla si desea continuar.
FormValidationRadioMissing=Por favor, seleccione una de estas opciones.
FormValidationFileMissing=Por favor, seleccione un archivo.
FormValidationSelectMissing=Por favor, seleccione un elemento de la lista.
FormValidationInvalidEmail=Por favor, introduzca una direcci\u00f3n de correo.
FormValidationInvalidURL=Por favor, introduzca una URL.
FormValidationPatternMismatch=Por favor, aj\u00fastese al formato solicitado.
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=Por favor, aj\u00fastese al formato solicitado\: %S.
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=Por favor, seleccione un valor v\u00e1lido. Los dos valores v\u00e1lidos m\u00e1s cercanos son %S y %S.
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=Por favor, seleccione un valor v\u00e1lido. El valor v\u00e1lido m\u00e1s cercano es %S.
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=El uso de getAttributeNode() est\u00e1 desaprobado. Use en su lugar getAttribute().
SetAttributeNodeWarning=El uso de setAttributeNode() est\u00e1 desaprobado. Use en su lugar setAttribute().
GetAttributeNodeNSWarning=El uso de getAttributeNodeNS() est\u00e1 desaprobado. Use en su lugar getAttributeNS().
SetAttributeNodeNSWarning=El uso de setAttributeNodeNS() est\u00e1 desaprobado. Use en su lugar setAttributeNS().
RemoveAttributeNodeWarning=El uso de removeAttributeNode() est\u00e1 desaprobado. Use en su lugar removeAttribute().
CreateAttributeWarning=El uso de document.createAttribute() est\u00e1 desaprobado. Use en su lugar element.setAttribute().
CreateAttributeNSWarning=El uso de document.createAttributeNS() est\u00e1 desaprobado. Use en su lugar element.setAttributeNS().
OwnerElementWarning=El uso de ownerElement en atributos est\u00e1 desaprobado.
NodeValueWarning=El uso de nodeValue en atributos est\u00e1 desaprobado. Use en su lugar value.
TextContentWarning=El uso de textContext en atributos est\u00e1 desaprobado. Use en su lugar value.
EnablePrivilegeWarning=El uso de enablePrivilege est\u00e1 desaprobado. Por favor, use en su lugar c\u00f3digo que se ejecute con el principal del sistema (p.e. una extensi\u00f3n).
nsIJSONDecodeDeprecatedWarning=nsIJSON.decode est\u00e1 desaprobado. Por favor, utilice JSON.parse en su lugar.
nsIJSONEncodeDeprecatedWarning=nsIJSON.encode est\u00e1 desaprobado. Por favor, utilice JSON.stringify en su lugar.
nsIDOMWindowInternalWarning=El uso de nsIDOMWindowInternal est\u00e1 desaprobado. Use nsIDOMWindow en su lugar.
InputEncodingWarning=El uso de inputEncoding est\u00e1 desaprobado.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=Los eventos MozBeforePaint ya no se admiten. Debe pasarse un argumento no nulo de "callback" a mozRequestAnimationFrame.
FullScreenDeniedBlocked=La solicitud de pantalla completa ha sido denegada porque este dominio tiene bloqueado el acceso a la pantalla completa por el usuario.
FullScreenDeniedDisabled=La solicitud de pantalla completa ha sido denegada porque la API de pantalla completa est\u00e1 desactivada en las preferencias de usuario.
FullScreenDeniedFocusedPlugin=La solicitud de pantalla completa ha sido denegada porque un plugin en ventana tiene el foco.
FullScreenDeniedHidden=La solicitud de pantalla completa ha sido denegada porque el documento ya no est\u00e1 visible.
FullScreenDeniedIframeNotAllowed=La solicitud de pantalla completa ha sido denegada porque al menos uno de los iframes contenidos en el documento no tiene un atributo "allowfullscreen".
FullScreenDeniedNotInputDriven=La solicitud de pantalla completa ha sido denegada porque Element.mozRequestFullScreen() no ha sido llamada desde dentro de un manejador de eventos generado por el usuario de ejecuci\u00f3n breve.
FullScreenDeniedNotInDocument=La solicitud de pantalla completa ha sido denegada porque el elemento que la solicitaba ya no est\u00e1 en el documento.
FullScreenDeniedMovedDocument=La solicitud de pantalla completa ha sido denegada porque el elemento que la solicitaba ha movido el documento.
FullScreenDeniedLostWindow=La solicitud de pantalla completa ha sido denegada porque ya no se dispone de una ventana.
FullScreenDeniedSubDocFullScreen=La solicitud de pantalla completa ha sido denegada porque un subdocumento del documento que lo ha solicitado ya est\u00e1 en pantalla completa.
FullScreenDeniedNotDescendant=La solicitud de pantalla completa ha sido denegada porque el elemento que lo ha solicitado no es un descendiente del elemento actual de pantalla completa.
FullScreenDeniedNotFocusedTab=La solicitud de pantalla completa ha sido denegada porque el elemento que la ha realizado no est\u00e1 en la pesta\u00f1a activa en este momento.
FullScreenDeniedContentOnly=La solicitud de pantalla completa ha sido denegada porque el elemento que lo solicit\u00f3 est\u00e1 en el directorio chrome y la API de pantalla completa est\u00e1 configurada s\u00f3lo para contenido.
RemovedFullScreenElement=Se ha salido del modo de pantalla completa porque el elemento en pantalla completa ha sido eliminado del documento.
FocusedWindowedPluginWhileFullScreen=Se ha abandonado la pantalla completa porque un plugin en ventana ha recibido el foco.
HTMLSyncXHRWarning=El an\u00e1lisis HTML en XMLHttpRequest no est\u00e1 admitido en el modo s\u00edncrono.
InvalidRedirectChannelWarning=No es posible redirigir a %S porque el canal no implementa nsIWritablePropertyBag2.
ResponseTypeSyncXHRWarning=El uso del atributo responseType de XMLHttpRequest ya no se admite en el modo s\u00edncrono del contexto de ventana.
WithCredentialsSyncXHRWarning=El uso del atributo withCredentials de XMLHttpRequest ya no se admite en el modo s\u00edncrono del contexto de ventana.
TimeoutSyncXHRWarning=El uso del atributo timeout de XMLHttpRequest ya no se admite en el modo s\u00edncrono del contexto de ventana.
JSONCharsetWarning=Se ha registrado un intento de declarar una codificaci\u00f3n no UTF-8 para el JSON recuperado mediante XMLHttpRequest. S\u00f3lo se admite UTF-8 para decodificar JSON.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=No hay memoria suficiente para remuestrear el nodo AudioBufferSourceNode para la reproducci\u00f3n.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=El contenido de la memoria intermedia pasado a decodeAudioData tiene un tipo de contenido desconocido.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=Ha sucedido un error desconocido al procesar decodeAudioData.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=El contenido de la memoria intermedia pasado a decodeAudioData tiene contenido no v\u00e1lido que no puede ser decodificado con \u00e9xito.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=El contenido de la memoria intermedia pasado a decodeAudioData no contiene audio.
MediaLoadExhaustedCandidates=Ha fallado la carga de todos los recursos candidatos. Carga de medios pausada.
MediaLoadSourceMissingSrc=El elemento <source> no tiene atributo "src". Ha fallado la carga del recurso de medios.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=La carga HTTP ha fallado con el estado %1$S. Ha fallado la carga del recurso de medios %2$S.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=URI no v\u00e1lida. Ha fallado la carga del recurso de medios %S.
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute=El atributo "type" especificado de "%1$S" no se admite. Ha fallado la carga del recurso de medios %2$S.
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched=El atributo "media" especificado de "%1$S" no coincide con el entorno. Ha fallado la carga del recurso de medios %2$S.
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType=El "Content-Type" HTTP de "%1$S" no es compatible. Ha fallado la carga del recurso de medios %2$S.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=El recurso de medios %S no puede decodificarse.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=El uso del atributo code de DOMException est\u00e1 desaprobado. Use en su lugar name.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=Exponer objetos JS chrome al contenido sin __exposedProps__ es inseguro y est\u00e1 desaprobado. Vea http\://developer.mozilla.org/en/XPConnect_wrappers para m\u00e1s informaci\u00f3n.
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=El uso de eventos Mutation est\u00e1 desaprobado. Use en su lugar MutationObserver.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=El objeto Components est\u00e1 desaprobado. Pronto ser\u00e1 eliminado.
PluginHangUITitle=Aviso\: plugin sin respuesta
PluginHangUIMessage=%S puede estar ocupado o puede haber dejado de responder. Puede detener el plugin ahora o puede continuar para ver si el plugin completa su tarea.
PluginHangUIWaitButton=Continuar
PluginHangUIStopButton=Detener plugin
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning='mozHidden' y 'mozVisibilityState' est\u00e1n desaprobados. Use en su lugar las versiones sin prefijo 'hidden' y 'visibilityState'.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=Invocar detach() en un NodeIterator ya no tiene efecto.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=Se ignora la recuperaci\u00f3n (get) o asignaci\u00f3n (set) de una propiedad que tiene [LenientThis] porque el objeto "this" es incorrecto.
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=El uso de nsIDOMWindowUtils.getOuterWindowWithId() est\u00e1 desaprobado. Use en su lugar el m\u00e9todo del mismo nombre de nsIWindowMediator.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=El uso de getPreventDefault() est\u00e1 desaprobado. Use en su lugar defaultPrevented.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=El uso de getUserData() o setUserData() est\u00e1 desaprobado. En su lugar, use WeakMap o element.dataset.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=El uso de Document.load() est\u00e1 desaprobado. Para actualizar su c\u00f3digo, use el objeto DOM XMLHttpRequest. Para m\u00e1s ayuda, https\://developer.mozilla.org/en/XMLHttpRequest
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

