#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=O %S n\u00e3o pode ser guardado, porque o ficheiro fonte n\u00e3o pode ser lido.\n\nTente novamente mais tarde, ou contacte o administrador do servidor.
writeError=O %S n\u00e3o pode ser guardado, porque ocorreu um erro desconhecido.\n\nTente guardar para uma localiza\u00e7\u00e3o diferente.
launchError=O %S n\u00e3o pode ser aberto, porque ocorreu um erro desconhecido.\n\nTente guardar para o disco primeiro e depois abrir o ficheiro.
diskFull=N\u00e3o existe espa\u00e7o suficiente no disco para guardar %S.\n\nRemova ficheiros desnecess\u00e1rios do disco e tente novamente, ou tente guardar numa localiza\u00e7\u00e3o diferente.
readOnly=O %S n\u00e3o pode ser guardado, porque o disco, pasta, ou ficheiro est\u00e1 protegido contra escrita.\n\nActive a escrita no disco e tente novamente, ou tente guardar numa localiza\u00e7\u00e3o diferente.
accessError=O %S n\u00e3o pode ser guardado, porque n\u00e3o pode alterar os conte\u00fados dessa pasta.\n\nAltere as propriedades da pasta e tente novamente, ou tente guardar numa localiza\u00e7\u00e3o diferente.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=O %S n\u00e3o pode ser aberto, porque a aplica\u00e7\u00e3o auxiliar associada n\u00e3o existe. Altere a associa\u00e7\u00e3o nas suas prefer\u00eancias.
noMemory=N\u00e3o existe mem\u00f3ria suficiente para completar a ac\u00e7\u00e3o que pediu.\n\nTermine algumas aplica\u00e7\u00f5es e tente novamente.
title=A transferir %S
fileAlreadyExistsError=O %S n\u00e3o pode ser guardado porque j\u00e1 existe um ficheiro com o mesmo nome que o direct\u00f3rio '_ficheiros'.\n\nTente guardar para uma localiza\u00e7\u00e3o diferente.
fileNameTooLongError=O %S n\u00e3o pode ser guardado, porque o nome do ficheiro \u00e9 demasiado grande.\n\nTente guardar com um nome de ficheiro mais curto.

