#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=Figyelmeztet\u00e9s\: a parancsf\u00e1jl nem v\u00e1laszol
KillScriptMessage=Az oldalon a parancsf\u00e1jl dolgozik, illetve nem v\u00e1laszol. Meg\u00e1ll\u00edthatja most a parancsf\u00e1jlt, vagy folytathatja, h\u00e1tha befejezi a m\u0171k\u00f6d\u00e9s\u00e9t.
KillScriptWithDebugMessage=Az oldalon a parancsf\u00e1jl dolgozik, illetve nem v\u00e1laszol. Le\u00e1ll\u00edthatja a parancsf\u00e1jlt, megnyithatja a hibakeres\u0151ben, vagy hagyhatja folytat\u00f3dni.
KillScriptLocation=Parancsf\u00e1jl\: %S
StopScriptButton=Le\u00e1ll\u00edt\u00e1s
DebugScriptButton=Hibakeres\u00e9s
WaitForScriptButton=Folytat\u00e1s
DontAskAgain=&Ne k\u00e9rdezze meg t\u00f6bbet
JSURLLoadBlockedWarning=A biztons\u00e1gkezel\u0151 megakad\u00e1lyozta egy adott g\u00e9p\ntartalm\u00e1t megjelen\u00edt\u0151 ablakban egy m\u00e1sik g\u00e9pre\nmutat\u00f3 javascript\: URL bet\u00f6lt\u00e9s\u00e9t.
WindowCloseBlockedWarning=A parancsf\u00e1jlok nem z\u00e1rhatnak be nem parancsf\u00e1jlok \u00fatj\u00e1n megnyitott ablakokat.
OnBeforeUnloadTitle=Biztos benne?
OnBeforeUnloadMessage=Az oldal azt k\u00e9ri, hogy er\u0151s\u00edtse meg kil\u00e9p\u00e9si sz\u00e1nd\u00e9k\u00e1t \u2013 a be\u00edrt adatok nem felt\u00e9tlen\u00fcl vannak mentve.
OnBeforeUnloadStayButton=Marad\u00e1s ezen az oldalon
OnBeforeUnloadLeaveButton=Oldal elhagy\u00e1sa
UnexpectedCanvasVariantStyle=canvas\: figyelmen k\u00edv\u00fcl lett hagyva a k\u00eds\u00e9rlet a strokeStyle vagy a fillStyle olyan \u00e9rt\u00e9kre be\u00e1ll\u00edt\u00e1s\u00e1ra, amely se nem karakterl\u00e1nc, se nem CanvasGradient vagy CanvasPattern.
EmptyGetElementByIdParam=A getElementById() \u00fcres karakterl\u00e1ncot kapott.
LowMemoryTitle=Figyelmeztet\u00e9s\: kev\u00e9s mem\u00f3ria
LowMemoryMessage=Az oldalon fut\u00f3 parancsf\u00e1jl le\u00e1llt, mert t\u00fal kev\u00e9s mem\u00f3ria \u00e1llt rendelkez\u00e9sre.
SpeculationFailed=Egy kiegyens\u00falyozatlan fa document.write() haszn\u00e1lat\u00e1val t\u00f6rt\u00e9nt ki\u00edrat\u00e1sa a h\u00e1l\u00f3zatr\u00f3l sz\u00e1rmaz\u00f3 adatok \u00fajrafeldolgoz\u00e1s\u00e1t okozta. Tov\u00e1bbi seg\u00edts\u00e9g\: https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing
DocumentWriteIgnored=Egy aszinkron m\u00f3don bet\u00f6lt\u00f6tt k\u00fcls\u0151 parancsf\u00e1jl \u00e1ltal megh\u00edvott document.write() figyelmen k\u00edv\u00fcl lett hagyva.
FormValidationTextTooLong=R\u00f6vid\u00edtse le ezt a sz\u00f6veget %S karakterre vagy kevesebbre (most %S karaktert haszn\u00e1l).
FormValidationValueMissing=T\u00f6ltse ki ezt a mez\u0151t.
FormValidationCheckboxMissing=Jel\u00f6lje be ezt a n\u00e9gyzetet a folytat\u00e1shoz.
FormValidationRadioMissing=Jel\u00f6lj\u00f6n ki egyet a lehet\u0151s\u00e9gek k\u00f6z\u00fcl.
FormValidationFileMissing=Jel\u00f6lj\u00f6n ki egy f\u00e1jlt.
FormValidationSelectMissing=Jel\u00f6lj\u00f6n ki egy elemet a list\u00e1b\u00f3l.
FormValidationInvalidEmail=\u00cdrjon be egy e-mail c\u00edmet.
FormValidationInvalidURL=\u00cdrjon be egy URL-t.
FormValidationPatternMismatch=A k\u00e9rt form\u00e1tumban adja meg az adatot.
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=A k\u00e9rt form\u00e1tumban adja meg az adatot\: %S.
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=V\u00e1lasszon egy \u00e9rv\u00e9nyes \u00e9rt\u00e9ket. A k\u00e9t legk\u00f6zelebbi \u00e9rv\u00e9nyes \u00e9rt\u00e9k\: %S \u00e9s %S.
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=V\u00e1lasszon egy \u00e9rv\u00e9nyes \u00e9rt\u00e9ket. A legk\u00f6zelebbi \u00e9rv\u00e9nyes \u00e9rt\u00e9k\: %S.
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=A getAttributeNode() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a getAttribute()-t.
SetAttributeNodeWarning=A setAttributeNode() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a setAttribute()-t.
GetAttributeNodeNSWarning=A getAttributeNodeNS() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a getAttributeNS()-t.
SetAttributeNodeNSWarning=A setAttributeNodeNS() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a setAttributeNS()-t.
RemoveAttributeNodeWarning=A removeAttributeNode() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a removeAttribute()-t.
CreateAttributeWarning=A document.createAttribute() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a setAttribute()-t.
CreateAttributeNSWarning=A document.createAttributeNS() haszn\u00e1lata nem helyes. Haszn\u00e1lja helyette a setAttributeNS()-t.
OwnerElementWarning=Az attrib\u00fatum ownerElement attrib\u00fatum\u00e1nak haszn\u00e1lata elavult.
NodeValueWarning=Az attrib\u00fatum nodeValue attrib\u00fatum\u00e1nak haszn\u00e1lata elavult. Haszn\u00e1ljon helyette \u00e9rt\u00e9ket.
TextContentWarning=Az attrib\u00fatum textContent attrib\u00fatum\u00e1nak haszn\u00e1lata elavult. Haszn\u00e1ljon helyette \u00e9rt\u00e9ket.
EnablePrivilegeWarning=Az enablePrivilege haszn\u00e1lata elavult. Haszn\u00e1ljon a rendszerr\u00e9sztvev\u0151k\u00e9nt (p\u00e9ld\u00e1ul kiterjeszt\u00e9sk\u00e9nt) fut\u00f3 k\u00f3dot.
nsIJSONDecodeDeprecatedWarning=A nsIJSON.decode elavult. Haszn\u00e1lja helyette a JSON.parse-t.
nsIJSONEncodeDeprecatedWarning=A nsIJSON.encode elavult. Haszn\u00e1lja helyette a JSON.stringify-t.
nsIDOMWindowInternalWarning=A nsIDOMWindowInternal haszn\u00e1lata elavult. Haszn\u00e1lja helyette a nsIDOMWindow-t.
InputEncodingWarning=Az inputEncoding haszn\u00e1lata elavult.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=A MozBeforePaint esem\u00e9nyek m\u00e1r nem t\u00e1mogatottak. A mozRequestAnimationFrame-nek egy nem null visszah\u00edv\u00e1s argumentumot kell \u00e1tadni.
FullScreenDeniedBlocked=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a felhaszn\u00e1l\u00f3 letiltotta a teljes k\u00e9perny\u0151 haszn\u00e1lat\u00e1t a tartom\u00e1nyban.
FullScreenDeniedDisabled=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a felhaszn\u00e1l\u00f3i be\u00e1ll\u00edt\u00e1sokban a teljes k\u00e9perny\u0151s API le van tiltva.
FullScreenDeniedFocusedPlugin=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert egy ablakban fut\u00f3 b\u0151v\u00edtm\u00e9ny van f\u00f3kuszban.
FullScreenDeniedHidden=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a dokumentum m\u00e1r nem l\u00e1that\u00f3.
FullScreenDeniedIframeNotAllowed=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a dokumentumot tartalmaz\u00f3 iframe-k legal\u00e1bb egyike nem rendelkezik az \u201eallowfullscreen\u201d attrib\u00fatummal.
FullScreenDeniedNotInputDriven=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert az Element.mozRequestFullScreen() nem egy r\u00f6vid ideig fut\u00f3, felhaszn\u00e1l\u00f3 \u00e1ltal gener\u00e1lt esem\u00e9nykezel\u0151b\u0151l lett h\u00edvva.
FullScreenDeniedNotInDocument=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a k\u00e9r\u0151 elem m\u00e1r nincs a dokumentum\u00e1ban.
FullScreenDeniedMovedDocument=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a k\u00e9r\u0151 elem dokumentumot v\u00e1ltott.
FullScreenDeniedLostWindow=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert m\u00e1r nincs ablak.
FullScreenDeniedSubDocFullScreen=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a teljes k\u00e9perny\u0151t k\u00e9r\u0151 dokumentum egy r\u00e9szdokumentuma m\u00e1r teljes k\u00e9perny\u0151s.
FullScreenDeniedNotDescendant=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a k\u00e9r\u0151 elem nem az aktu\u00e1lis teljes k\u00e9perny\u0151s elem lesz\u00e1rmazottja.
FullScreenDeniedNotFocusedTab=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a k\u00e9r\u0151 elem nem a f\u00f3kuszban l\u00e9v\u0151 lapon van.
FullScreenDeniedContentOnly=A teljes k\u00e9perny\u0151 k\u00e9r\u00e9se megtagadva, mert a k\u00e9r\u0151 elem a chrome dokumentumban van, \u00e9s a teljes k\u00e9perny\u0151s API csak a tartalomhoz van be\u00e1ll\u00edtva.
RemovedFullScreenElement=Kil\u00e9p\u00e9s a teljes k\u00e9perny\u0151b\u0151l, mert a teljes k\u00e9perny\u0151s elem el lett t\u00e1vol\u00edtva a dokumentumb\u00f3l.
FocusedWindowedPluginWhileFullScreen=Kil\u00e9p\u00e9s a teljes k\u00e9perny\u0151b\u0151l, mert egy ablakban fut\u00f3 b\u0151v\u00edtm\u00e9ny ker\u00fclt f\u00f3kuszba.
HTMLSyncXHRWarning=A HTML-feldolgoz\u00e1s az XMLHttpRequest-ben nem t\u00e1mogatott szinkron m\u00f3dban.
InvalidRedirectChannelWarning=Nem siker\u00fclt az \u00e1tir\u00e1ny\u00edt\u00e1s ide\: %S, mert a csatorna nem val\u00f3s\u00edtja meg az nsIWritablePropertyBag2-t.
ResponseTypeSyncXHRWarning=Az XMLHttpRequest responseType attrib\u00fatum\u00e1nak haszn\u00e1lata m\u00e1r nem t\u00e1mogatott szinkron m\u00f3dban az ablak kontextusban.
WithCredentialsSyncXHRWarning=Az XMLHttpRequest withCredentials attrib\u00fatum\u00e1nak haszn\u00e1lata m\u00e1r nem t\u00e1mogatott szinkron m\u00f3dban az ablak kontextusban.
TimeoutSyncXHRWarning=Az XMLHttpRequest timeout attrib\u00fatum\u00e1nak haszn\u00e1lata m\u00e1r nem t\u00e1mogatott szinkron m\u00f3dban az ablak kontextusban.
JSONCharsetWarning=K\u00eds\u00e9rlet t\u00f6rt\u00e9nt nem UTF-8 k\u00f3dol\u00e1s deklar\u00e1l\u00e1s\u00e1ra egy XMLHttpRequest haszn\u00e1lat\u00e1val lek\u00e9rt JSON-hoz. JSON dek\u00f3dol\u00e1s\u00e1hoz csak UTF-8 t\u00e1mogatott.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=Nincs el\u00e9g mem\u00f3ria az AudioBufferSourceNode \u00fajramintav\u00e9telez\u00e9s\u00e9hez lej\u00e1tsz\u00e1shoz.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=A decodeAudioData-nak \u00e1tadott puffer ismeretlen tartalomt\u00edpust tartalmaz.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=Ismeretlen hiba t\u00f6rt\u00e9nt a decodeAudioData feldolgoz\u00e1sa k\u00f6zben.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=A decodeAudioData-nak \u00e1tadott puffer \u00e9rv\u00e9nytelen tartalmat tartalmaz, amely nem dek\u00f3dolhat\u00f3 sikeresen.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=A decodeAudioData-nak \u00e1tadott puffer nem tartalmaz hangot.
MediaLoadExhaustedCandidates=Minden jel\u00f6lt er\u0151forr\u00e1s bet\u00f6lt\u00e9se sikertelen. A m\u00e9dia bet\u00f6lt\u00e9se felf\u00fcggesztve.
MediaLoadSourceMissingSrc=A <source> elemnek nincs \u201esrc\u201d attrib\u00fatuma. A m\u00e9dia-er\u0151forr\u00e1s bet\u00f6lt\u00e9se meghi\u00fasult.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=A HTTP bet\u00f6lt\u00e9s %1$S \u00e1llapottal meghi\u00fasult. A m\u00e9dia-er\u0151forr\u00e1s (%2$S) bet\u00f6lt\u00e9se meghi\u00fasult.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=\u00c9rv\u00e9nytelen URI. A m\u00e9dia-er\u0151forr\u00e1s (%S) bet\u00f6lt\u00e9se meghi\u00fasult.
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute=A(z) \u201e%1$S\u201d megadott \u201etype\u201d attrib\u00fatuma nem t\u00e1mogatott. A m\u00e9dia-er\u0151forr\u00e1s (%2$S) bet\u00f6lt\u00e9se meghi\u00fasult.
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched=A(z) \u201e%1$S\u201d megadott \u201emedia\u201d attrib\u00fatuma nem felel meg a k\u00f6rnyezetnek. A m\u00e9dia-er\u0151forr\u00e1s (%2$S) bet\u00f6lt\u00e9se meghi\u00fasult.
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType=A(z) \u201e%1$S\u201d elemhez tartoz\u00f3 HTTP \u201eContent-Type\u201d nem t\u00e1mogatott. A m\u00e9dia-er\u0151forr\u00e1s (%2$S) bet\u00f6lt\u00e9se meghi\u00fasult.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=A m\u00e9dia-er\u0151forr\u00e1s (%S) dek\u00f3dol\u00e1sa meghi\u00fasult.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=A DOMException code attrib\u00fatum\u00e1nak haszn\u00e1lata elavult. Haszn\u00e1lja helyette a name attrib\u00fatumot.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=A chrome JS objektumainak el\u00e9rhet\u0151v\u00e9 t\u00e9tele a tartalom sz\u00e1m\u00e1ra a __exposedProps__ n\u00e9lk\u00fcl nem biztons\u00e1gos \u00e9s elavult. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt l\u00e1sd\: https\://developer.mozilla.org/en/XPConnect_wrappers
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=A Mutation esem\u00e9nyek haszn\u00e1lata elavult, haszn\u00e1lja helyette a MutationObserver-t.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=A Components objektum elavult. Hamarosan elt\u00e1vol\u00edt\u00e1sra ker\u00fcl.
PluginHangUITitle=Figyelmeztet\u00e9s\: a b\u0151v\u00edtm\u00e9ny nem v\u00e1laszol
PluginHangUIMessage=A(z) %S dolgozik, illetve nem v\u00e1laszol. Meg\u00e1ll\u00edthatja most a b\u0151v\u00edtm\u00e9nyt, vagy folytathatja, h\u00e1tha befejezi a m\u0171k\u00f6d\u00e9s\u00e9t.
PluginHangUIWaitButton=Folytat\u00e1s
PluginHangUIStopButton=B\u0151v\u00edtm\u00e9ny le\u00e1ll\u00edt\u00e1sa
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning=A \u201emozHidden\u201d \u00e9s \u201emozVisibilityState\u201d elavultak. Haszn\u00e1lja helyett\u00fck az el\u0151tag n\u00e9lk\u00fcli \u201ehidden\u201d \u00e9s \u201evisibilityState\u201d elemeket.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=A detach() h\u00edv\u00e1sa egy NodeIterator objektumon m\u00e1r hat\u00e1stalan.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=A [LenientThis] tartalm\u00fa tulajdons\u00e1g get vagy set met\u00f3dus\u00e1nak mell\u0151z\u00e9se, mert a \u201ethis\u201d objektum helytelen
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=A nsIDOMWindowUtils.getOuterWindowWithId() haszn\u00e1lata elavult, helyette haszn\u00e1lja ugyanazon n\u00e9v nsIWindowMediator met\u00f3dus\u00e1t.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=A getPreventDefault() haszn\u00e1lata elavult. Haszn\u00e1lja helyette a defaultPrevented-et.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=A getUserData() vagy setUserData() haszn\u00e1lata elavult. Haszn\u00e1lja helyette WeakMap-et vagy az element.dataset-et.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=A Document.load() haszn\u00e1lata nem helyes. Friss\u00edtse a k\u00f3dj\u00e1t, haszn\u00e1lja a DOM XMLHttpRequest objektumot. Tov\u00e1bbi seg\u00edts\u00e9g\: https\://developer.mozilla.org/en/XMLHttpRequest
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

