#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

readError=%S nu poate fi salvat deoarece nu poate fi citit fi\u0219ierul surs\u0103.\n\n\u00cencerca\u021bi mai t\u00e2rziu, sau lua\u021bi leg\u0103tura cu administratorul serverului.
writeError=%S nu poate fi salvat deoarece a ap\u0103rut o eroare necunoscut\u0103.\n\nNe pare r\u0103u. \u00cencerca\u021bi s\u0103 salva\u021bi \u00een alt loc.
launchError=%S nu poate fi deschis deoarece a ap\u0103rut o eroare necunoscut\u0103.\n\nNe pare r\u0103u. \u00cencerca\u021bi mai \u00eent\u00e2i s\u0103 salva\u021bi pe disc \u0219i apoi s\u0103 deschide\u021bi fi\u0219ierul.
diskFull=Nu exist\u0103 spa\u021biu suficient pe disc pentru a salva %S.\n\n\u0218terge\u021bi fi\u0219iere de prisos de pe disc \u0219i \u00eencerca\u021bi din nou, sau \u00eencerca\u021bi s\u0103 salva\u021bi \u00een alt loc.
readOnly=%S nu poate fi salvat deoarece discul, directorul sau fi\u0219ierul este protejat la scriere.\n\nScoate\u021bi protec\u021bia la scriere a discului \u0219i \u00eencerca\u021bi din nou, sau \u00eencerca\u021bi s\u0103 salva\u021bi \u00een alt loc.
accessError=%S nu poate fi salvat deoarece nu ave\u021bi dreptul de a modifica directorul.\n\nModifica\u021bi permisiunile asupra directorului \u0219i \u00eencerca\u021bi din nou, sau \u00eencerca\u021bi s\u0103 salva\u021bi \u00een alt loc.
SDAccessErrorCardReadOnly=Cannot download file because the SD card is in use.
SDAccessErrorCardMissing=Cannot download file because the SD card is missing.
helperAppNotFound=%S nu poate fi deschis deoarece aplica\u021bia ajut\u0103toare asociat\u0103 nu exist\u0103. Modifica\u021bi asocierea din Preferin\u021be.
noMemory=Nu exist\u0103 memorie suficient\u0103 pentru a \u00eendeplini ac\u021biunea pe care a\u021bi solicitat-o.\n\n\u00cenchide\u021bi unele aplica\u021bii \u0219i \u00eencerca\u021bi din nou.
title=Se descarc\u0103 %S
fileAlreadyExistsError=%S nu poate fi salvat deoarece exist\u0103 deja un fi\u0219ier cu acela\u0219i nume ca \u0219i directorul \u201e_files\u201d.\n\n\u00cencerca\u021bi s\u0103 salva\u021bi \u00een alt loc.
fileNameTooLongError=%S nu poate fi salvat deoarece numele fi\u0219ierului este prea lung.\n\n\u00cencerca\u021bi s\u0103 salva\u021bi \u00eentr-un fi\u0219ier cu nume mai scurt.

