#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

KillScriptTitle=\uacbd\uace0\: \uc6a9\ub7c9 \uacfc\ub2e4\ub85c \ucc98\ub9ac\ud558\uae30 \ud798\ub4e0 \uc2a4\ud06c\ub9bd\ud2b8
KillScriptMessage=\uc2a4\ud06c\ub9bd\ud2b8 \ucc98\ub9ac\ub7c9\uc774 \uacfc\ub3c4\ud558\uc5ec \ud504\ub85c\uadf8\ub7a8\uc774 \ubc18\uc751\ud558\uc9c0 \uc54a\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uc911\uc9c0 \ub610\ub294 \uacc4\uc18d\uc744 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
KillScriptWithDebugMessage=\ud604\uc7ac \ud398\uc774\uc9c0 \uc2a4\ud06c\ub9bd\ud2b8\uac00 \uc2e4\ud589 \uc911\uc774\uac70\ub098 \uc751\ub2f5\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc2a4\ud06c\ub9bd\ud2b8 \uc2e4\ud589\uc744 \uc911\ub2e8\ud558\uac70\ub098 \ub514\ubc84\uac70\ub97c \uc2e4\ud589 \ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
KillScriptLocation=\uc2a4\ud06c\ub9bd\ud2b8\: %S
StopScriptButton=\uc911\uc9c0
DebugScriptButton=\uc2a4\ud06c\ub9bd\ud2b8 \ub514\ubc84\uae45
WaitForScriptButton=\uacc4\uc18d
DontAskAgain=\ub2e4\uc2dc \ubb3b\uc9c0 \uc54a\uc74c
JSURLLoadBlockedWarning=\uc790\ubc14\uc2a4\ud06c\ub9bd\ud2b8 \uc77d\uae30 \uc2dc\ub3c4 \uc911\: \ub2e4\ub978 \ud638\uc2a4\ud2b8\ub85c\ubd80\ud130 \ubc1b\uc740 \ucee8\ud150\ud2b8\ub97c \ucc3d\uc5d0 \ud45c\uc2dc\ud558\ub294 \uc911 \ubcf4\uc548 \uad00\ub9ac\uc790\uc5d0 \uc758\ud574 \uc911\uc9c0\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
WindowCloseBlockedWarning=\uc2a4\ud06c\ub9bd\ud2b8\uc5d0 \uc758\ud574 \uc5f4\ub9ac\uc9c0 \uc54a\uc740 \ucc3d\uc744 \ub2eb\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
OnBeforeUnloadTitle=\ud398\uc774\uc9c0 \ub098\uac00\uae30 \uc5ec\ubd80
OnBeforeUnloadMessage=\ud604\uc7ac \ud398\uc774\uc9c0\ub97c \ub098\uac08 \uc9c0 \uc5ec\ubd80\ub97c \uacb0\uc815\ud569\ub2c8\ub2e4. \uc785\ub825\ud55c \ub370\uc774\ud130\ub294 \uc800\uc7a5\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
OnBeforeUnloadStayButton=\uacc4\uc18d \uc0ac\uc6a9
OnBeforeUnloadLeaveButton=\ub098\uac00\uae30
UnexpectedCanvasVariantStyle=canvas\:  \ubb38\uc790\uc5f4\uc774 \uc544\ub2cc \uac12\uc774 strokeStyle\ub098 fillStyle\ub85c \uc124\uc815 \ud558\uc5ec CanvasGradient\ub098 CanvasPattern\uc740 \ubb34\uc2dc\ud569\ub2c8\ub2e4.
EmptyGetElementByIdParam=\ube48 \ubb38\uc790\uc5f4\uc774 getElementById()\uc5d0 \uc800\uc7a5\ud558\uc600\uc2b5\ub2c8\ub2e4.
LowMemoryTitle=\uacbd\uace0\: \uba54\ubaa8\ub9ac \uacfc\ub2e4 \uc0ac\uc6a9
LowMemoryMessage=\uba54\ubaa8\ub9ac \uacfc\ub2e4 \uc0ac\uc6a9\uc73c\ub85c \ud604\uc7ac \ud398\uc774\uc9c0 \uc2a4\ud06c\ub9bd\ud2b8 \uc2e4\ud589\uc774 \uc911\ub2e8\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
SpeculationFailed=document.write()\ub85c \uc791\uc131\ub41c DOM \ud2b8\ub294 \uc778\ud130\ub137\uc5d0\uc11c \uc5f0\uacb0\ub41c \uc815\ubcf4\ub85c \ubc14\ub014 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ub354 \uc790\uc138\ud55c \uc0ac\ud56d\uc740 https\://developer.mozilla.org/en/Optimizing_Your_Pages_for_Speculative_Parsing \ub97c \ucc38\uace0\ud558\uc138\uc694.
DocumentWriteIgnored=\uc678\ubd80 \uc2a4\ud06c\ub9bd\ud2b8\ub85c \ube44\ub3d9\uae30 \ud638\ucd9c\ub41c document.write()\ub97c \ubb34\uc2dc\ud569\ub2c8\ub2e4.
FormValidationTextTooLong=\ud604\uc7ac \ud14d\uc2a4\ud2b8\ub97c %S\uc790 \uc774\ud558\ub85c \uc904\uc5ec \uc8fc\uc2ed\uc2dc\uc624.(\ud604\uc7ac \uae00\uc790\uc218 %S\uc790)
FormValidationValueMissing=\uc774 \ud56d\ubaa9\uc744 \ud544\uc218\ub85c \uc785\ub825\ud574 \uc8fc\uc2ed\uc2dc\uc624.
FormValidationCheckboxMissing=\uacc4\uc18d\ud558\uc2dc\ub824\uba74 \ud558\ub098 \uc774\uc0c1 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
FormValidationRadioMissing=\uc801\uc5b4\ub3c4 \uc544\ub798 \ud56d\ubaa9 \uc911 \ud558\ub098\ub97c \uc120\ud0dd\ud574 \uc8fc\uc2ed\uc2dc\uc624.
FormValidationFileMissing=\ud30c\uc77c\uc744 \uc120\ud0dd\ud574 \uc8fc\uc2ed\uc2dc\uc624.
FormValidationSelectMissing=\uc801\uc5b4\ub3c4 \uc544\ub798 \ubaa9\ub85d \uc911 \ud558\ub098\ub97c \uc120\ud0dd\ud574 \uc8fc\uc2ed\uc2dc\uc624.
FormValidationInvalidEmail=\uc815\ud655\ud55c \uc774\uba54\uc77c \uc8fc\uc18c\ub97c \uc785\ub825\ud574 \uc8fc\uc2ed\uc2dc\uc624.
FormValidationInvalidURL=\uc815\ud655\ud55c \uc6f9\uc0ac\uc774\ud2b8 \uc8fc\uc18c(URL)\ub97c \uc785\ub825\ud574 \uc8fc\uc2ed\uc2dc\uc624.
FormValidationPatternMismatch=\uc694\uccad\ud55c \ud615\uc2dd\uc73c\ub85c \uc785\ub825\ud574 \uc8fc\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE (FormValidationPatternMismatchWithTitle): %S is the (possibly truncated) title attribute value.
FormValidationPatternMismatchWithTitle=\uc694\uccad\ud55c \ud615\uc2dd\uc73c\ub85c \uc785\ub825\ud574 \uc8fc\uc2ed\uc2dc\uc624. \: %S.
# LOCALIZATION NOTE (FormValidationNumberRangeOverflow): %S is a number.
FormValidationNumberRangeOverflow=Please select a value that is no more than %S.
# LOCALIZATION NOTE (FormValidationDateRangeOverflow): %S is a date.
FormValidationDateRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeOverflow): %S is a time.
FormValidationTimeRangeOverflow=Please select a value that is no later than %S.
# LOCALIZATION NOTE (FormValidationNumberRangeUnderflow): %S is a number.
FormValidationNumberRangeUnderflow=Please select a value that is no less than %S.
# LOCALIZATION NOTE (FormValidationDateRangeUnderflow): %S is a date.
FormValidationDateRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationTimeRangeUnderflow): %S is a time.
FormValidationTimeRangeUnderflow=Please select a value that is no earlier than %S.
# LOCALIZATION NOTE (FormValidationStepMismatch): both %S can be a number, a date or a time.
FormValidationStepMismatch=\uc720\ud6a8\ud55c \uac12\uc744 \uc120\ud0dd\ud574 \uc8fc\uc2ed\uc2dc\uc624. \uac00\uc7a5 \uc720\ud6a8\ud55c \uac12\uc5d0 \uadfc\uc0ac\ud55c \ub450 \uac1c\uc758 \uac12\uc740 %S\uc640 %S \uc785\ub2c8\ub2e4.
# LOCALIZATION NOTE (FormValidationStepMismatchOneValue): %S can be a number, a date or a time. This is called instead of FormValidationStepMismatch when the second value is the same as the first.
FormValidationStepMismatchOneValue=\uc720\ud6a8\ud55c \uac12\uc744 \uc120\ud0dd\ud574 \uc8fc\uc2ed\uc2dc\uc624. \uac00\uc7a5 \uc720\ud6a8\ud55c \uac12\uc5d0 \uadfc\uc0ac\ud55c \uac12\uc740 %S \uc785\ub2c8\ub2e4.
FormValidationBadInputNumber=Please enter a number.
GetAttributeNodeWarning=getAttributeNode()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 getAttribute()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
SetAttributeNodeWarning=setAttributeNode()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 setAttribute()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
GetAttributeNodeNSWarning=getAttributeNodeNS()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 getAttributeNS()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
SetAttributeNodeNSWarning=setAttributeNodeNS()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 setAttributeNS()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
RemoveAttributeNodeWarning=removeAttributeNode()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 removeAttribute()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
CreateAttributeWarning=document.createAttribute()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 element.setAttribute()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
CreateAttributeNSWarning=document.createAttributeNS()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 element.setAttributeNS()\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
OwnerElementWarning=\uc18d\uc131 \uc911 ownerElement \uc18d\uc131\uc740 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
NodeValueWarning=\uc18d\uc131 \uc911 nodeValue \uc18d\uc131\uc740 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 value\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
TextContentWarning=\uc18d\uc131 \uc911 textContent \uc18d\uc131\uc740 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 value\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
EnablePrivilegeWarning=enablePrivilege\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.  \uc2dc\uc2a4\ud15c \ub0b4\ubd80\uc5d0\uc11c \uc0ac\uc6a9\ud558\ub294 \ucf54\ub4dc\uc5d0\uc11c(\uc608\: \ud655\uc7a5 \uae30\ub2a5) \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
nsIJSONDecodeDeprecatedWarning=nsIJSON.decode\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 JSON.parse\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
nsIJSONEncodeDeprecatedWarning=nsIJSON.encode\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 JSON.stringify\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
nsIDOMWindowInternalWarning=nsIDOMWindowInternal\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 nsIDOMWindow\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
InputEncodingWarning=inputEncoding\ub294 \ub354\uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate "MozBeforePaint" and "mozRequestAnimationFrame"
MozBeforePaintWarning=MozBeforePaint \uc774\ubca4\ud2b8\ub294 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. mozRequestAnimationFrame\uc758 \ucf5c\ubc31 \uc778\uc218\uc5d0 null \ub97c \ubcf4\ub0b4\uc904 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
FullScreenDeniedBlocked=\uc0ac\uc6a9\uc790 \uc124\uc815\uc5d0 \uc758\ud574 \uc774 \ub3c4\uba54\uc778 \uc774\uc804 \ud654\uba74 \ud45c\uc2dc\uac00 \ucc28\ub2e8 \ub418\uace0 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc774\uc804 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedDisabled=\uc0ac\uc6a9\uc790 \uc124\uc815\uc5d0 \uc758\ud574 FullScreen API\uac00 \ubb34\ud6a8\ud654\ub418\uace0 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedFocusedPlugin=\uc708\ub3c4\uc6b0\ud654 \ub41c \ud50c\ub7ec\uadf8 \uc778\uc774 \ud3ec\ucee4\uc2a4 \ub418\uace0 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4\ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedHidden=document\ub97c \ubcf4\uc5ec \uc904 \uc218 \uc5c6\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedIframeNotAllowed="allowfullscreen" \uc18d\uc131\uc744 \uac00\uc9c0\uc9c0 \uc54a\ub294 iframe\ub97c \ud3ec\ud568\ud55c document\uac00 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedNotInputDriven=\ub2e8\uc2dc\uac04 \uc2e4\ud589\ub418\ub294 \uc0ac\uc6a9\uc790 \uc0dd\uc131 \uc774\ubca4\ud2b8 \ud578\ub4e4\ub7ec\uc758 \ub0b4\ubd80\ub85c\ubd80\ud130 Element.mozRequestFullScreen() \uba54\uc18c\ub4dc\uac00 \uc694\uccad \ud558\uc9c0 \uc54a\uc558\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedNotInDocument=\uc694\uccad\uc790\uc758 \uc694\uc18c\uac00 document\ub0b4\uc5d0 \uc874\uc7ac\ud558\uc9c0 \uc54a\uac8c \ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedMovedDocument=\uc694\uccad\uc790\uc758 \uc694\uc18c\uac00 document\ub97c \uc774\ub3d9\ud588\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedLostWindow=\uc708\ub3c4\uc6b0\uac00 \uc874\uc7ac\ud558\uc9c0 \uc54a\uac8c \ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedSubDocFullScreen=\uc694\uccad\uc790\uc758 document \uc11c\ube0c \ubb38\uc11c\uac00 \ubc8c\uc368 \uc804\ud654\uba74 \ud45c\uc2dc\uc774\uae30 \uc704\ud574, \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedNotDescendant=\uc694\uccad\uc790\uc758 \uc694\uc18c\uac00 \ud604\uc7ac\uc758 FullScreen \uc694\uc18c\uc758 \uc790\uc2dd\uc774 \uc544\ub2c8\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedNotFocusedTab=\uc694\uccad\uc790\uc758 \uc694\uc18c\uac00 \ud604\uc7ac\uc758 \ud3ec\ucee4\uc2a4 \ub41c \ud0ed\uc774 \uc544\ub2c8\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
FullScreenDeniedContentOnly=\uc694\uccad\uc790\uc758 \uc694\uc18c\uac00 chrome document\ub0b4\uc5d0 \uc874\uc7ac\ud558\uace0 Fullscreen API\uac00 \ucf58\ud150\uce20\ub9cc \uc0ac\uc6a9\ud558\ub3c4\ub85d \uc124\uc815\ub418\uc5b4 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc \uc694\uccad\uc774 \uac70\ubd80\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
RemovedFullScreenElement=FullScreen \uc694\uc18c\uac00 document \ub85c\ubd80\ud130 \uc0ad\uc81c\ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc\ub97c \ud574\uc81c\ud588\uc2b5\ub2c8\ub2e4.
FocusedWindowedPluginWhileFullScreen=\uc708\ub3c4\uc6b0 \ud50c\ub7ec\uadf8 \uc778\uc774 \ud3ec\ucee4\uc2a4 \ub418\uc5c8\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \ud654\uba74 \ud45c\uc2dc\ub97c \ud574\uc81c\ud588\uc2b5\ub2c8\ub2e4.
HTMLSyncXHRWarning=\ub3d9\uae30 \ubaa8\ub4dc\uc5d0 \uc788\uc5b4\uc11c\uc758 XMLHttpRequest \uc911\uc758 HTML \ud37c\uc2a4\ub294 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
InvalidRedirectChannelWarning=channel\uc774 nsIWritablePropertyBag2\ub97c \uad6c\ud604\ud558\uace0 \uc788\uc9c0 \uc54a\uae30 \ub54c\ubb38\uc5d0 %S\uc5d0 \ub9ac\ub514\ub809\ud2b8 \ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
ResponseTypeSyncXHRWarning=window \ubb38\ub9e5\uc758 \ub3d9\uae30 \ubaa8\ub4dc\uc5d0 \uc788\uc5b4\uc11c\uc758 XMLHttpRequest \uc758 responseType \ud504\ub85c\ud37c\ud2f0\uc758 \uc0ac\uc6a9\uc740 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uac8c \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
WithCredentialsSyncXHRWarning=window \ubb38\ub9e5\uc758 \ub3d9\uae30 \ubaa8\ub4dc\uc5d0 \uc788\uc5b4\uc11c\uc758 XMLHttpRequest \uc758 withCredentials \ud504\ub85c\ud37c\ud2f0\uc758 \uc0ac\uc6a9\uc740 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uac8c \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
TimeoutSyncXHRWarning=XMLHttpRequest\uc758 timeout \uc18d\uc131 \uc0ac\uc6a9\uc740 window \ubb38\ub9e5\uc758 \ub3d9\uae30 \ubaa8\ub4dc\uc5d0\uc11c\ub294 \uc9c0\uc6d0\ud558\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
JSONCharsetWarning=XMLHttpRequest\ub97c \uc0ac\uc6a9\ud574 \ucde8\ub4dd\ud55c JSON\uc5d0 \ub300\ud574\uc11c UTF-8\uac00 \uc544\ub2cc \ubb38\uc790 \uc778\ucf54\ub529\uc774 \uc120\uc5b8\ub418\uc5c8\uc2b5\ub2c8\ub2e4. JSON \uc758 \ub514\ucf54\ub4dc\ub294 UTF-8\ub9cc \uc9c0\uc6d0\ub429\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate AudioBufferSourceNode
MediaBufferSourceNodeResampleOutOfMemory=AudioBufferSourceNode\uc744 \ub9ac\uc0d8\ud50c\ub9c1\ud558\uc5ec \uc7ac\uc0dd\ud558\uae30\uc5d0\ub294 \uba54\ubaa8\ub9ac\uac00 \ubd80\uc871\ud569\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownContentType=decodeAudioData\ub85c \ubcf4\ub0b8 \ubc84\ud37c\uc5d0\ub294 \uc54c \uc218 \uc5c6\ub294 \ucf58\ud150\uce20 \ud615\uc2dd\uc774 \ub4e4\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataUnknownError=decodeAudioData\ub97c \ucc98\ub9ac \uc911 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataInvalidContent=decodeAudioData\ub85c \ubcf4\ub0b8 \ubc84\ud37c\uc5d0\ub294 \ub514\ucf54\ub529\uc744 \ud560 \uc218 \uc5c6\ub294 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc740 \ucf58\ud150\uce20\uac00 \ub4e4\uc5b4\uc788\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate decodeAudioData.
MediaDecodeAudioDataNoAudio=decodeAudioData\ub85c \ubcf4\ub0b8 \ubc84\ud37c\uc5d0\ub294 \uc624\ub514\uc624\uac00 \ub4e4\uc5b4\uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
MediaLoadExhaustedCandidates=\uc790\uc6d0 \ud6c4\ubcf4\uc758 \uc77d\uae30\uac00 \ubaa8\ub450 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.\ubbf8\ub514\uc5b4\uc758 \uc7ac\uc0dd\uc744 \uc911\uc9c0\ud569\ub2c8\ub2e4.
MediaLoadSourceMissingSrc=<source> \uc694\uc18c\uc5d0 "src" \uc18d\uc131\uc774 \uc5c6\uc2b5\ub2c8\ub2e4. \ubbf8\ub514\uc5b4\ub97c \uc77d\uc5b4\ub4e4\uc77c \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: %1$S is the Http error code the server returned (e.g. 404, 500, etc), %2$S is the URL of the media resource which failed to load.
MediaLoadHttpError=HTTP \ud1b5\uc2e0\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4. \uc0c1\ud0dc \uc815\ubcf4\: %1$S \ubbf8\ub514\uc5b4 %2$S \ub97c \uc77d\uc5b4\ub4e4\uc77c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load.
MediaLoadInvalidURI=URI\uac00 \uc62c\ubc14\ub974\uc9c0\ub294 \uc54a\uc2b5\ub2c8\ub2e4. \ubbf8\ub514\uc5b4 %S\ub97c \uc77d\uc5b4\ub4e4\uc77c \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: %1$S is the media resource's format/codec type (basically equivalent to the file type, e.g. MP4,AVI,WMV,MOV etc), %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedTypeAttribute="%1$S"\ub85c \uc9c0\uc815\ub41c "type" \uc18d\uc131\uc740 \uae30\uc220 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ubbf8\ub514\uc5b4 %2$S\ub97c \uc77d\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: %1$S is the "media" attribute value of the <source> element. It is a media query. %2$S is the URL of the media resource which failed to load.
MediaLoadSourceMediaNotMatched="%1$S"\ub85c \uc9c0\uc815\ub41c "media" \uc18d\uc131\uc740 \ud658\uacbd\uacfc \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ubbf8\ub514\uc5b4 %2$S\ub97c \uc77d\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: %1$S is the MIME type HTTP header being sent by the web server, %2$S is the URL of the media resource which failed to load.
MediaLoadUnsupportedMimeType="%1$S" \uc758 HTTP "Content-Type"\ub294 \uc9c0\uc6d0\ub418\uace0 \uc788\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.\ubbf8\ub514\uc5b4 %2$S \ub97c \uc77d\uc5b4\ub4e4\uc77c \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: %S is the URL of the media resource which failed to load because of error in decoding.
MediaLoadDecodeError=\ubbf8\ub514\uc5b4 %S\ub97c \uc7ac\uc0dd\ud560 \uc218 \uc5c6\uc5c8\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate "DOMException", "code" and "name"
DOMExceptionCodeWarning=DOMException\uc758 code \uc18d\uc131\uc758 \uc0ac\uc6a9\uc740 \ucd94\ucc9c\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 name \uc18d\uc131\uc744 \uc0ac\uc6a9\ud574 \uc8fc\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "__exposedProps__"
NoExposedPropsWarning=chrome JS \uac1d\uccb4\ub97c __exposedProps__\uc5d0 \ud3ec\ud568\ud558\uc9c0 \uc54a\uace0 \uc2dc\uc791\ud558\ub294 \uac83\uc740 \uc548\uc804\ud558\uc9c0 \uc54a\uae30 \ub54c\ubb38\uc5d0 \ucd94\ucc9c\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc790\uc138\ud55c \uac83\uc740 https\://developer.mozilla.org/en/XPConnect_wrappers\ub97c \ucc38\uc870\ud574 \uc8fc\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "Mutation Event" and "MutationObserver"
MutationEventWarning=Mutation Event \uc0ac\uc6a9\uc740 \ucd94\ucc9c\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0\uc5d0 MutationObserver\ub97c \uc0ac\uc6a9\ud574 \uc8fc\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "Components"
ComponentsWarning=Component \uac1d\uccb4 \uc0ac\uc6a9\uc740 \ucd94\ucc9c\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc870\ub9cc\uac04 \uc0ad\uc81c\ub420 \uac83\uc785\ub2c8\ub2e4.
PluginHangUITitle=\uacbd\uace0\: \ud50c\ub7ec\uadf8\uc778 \ubc18\uc751 \uc5c6\uc74c
PluginHangUIMessage=%S\uac00 \ubc14\uc058\uac70\ub098 \uba48\ucd98 \uac83 \uac19\uc2b5\ub2c8\ub2e4. \uc9c0\uae08 \ud50c\ub7ec\uadf8\uc778\uc744 \uc815\uc9c0\uc2dc\ud0a4\uac70\ub098 \uc644\ub8cc\ub420 \ub54c\uae4c\uc9c0 \uae30\ub2e4\ub9b4 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
PluginHangUIWaitButton=\uacc4\uc18d\ud558\uae30
PluginHangUIStopButton=\ud50c\ub7ec\uadf8\uc778 \uc815\uc9c0\ud558\uae30
# LOCALIZATION NOTE: Do not translate "mozHidden", "mozVisibilityState", "hidden", or "visibilityState"
PrefixedVisibilityApiWarning='mozHidden'\uacfc 'mozVisibilityState'\ub294 \ucd94\ucc9c\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.  \ub300\uc2e0 \uc811\ub450\uc0ac\ub97c \ube80 'hidden'\uacfc 'visibilityState'\ub97c \uc0ac\uc6a9\ud574 \uc8fc\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "NodeIterator" or "detach()".
NodeIteratorDetachWarning=NodeIterator\uc5d0 detach()\ub97c \ud638\ucd9c\ud558\uc5ec\ub3c4 \ub354 \uc774\uc0c1 \uc601\ud5a5\uc744 \uc8fc\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate "LenientThis" and "this"
LenientThisWarning=Ignoring get or set of property that has [LenientThis] because the "this" \uac1d\uccb4\uac00 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc73c\ubbc0\ub85c [LenientThis]\uac00 \uc788\ub294 \uc18d\uc131\uc744 \uac00\uc838\uc624\uac70\ub098 \uc124\uc815\ud558\ub294 \uac83\uc740 \ubb34\uc2dc\ub429\ub2c8\ub2e4.
# LOCALIZATION NOTE: Do not translate "nsIDOMWindowUtils", "getWindowWithOuterId", or "nsIWindowMediator"
GetWindowWithOuterIdWarning=nsIDOMWindowUtils.getOuterWindowWithId()\uc740 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 \uac19\uc740 \uc774\ub984\uc758 nsIWindowMediator \ud638\ucd9c\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "getPreventDefault" or "defaultPrevented".
GetPreventDefaultWarning=getPreventDefault()\uc758 \uc0ac\uc6a9\uc740 \uad8c\uc7a5\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 defaultPrevented\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "getUserData", "setUserData", "WeakMap", or "element.dataset".
GetSetUserDataWarning=getUserData()\uc640 setUserData()\uc758 \uc0ac\uc6a9\uc740 \uad8c\uc7a5\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 WeakMap\uacfc element.dataset\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "mozGetAsFile" or "toBlob"
MozGetAsFileWarning=The non-standard mozGetAsFile method is deprecated and will soon be removed.  Use the standard toBlob method instead.
# LOCALIZATION NOTE: Do not translate "captureEvents()" or "addEventListener()"
UseOfCaptureEventsWarning=Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.addEventListener
# LOCALIZATION NOTE: Do not translate "releaseEvents()" or "removeEventListener()"
UseOfReleaseEventsWarning=Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http\://developer.mozilla.org/en/docs/DOM\:element.removeEventListener
# LOCALIZATION NOTE: Do not translate "document.load()" or "XMLHttpRequest"
UseOfDOM3LoadMethodWarning=Document.load()\ub294 \ub354 \uc774\uc0c1 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub300\uc2e0 DOM XMLHttpRequest \uac1d\uccb4\ub97c \uc0ac\uc6a9\ud558\uc2dc\uae30 \ubc14\ub78d\ub2c8\ub2e4. \ub354 \uc790\uc138\ud55c \uc0ac\ud56d\uc740 http\://developer.mozilla.org/en/XMLHttpRequest \ub97c \ucc38\uace0\ud558\uc2ed\uc2dc\uc624.
# LOCALIZATION NOTE: Do not translate "window.showModalDialog()" or "window.open()" 
ShowModalDialogWarning=Use of window.showModalDialog() is deprecated. Use window.open() instead. For more help https\://developer.mozilla.org/en-US/docs/Web/API/Window.open
# LOCALIZATION NOTE: Do not translate "window._content" or "window.content"
Window_ContentWarning=window._content is deprecated.  Please use window.content instead.
# LOCALIZATION NOTE: Do not translate "XMLHttpRequest"
SyncXMLHttpRequestWarning=Synchronous XMLHttpRequest on the main thread is deprecated because of its detrimental effects to the end user's experience. For more help http\://xhr.spec.whatwg.org/
ImplicitMetaViewportTagFallback=No meta-viewport tag found. Please explicitly specify one to prevent unexpected behavioural changes in future versions. For more help https\://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag
# LOCALIZATION NOTE: Do not translate "DataContainerEvent" or "CustomEvent"
DataContainerEventWarning=Use of DataContainerEvent is deprecated. Use CustomEvent instead.
# LOCALIZATION NOTE: Do not translate "sendAsBinary" or "send(Blob data)"
SendAsBinaryWarning=The non-standard sendAsBinary method is deprecated and will soon be removed. Use the standard send(Blob data) method instead.
# LOCALIZATION NOTE: Do not translate "window.controllers"
Window_ControllersWarning=window.controllers is deprecated. Do not use it for UA detection.
ImportXULIntoContentWarning=Importing XUL nodes into a content document is deprecated. This functionality may be removed soon.
XMLDocumentLoadPrincipalMismatch=Use of document.load forbidden on Documents that come from other Windows. Only the Window in which a Document was created is allowed to call .load on that Document. Preferably, use XMLHttpRequest instead.
# LOCALIZATION NOTE: Do not translate "IndexedDB".
IndexedDBTransactionAbortNavigation=An IndexedDB transaction that was not yet complete has been aborted due to page navigation.
# LOCALIZATION NOTE (WillChangeBudgetWarning): Do not translate Will-change, %1$S,%2$S,%3$S are numbers.
WillChangeBudgetWarning=Will-change memory consumption is too high. Surface area covers %1$S pixels, budget is the document surface area multiplied by %2$S (%3$S pixels). All occurences of will-change in the document are ignored when over budget.

