#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Nu se poate stabili o comunicare sigur\u0103. Serverul de la distan\u021b\u0103 nu suport\u0103 criptare de grad \u00eenalt.
SSL_ERROR_US_ONLY_SERVER=Nu se poate stabili o conexiune sigur\u0103. Serverul de la distan\u021b\u0103 necesit\u0103 criptare de grad \u00eenalt, criptare care nu e suportat\u0103 de clientul care-l folosi\u021bi.
SSL_ERROR_NO_CYPHER_OVERLAP=Nu se poate stabili o conexiune sigur\u0103 cu serverul\: nu e suportat niciun algoritm de criptare.
SSL_ERROR_NO_CERTIFICATE=Nu se poate g\u0103si certificatul sau cheia necesar\u0103 pentru autentificare.
SSL_ERROR_BAD_CERTIFICATE=Nu se poate stabili o conexiune sigur\u0103 cu serverul de la distan\u021b\u0103\: certificatul serverului a fost respins.
SSL_ERROR_UNUSED_5=Cod de eroare SSL nerecunoscut.
SSL_ERROR_BAD_CLIENT=Serverul a primit date nea\u0219teptate de la client.
SSL_ERROR_BAD_SERVER=Clientul a primit date nea\u0219teptate de la server.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Tip nesuportat de certificat.
SSL_ERROR_UNSUPPORTED_VERSION=Serverul folose\u0219te o versiune nesuportat\u0103 a protocolului de securitate.
SSL_ERROR_UNUSED_10=Cod de eroare SSL nerecunoscut.
SSL_ERROR_WRONG_CERTIFICATE=Autentificarea clientului a e\u0219uat\: cheia privat\u0103 din baza de date a cheilor nu se potrive\u0219te cu cheia public\u0103 din baza de date a certificatelor.
SSL_ERROR_BAD_CERT_DOMAIN=Nu se poate comunica securizat cu partenerul\: numele domeniului solicitat nu corespunde cu certificatul serverului.
SSL_ERROR_POST_WARNING=Cod de eroare SSL nerecunoscut.
SSL_ERROR_SSL2_DISABLED=Serverul aflat la distan\u021b\u0103 suport\u0103 doar SSL versiunea 2, versiune care este dezactivat\u0103 local.
SSL_ERROR_BAD_MAC_READ=SSL a primit o \u00eenregistrare cu un cod de autentificare a mesajului incorect.
SSL_ERROR_BAD_MAC_ALERT=Partenerul SSL raporteaz\u0103 un cod incorect de autentificare a mesajului.
SSL_ERROR_BAD_CERT_ALERT=Partenerul SSL nu poate verifica certificatul dumneavoastr\u0103.
SSL_ERROR_REVOKED_CERT_ALERT=Partenerul SSL a respins certificatul dumneavoastr\u0103 ca fiind revocat.
SSL_ERROR_EXPIRED_CERT_ALERT=Partenerul SSL a respins certificatul dumneavoastr\u0103 ca fiind expirat.
SSL_ERROR_SSL_DISABLED=Nu se poate conecta\: SSL este dezactivat.
SSL_ERROR_FORTEZZA_PQG=Conectare imposibil\u0103\: partenerul SSL este \u00eentr-un alt domeniu FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=S-a cerut o suit\u0103 necunoscut\u0103 de cifrare SSL.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Nu sunt prezente \u0219i activate \u00een acest program niciun fel de suite de cifrare.
SSL_ERROR_BAD_BLOCK_PADDING=SSL a primit o \u00eenregistrare cu blocuri formatate gre\u0219it.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL a primit o \u00eenregistrare care dep\u0103\u0219e\u0219te lungimea maxim\u0103 permis\u0103.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL a \u00eencercat s\u0103 trimit\u0103 o list\u0103 care dep\u0103\u0219e\u0219te lungimea maxim\u0103 permis\u0103.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL a primit un mesaj incorect \u00een urma cererii de negociere \u201eHello\u201d.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eClient Hello\u201d.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eServer Hello\u201d.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eCertificate\u201d.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eServer Key Exchange\u201d.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eCertificate Request\u201d.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eServer Hello Done\u201d.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eCertificate Verify\u201d.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eClient Key Exchange\u201d.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL a primit un mesaj de negociere formatat gre\u0219it de tip \u201eFinished\u201d.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL a primit o \u00eenregistrare formatat\u0103 gre\u0219it de tip \u201eChange Cipher Spec\u201d.
SSL_ERROR_RX_MALFORMED_ALERT=SSL a primit o \u00eenregistrare de tip Alert formatat\u0103 gre\u0219it.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL a primit o \u00eenregistrare de tip Handshake formatat\u0103 gre\u0219it.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL a primit o \u00eenregistrare de tip Application Data formatat\u0103 gre\u0219it.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL a primit un mesaj nea\u0219teptat de negociere de tip Hello Request.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL a primit un mesaje de negociere nea\u0219teptat de tip Client Hello.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL a primit un mesaj nea\u0219teptat de negociere de tip Server Hello.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL a primit un mesaj de negociere nea\u0219teptat de tip Certificate.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL a primit un mesaj de negociere nea\u0219teptat de tip Server Key Exchange.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL a primit un mesaj de negociere nea\u0219teptat de tip Certificate Request.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL a primit un mesaj de negociere nea\u0219teptat de tip Server Hello Done.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL a primit un mesaj de negociere nea\u0219teptat de tip Certificate Verify.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL a primit un mesaj de negociere nea\u0219teptat de tip Client Key Exchange.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL a primit un mesaj de negociere nea\u0219teptat de tip Finished.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL a primit o \u00eenregistrare nea\u0219teptat\u0103 de tip Change Cipher Spec.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL a primit o \u00eenregistrare nea\u0219teptat\u0103 de tip Alert.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL a primit o \u00eenregistrare nea\u0219teptat\u0103 de tip Handshake.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL a primit o \u00eenregistrare nea\u0219teptat\u0103 de tip Application Data.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL a primit o list\u0103 cu un tip necunoscut de con\u021binut.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL a primit un mesaj de negociere, mesaj al c\u0103rui tip nu este cunoscut.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL a primit o \u00eenregistrare de tip alert\u0103 cu o descriere necunoscut\u0103 a alertei.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Partenerul de conexiune SSL a \u00eenchis aceast\u0103 conexiune.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Partenerul de conexiune SSL a primit un mesaj de conectare pe care nu \u00eel a\u0219tepta.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=Partenerul de conexiune SSL nu a putut s\u0103 decomprime corect o \u00eenregistrare SSL primit\u0103.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=Partenerul de conexiune SSL nu a reu\u0219it sa negocieze un set acceptabil de parametri de securitate.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Partenerul de conexiune SSL a respins un mesaj de conectare datorit\u0103 con\u021binutului inacceptabil.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Partenerul de conexiune SSL nu accept\u0103 certificate de tipul primit.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Partenerul de conexiune SSL a avut o problem\u0103 nespecificat\u0103 cu certificatul primit.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL a experimentat un e\u0219ec al generatorului s\u0103u de numere aleatorii.
SSL_ERROR_SIGN_HASHES_FAILURE=Imposibil de semnat digital datele necesare pentru verificarea certificatului dumneavoastr\u0103.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL nu a reu\u0219it s\u0103 extrag\u0103 cheia public\u0103 din certificatul partenerului de conexiune.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=E\u0219ec necunoscut \u00een timpul proces\u0103rii negocierii SSL Server Key Exchange.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=E\u0219ec necunoscut \u00een timpul proces\u0103rii negocierii SSL Client Key Exchange.
SSL_ERROR_ENCRYPTION_FAILURE=Algoritmul de criptare \u00een mas\u0103 a datelor a e\u0219uat \u00een suita de cifrare selectat\u0103.
SSL_ERROR_DECRYPTION_FAILURE=Algoritmul de decriptare a \u00een mas\u0103 a datelor a e\u0219uat \u00een suita de cifrare selectat\u0103.
SSL_ERROR_SOCKET_WRITE_FAILURE=\u00cencercarea de a scrie datele criptate \u00een soclul de baz\u0103 a e\u0219uat.
SSL_ERROR_MD5_DIGEST_FAILURE=Func\u021bia MD5 digest a e\u0219uat.
SSL_ERROR_SHA_DIGEST_FAILURE=Func\u021bia SHA-1 digest a e\u0219uat.
SSL_ERROR_MAC_COMPUTATION_FAILURE=E\u0219ec \u00een calcularea MAC-ului.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=E\u0219ec \u00een crearea contextului cheii simetrice.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=E\u0219ec la despachetarea cheii Symmetric din mesajul Client Key Exchange.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Serverul SSL a \u00eencercat s\u0103 foloseasc\u0103 cheia public\u0103 pentru uz local cu suita de cifrare pentru export.
SSL_ERROR_IV_PARAM_FAILURE=Codul PKCS11 a e\u0219uat s\u0103 translateze un IV \u00eentr-un parametru.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=E\u0219ec la ini\u021bializarea suitei de cifrare selectate.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Clientul a e\u0219uat \u00een generarea unor chei de sesiune pentru sesiunea SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Serverul nu are nicio cheie pentru algoritmul de schimb de chei care a fost \u00eencercat.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=Identificatorul PKCS\#11 a fost inserat sau eliminat \u00een timpul desf\u0103\u0219ur\u0103rii opera\u021biei.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Nu s-a g\u0103sit niciun identificator PKCS\#11 pentru a efectua o opera\u021bie necesar\u0103.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Nu se poate comunica sigur cu partenerul de conexiune\: nu exist\u0103 niciun algoritm comun de comprimare.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Nu se poate \u00eencepe o alt\u0103 negociere SSL p\u00e2n\u0103 ce cea actual\u0103 nu este completat\u0103.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=S-au primit valori hash de conectare gre\u0219ite din partea partenerului de conexiune.
SSL_ERROR_CERT_KEA_MISMATCH=Certificatul furnizat nu poate fi folosit cu algoritmul de schimb de chei selectat.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Nicio autoritate de certificare nu este de \u00eencredere pentru autentificarea clientului SSL.
SSL_ERROR_SESSION_NOT_FOUND=Identificatorul sesiunii SSL a clientului nu a fost g\u0103sit \u00een cache-ul sesiunii serverului.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Partenerul de conexiune nu a putut s\u0103 decripteze o \u00eenregistrare SSL pe care a primit-o.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Partenerul de conexiune a primit o \u00eenregistrare SSL mai lung\u0103 dec\u00e2t este permis.
SSL_ERROR_UNKNOWN_CA_ALERT=Partenerul de conexiune nu recunoa\u0219te \u0219i nu are \u00eencredere \u00een AC care a emis certificatul dvs.
SSL_ERROR_ACCESS_DENIED_ALERT=Partenerul de conexiune a primit un certificat valid, dar accesul a fost refuzat.
SSL_ERROR_DECODE_ERROR_ALERT=Partenerul de conexiune nu poate decripta un mesaj de conectare SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=Partenerul de conexiune raporteaz\u0103 o eroare la verificarea semn\u0103turii sau la schimbul de chei.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Partenerul de conexiune raporteaz\u0103 o negociere care nu respect\u0103 reglement\u0103rile privitoare la export.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Partenerul de conexiune raporteaz\u0103 o versiune incompatibil\u0103 sau nesuportat\u0103 a protocolului.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Serverul necesit\u0103 cifruri mai sigure dec\u00e2t cele suportate de c\u0103tre client.
SSL_ERROR_INTERNAL_ERROR_ALERT=Partenerul de conexiune raporteaz\u0103 c\u0103 a avut o eroare intern\u0103.
SSL_ERROR_USER_CANCELED_ALERT=Utilizatorul de la cel\u0103lalt cap\u0103t al conexiunii a anulat conectarea.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Partenerul de conexiune nu permite renegocierea parametrilor de securitate SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Cache-ul serverului SSL nu este configurat \u0219i nu este dezactivat pentru acest socket.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Partenerul de conexiune SSL nu suport\u0103 extensia TLS de ini\u021biere cerut\u0103.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Partenerul de conexiune SSL nu poate ob\u021bine certificatul dvs. de la URL-ul indicat.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Partenerul de conexiune SSL nu are niciun certificat pentru numele DNS cerut.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Partenerul de conexiune SSL nu a putut s\u0103 ob\u021bin\u0103 un r\u0103spuns OCSP pentru certificatul s\u0103u.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Partenerul de conexiune SSL a raportat o valoare hash gre\u0219it\u0103 a certificatului.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL a primit un tichet de sesiune nou\u0103 nea\u0219teptat \u00een mesajul de negociere.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL a primit un tichet de sesiune nou\u0103 formatat gre\u0219it \u00een mesajul de negociere.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL a primit o \u00eenregistrare comprimat\u0103 care nu a putut fi decomprimat\u0103.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Renegocierea nu este permis\u0103 pe acest soclu SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=Partenerul a \u00eencercat o negociere \u00een stil vechi (poten\u021bial de vulnerabilitate).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL a primit o \u00eenregistrare nea\u0219teptat\u0103 necomprimat\u0103.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL a primit o cheie temporar\u0103 slab\u0103 Diffie-Hellman \u00een timpul schimbului de chei cu serverul.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL a primit date invalide de la extensia NPN.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Func\u021bia SSL nu este suporat\u0103 de conexiunile SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Func\u021bia SSL nu este suportat\u0103 de servere.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Func\u021bia SSL nu este suportat\u0103 de clien\u021bi.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=A intervenit o eroare I/O \u00een timpul autoriz\u0103rii securizate.
SEC_ERROR_LIBRARY_FAILURE=eroare a bibliotecii de securitate.
SEC_ERROR_BAD_DATA=biblioteca de securitate\: s-au primit date gre\u0219ite.
SEC_ERROR_OUTPUT_LEN=biblioteca de securitate\: lungimea ie\u0219irii este eronat\u0103.
SEC_ERROR_INPUT_LEN=biblioteca de securitate a dat peste o lungime eronat\u0103 a intr\u0103rii.
SEC_ERROR_INVALID_ARGS=biblioteca de securitate\: argumente invalide.
SEC_ERROR_INVALID_ALGORITHM=biblioteca de securitate\: algoritm invalid.
SEC_ERROR_INVALID_AVA=biblioteca de securitate\: AVA invalid.
SEC_ERROR_INVALID_TIME=\u0218ir pentru timp \u00een format incorect.
SEC_ERROR_BAD_DER=biblioteca de securitate\: mesaj codat cu DER \u00een format impropriu.
SEC_ERROR_BAD_SIGNATURE=Certificatul partenerului are o semn\u0103tur\u0103 invalid\u0103.
SEC_ERROR_EXPIRED_CERTIFICATE=Certificatul partenerului a expirat.
SEC_ERROR_REVOKED_CERTIFICATE=Certificatul partenerului a fost revocat.
SEC_ERROR_UNKNOWN_ISSUER=Emitentul certificatului partenerului nu este recunoscut.
SEC_ERROR_BAD_KEY=Cheia public\u0103 a partenerului este invalid\u0103.
SEC_ERROR_BAD_PASSWORD=Parola de securitate introdus\u0103 este incorect\u0103.
SEC_ERROR_RETRY_PASSWORD=Parola nou\u0103 e incorect\u0103. \u00cencerca\u021bi din nou.
SEC_ERROR_NO_NODELOCK=biblioteca de securitate\: niciun nod blocat.
SEC_ERROR_BAD_DATABASE=biblioteca de securitate\: baz\u0103 de date gre\u0219it\u0103.
SEC_ERROR_NO_MEMORY=biblioteca de securitate\: eroare de alocare a memoriei.
SEC_ERROR_UNTRUSTED_ISSUER=Emitentul certificatului partenerului a fost marcat ca nefiind de \u00eencredere de c\u0103tre utilizator.
SEC_ERROR_UNTRUSTED_CERT=Certificatul partenerului a fost marcat ca nefiind de \u00eencredere de utilizator.
SEC_ERROR_DUPLICATE_CERT=Certificatul exist\u0103 deja \u00een baza dumneavoastr\u0103 de date.
SEC_ERROR_DUPLICATE_CERT_NAME=Numele certificatului preluat repet\u0103 unul deja existent \u00een baza ta de date.
SEC_ERROR_ADDING_CERT=Eroare la ad\u0103ugarea certificatului la baza de date.
SEC_ERROR_FILING_KEY=Eroare de scriere a cheii pentru acest certificat.
SEC_ERROR_NO_KEY=Cheia privat\u0103 pentru acest certificat nu poate fi g\u0103sit\u0103 \u00een baza de date cu chei
SEC_ERROR_CERT_VALID=Acest certificat este valid.
SEC_ERROR_CERT_NOT_VALID=Acest certificat nu este valid.
SEC_ERROR_CERT_NO_RESPONSE=Colec\u021bia de certificate\: Niciun r\u0103spuns
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Certificatului emitentului a expirat. Verifica\u021bi data \u0219i ora sistemului dumneavoastr\u0103.
SEC_ERROR_CRL_EXPIRED=CRL-ul emitentului certificatului a expirat. Actualiza\u021bi-l sau verifica\u021bi data \u0219i ora sistemului.
SEC_ERROR_CRL_BAD_SIGNATURE=Lista CRL pentru emitentul certificatului are o semn\u0103tur\u0103 invalid\u0103.
SEC_ERROR_CRL_INVALID=Formatul CRL-ului nou nu este valid.
SEC_ERROR_EXTENSION_VALUE_INVALID=Extensia certificatului este invalid\u0103.
SEC_ERROR_EXTENSION_NOT_FOUND=Nu s-a g\u0103sit extensia certificatului.
SEC_ERROR_CA_CERT_INVALID=Certificatul de emitent este invalid.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Constr\u00e2ngerea de lungime a c\u0103ii c\u0103tre certificat este invalid\u0103.
SEC_ERROR_CERT_USAGES_INVALID=C\u00e2mpul de utilizare a certificatului este nevalid.
SEC_INTERNAL_ONLY=**Modul DOAR pentru uz intern**
SEC_ERROR_INVALID_KEY=Cheia nu suport\u0103 opera\u021bia cerut\u0103.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Certificatul con\u021bine o extensie critic\u0103 necunoscut\u0103.
SEC_ERROR_OLD_CRL=Noua list\u0103 CRL nu este mai nou\u0103 dec\u00e2t cea curent\u0103.
SEC_ERROR_NO_EMAIL_CERT=Nu este criptat sau semnat\: nu ave\u021bi \u00eenc\u0103 un certificat de email.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Nu este criptat\: nu ave\u021bi certificate pentru fiecare destinatar.
SEC_ERROR_NOT_A_RECIPIENT=Nu se poate decripta\: nu sunte\u021bi destinatar sau nu a fost g\u0103sit\u0103 cheia privat\u0103 sau certificatul privat care s\u0103 se potriveasc\u0103.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Nu se poate decripta\: cheia algoritmului de criptare nu corespunde cu certificatul dumneavoastr\u0103.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Verificarea semn\u0103turii a e\u0219uat\: nu s-a g\u0103sit niciun semnatar, au fost g\u0103si\u021bi prea mul\u021bi sau datele sunt incorecte sau corupte.
SEC_ERROR_UNSUPPORTED_KEYALG=Algoritm de criptare nesuportat sau necunoscut.
SEC_ERROR_DECRYPTION_DISALLOWED=Nu se poate decripta\: criptat cu ajutorul unui algoritm nepermis sau o m\u0103rime nepermis\u0103 de cheie.
XP_SEC_FORTEZZA_BAD_CARD=Cardul Fortezza nu a fost ini\u021bializat corect. V\u0103 rug\u0103m s\u0103-l scoate\u021bi \u0219i s\u0103-l \u00eenapoia\u021bi persoanei care l-a emis.
XP_SEC_FORTEZZA_NO_CARD=Nu a fost g\u0103sit niciun card Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=Nu a fost selectat niciun card Fortezza
XP_SEC_FORTEZZA_MORE_INFO=Selecta\u021bi o personalitate pentru a ob\u021bine mai multe informa\u021bii despre ea
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Personalitatea nu a fost g\u0103sit\u0103
XP_SEC_FORTEZZA_NO_MORE_INFO=Nu sunt alte informa\u021bii despre aceast\u0103 personalitate
XP_SEC_FORTEZZA_BAD_PIN=Pin invalid
XP_SEC_FORTEZZA_PERSON_ERROR=Nu se pot ini\u021bializa personalit\u0103\u021bile Fortezza.
SEC_ERROR_NO_KRL=Nu s-a g\u0103sit nici un KRL pentru certificatul acestui sait.
SEC_ERROR_KRL_EXPIRED=KRL pentru certificatul acestui sait a expirat.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL pentru certificatul acestui sait are semn\u0103tura invalid\u0103.
SEC_ERROR_REVOKED_KEY=Cheia pentru certificatul acestui sait a fost revocat\u0103.
SEC_ERROR_KRL_INVALID=Noul KRL are un format invalid.
SEC_ERROR_NEED_RANDOM=biblioteca de securitate\: e nevoie de date aleatoare.
SEC_ERROR_NO_MODULE=biblioteca de securitate\: niciun modul de securitate nu poate executa opera\u021bia cerut\u0103.
SEC_ERROR_NO_TOKEN=Cardul sau identificatorul de securitate nu exist\u0103, trebuie ini\u021bializat sau a fost scos.
SEC_ERROR_READ_ONLY=libr\u0103ria de securitate\: baz\u0103 de date accesibil\u0103 doar pentru citire.
SEC_ERROR_NO_SLOT_SELECTED=Nu s-a selectat niciun slot sau identificator.
SEC_ERROR_CERT_NICKNAME_COLLISION=Exist\u0103 deja un certificat cu acela\u0219i pseudonim.
SEC_ERROR_KEY_NICKNAME_COLLISION=Exist\u0103 deja o cheie cu acela\u0219i pseudonim.
SEC_ERROR_SAFE_NOT_CREATED=eroare \u00een timpul cre\u0103rii obiectului sigur
SEC_ERROR_BAGGAGE_NOT_CREATED=eroare \u00een timpul cre\u0103rii obiectului bagaj
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Nu se poate elimina principalul
XP_JAVA_DELETE_PRIVILEGE_ERROR=Nu s-a putut \u0219terge privilegiul
XP_JAVA_CERT_NOT_EXISTS_ERROR=Acest principal nu are un certificat
SEC_ERROR_BAD_EXPORT_ALGORITHM=Algoritmul cerut nu este permis.
SEC_ERROR_EXPORTING_CERTIFICATES=Eroare la \u00eencercarea de export a certificatelor.
SEC_ERROR_IMPORTING_CERTIFICATES=Eroare la \u00eencercarea de import a certificatelor.
SEC_ERROR_PKCS12_DECODING_PFX=Nu se poate importa. Eroare la decodare. Fi\u0219ierul nu este valid.
SEC_ERROR_PKCS12_INVALID_MAC=Nu se poate importa. MAC invalid. Parol\u0103 incorect\u0103 sau fi\u0219ier corupt.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Nu se poate importa. Algoritmul MAC nu este suportat.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Nu se poate importa. Sunt suportate numai modurile de integritate a parolei \u0219i confiden\u021bialitate.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Nu se poate importa. Structura fi\u0219ierului este corupt\u0103.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Nu se poate importa. Algoritmul de criptare nu e suportat.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Nu se poate importa. Versiunea de fi\u0219ier nu e suportat\u0103.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Nu se poate importa. Parol\u0103 incorect\u0103.
SEC_ERROR_PKCS12_CERT_COLLISION=Nu se poate importa. Pseudonimul exist\u0103 deja \u00een baza de date.
SEC_ERROR_USER_CANCELLED=Utilizatorul a anulat opera\u021bia.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Nu s-a importat, exist\u0103 deja \u00een baza de date.
SEC_ERROR_MESSAGE_SEND_ABORTED=Mesajul nu a fost trimis.
SEC_ERROR_INADEQUATE_KEY_USAGE=Utilizare inadecvat\u0103 a cheii de certificare pentru opera\u021bia \u00eencercat\u0103.
SEC_ERROR_INADEQUATE_CERT_TYPE=Tip de certificat neacceptat de aplica\u021bie.
SEC_ERROR_CERT_ADDR_MISMATCH=Adresa din certificatul de semnare nu se potrive\u0219te cu adresa din antetele mesajului.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Nu se poate importa. Eroare la \u00eencercarea de a importa cheia privat\u0103.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Nu se poate importa. Eroare la \u00eencercarea de a importa lan\u021bul de certificate.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Nu se poate exporta. Nu se poate g\u0103si certificatul sau cheia dup\u0103 porecl\u0103.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Nu se poate exporta. Nu se poate localiza \u0219i exporta cheia privat\u0103.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Nu se poate exporta. Nu se poate scrie fi\u0219ierul exportat.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Nu s-a putut importa. Nu s-a putut citi fi\u0219ierul de importat.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Nu se poate exporta. Baza de date cu chei este corupt\u0103 sau \u0219tears\u0103.
SEC_ERROR_KEYGEN_FAIL=Nu se poate genera perechea de chei public\u0103/privat\u0103.
SEC_ERROR_INVALID_PASSWORD=Parola introdus\u0103 este invalid\u0103. V\u0103 rug\u0103m alege\u021bi una diferit\u0103.
SEC_ERROR_RETRY_OLD_PASSWORD=Parola veche a fost introdus\u0103 incorect. V\u0103 rug\u0103m s\u0103 \u00eencerca\u021bi din nou.
SEC_ERROR_BAD_NICKNAME=Pseudonimul certificatului este deja utilizat.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Partenerul FORTEZZA are un certificat non-FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=O cheie senzitiv\u0103 nu poate fi mutat\u0103 \u00een slotul unde este nevoie de ea.
SEC_ERROR_JS_INVALID_MODULE_NAME=Numele modulului nu este valid.
SEC_ERROR_JS_INVALID_DLL=Cale invalid\u0103 c\u0103tre modul sau fi\u0219ier invalid
SEC_ERROR_JS_ADD_MOD_FAILURE=Nu s-a putut ad\u0103uga modulul
SEC_ERROR_JS_DEL_MOD_FAILURE=Nu s-a putut elimina modulul
SEC_ERROR_OLD_KRL=Noul KRL nu este mai recent dec\u00e2t cel actual.
SEC_ERROR_CKL_CONFLICT=Noul CKL are un emitent diferit dec\u00e2t cel actual. \u0218terge\u021bi CKL-ul actual.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Autorit\u0103\u021bii de certificare pentru acest certificat nu \u00eei este permis s\u0103 emit\u0103 un certificat cu acest nume.
SEC_ERROR_KRL_NOT_YET_VALID=Lista de revocare cheie pentru acest certificat nu este \u00eenc\u0103 valid\u0103.
SEC_ERROR_CRL_NOT_YET_VALID=Lista de revoc\u0103ri de certificate pentru acest certificat nu e \u00eenc\u0103 valid\u0103.
SEC_ERROR_UNKNOWN_CERT=Nu se poate g\u0103si certificatul cerut.
SEC_ERROR_UNKNOWN_SIGNER=Nu se poate g\u0103si certificatul semnatarului.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Amplasarea serverului de stare al certificatului e \u00een format invalid.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=R\u0103spunsul OCSP nu poate fi decodificat complet; este de tip necunoscut.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Serverul OCSP a returnat date HTTP nea\u0219teptate/invalide.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Serverul OCSP consider\u0103 cererea corupt\u0103 sau formatat\u0103 incorect.
SEC_ERROR_OCSP_SERVER_ERROR=Serverul OCSP a avut o eroare intern\u0103.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Serverul OCSP sugereaz\u0103 sa \u00eencerca\u021bi din nou mai t\u00e2rziu.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Serverul OCSP cere o semn\u0103tur\u0103 \u00een aceast\u0103 cerere.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Serverul OCSP a refuzat aceast\u0103 cerere ca fiind neautorizat\u0103.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Serverul OCSP a returnat o stare necunoscut\u0103.
SEC_ERROR_OCSP_UNKNOWN_CERT=Serverul OCSP nu cunoa\u0219te starea acestui certificat.
SEC_ERROR_OCSP_NOT_ENABLED=Trebuie s\u0103 activa\u021bi OCSP \u00eenainte de a executa aceast\u0103 opera\u021bie.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Trebuie s\u0103 seta\u021bi r\u0103spunz\u0103torul implicit pentru OCSP \u00eenainte de a efectua aceast\u0103 opera\u021bie.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=R\u0103spunsul de la serverul OCSP a fost corupt sau formatat incorect.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Semnatarul r\u0103spunsului OCSP nu este autorizat s\u0103 dea stare acestui certificat.
SEC_ERROR_OCSP_FUTURE_RESPONSE=R\u0103spunsul OCSP nu este \u00eenc\u0103 valid (con\u021bine o dat\u0103 din viitor).
SEC_ERROR_OCSP_OLD_RESPONSE=R\u0103spunsul OCSP con\u021bine informa\u021bii expirate.
SEC_ERROR_DIGEST_NOT_FOUND=Nu s-a g\u0103sit CMS sau PKCS \#7 Digest mesajul semnat.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Tipul de mesaj CMS sau PKCS \#7 nu este suportat.
SEC_ERROR_MODULE_STUCK=Modulul PKCS \#11 nu poate fi eliminat deoarece este \u00eenc\u0103 \u00een uz.
SEC_ERROR_BAD_TEMPLATE=Nu se pot decodifica date ASN.1. \u0218ablonul specificat este invalid.
SEC_ERROR_CRL_NOT_FOUND=Nu s-a g\u0103sit nicio list\u0103 CRL potrivit\u0103.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=A\u021bi \u00eencercat s\u0103 importa\u021bi un certificat cu acela\u0219i emitent/serial cu al unuia existent, de\u0219i nu e vorba de acela\u0219i certificat.
SEC_ERROR_BUSY=NSS nu poate fi terminat. Obiectele sunt \u00eenc\u0103 utilizate.
SEC_ERROR_EXTRA_INPUT=Mesajul codat cu DER con\u021bine date suplimentare nefolosite.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Curb\u0103 eliptic\u0103 nesuportat\u0103.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Form\u0103 nesuportat\u0103 de punct de curb\u0103 eliptic\u0103.
SEC_ERROR_UNRECOGNIZED_OID=Identificator nerecunoscut de obiect.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Certificat invalid pentru semn\u0103tura OCSP \u00een r\u0103spunsul OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Certificatul este revocat \u00een lista de revoc\u0103ri a emitentului.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=R\u0103spunz\u0103torul emitentului OCSP raporteaz\u0103 certificatul ca fiind revocat.
SEC_ERROR_CRL_INVALID_VERSION=Lista de revoc\u0103ri a emitentului are un num\u0103r de versiune necunoscut.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Lista de revocare a certificatelor V1 a emitentului are o extensie critic\u0103.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Lista de revocare a certificatelor V2 a emitentului are o extensie critic\u0103.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=S-a specificat un tip necunoscut de obiect.
SEC_ERROR_INCOMPATIBLE_PKCS11=Driverul PKCS \#11 violeaz\u0103 specifica\u021biile \u00eentr-un mod incompatibil.
SEC_ERROR_NO_EVENT=Nu este disponibil un slot nou pentru evenimente \u00een acest moment.
SEC_ERROR_CRL_ALREADY_EXISTS=Lista CRL exist\u0103 deja.
SEC_ERROR_NOT_INITIALIZED=NSS nu este ini\u021bializat.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Opera\u021bia a e\u0219uat pentru c\u0103 subiectul PKCS\#11 nu este autentificat.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Certificatul r\u0103spunz\u0103torului OCSP configurat este invalid.
SEC_ERROR_OCSP_BAD_SIGNATURE=R\u0103spunsul OCSP are semnatura invalid\u0103.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=C\u0103utarea valid\u0103rii certificatului este \u00een afara limitelor de c\u0103utare
SEC_ERROR_INVALID_POLICY_MAPPING=Maparea politicii de securitate con\u021bine anypolicy
SEC_ERROR_POLICY_VALIDATION_FAILED=Lan\u021bul de certificare nu este validat de politica de securitate
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Tip necunoscut de loca\u021bie \u00een extensia AIA a certificatului
SEC_ERROR_BAD_HTTP_RESPONSE=Serverul a returnat un r\u0103spuns HTTP gre\u0219it
SEC_ERROR_BAD_LDAP_RESPONSE=Serverul a returnat un r\u0103spuns LDAP gre\u0219it
SEC_ERROR_FAILED_TO_ENCODE_DATA=Codarea datelor cu ASN1 a e\u0219uat
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Loca\u021bie gre\u0219it\u0103 de accesare a informa\u021biei \u00een extensia certificatului
SEC_ERROR_LIBPKIX_INTERNAL=Eroare intern\u0103 Libpkix ap\u0103rut\u0103 \u00een timpul valid\u0103rii certificatului.
SEC_ERROR_PKCS11_GENERAL_ERROR=Modulul PKCS\#11 a returnat CKR_GENERAL_ERROR, care indic\u0103 faptul c\u0103 s-a produs o eroare iremediabil\u0103.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Modulul PKCS\#11 a returnat CKR_FUNCTION_FAILED, care indic\u0103 faptul c\u0103 func\u021bia solicitat\u0103 nu a putut fi efectuat\u0103. \u00cencerc\u00e2nd aceea\u0219i opera\u021biune din nou a\u021bi putea reu\u0219i.
SEC_ERROR_PKCS11_DEVICE_ERROR=Modulul PKCS\#11 a returnat CKR_DEVICE_ERROR, indic\u00e2nd faptul c\u0103 a intervenit o problem\u0103 cu slotul sau token-ul.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Metod\u0103 necunoscut\u0103 de accesare a informa\u021biei \u00een extensia certificatului.
SEC_ERROR_CRL_IMPORT_FAILED=Eroare la \u00eencercarea de a importa o list\u0103 CRL.
SEC_ERROR_EXPIRED_PASSWORD=Parola a expirat.
SEC_ERROR_LOCKED_PASSWORD=Parola e blocat\u0103.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Eroare PKCS \#11 necunoscut\u0103.
SEC_ERROR_BAD_CRL_DP_URL=URL invalid sau nesuportat \u00een punctul nume al distribu\u021biei CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=The certificate was signed using an signature algorithm that is disabled because it is not secure.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

