#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=La URL no es v\u00e1lida y no se puede cargar.
fileNotFound=Pale Moon no pudo encontrar el archivo en %S.
dnsNotFound=Pale Moon no pudo encontrar el servidor en %S.
protocolNotFound=Pale Moon no sabe c\u00f3mo abrir esta direcci\u00f3n por que el protocolo (%S) no est\u00e1 asociado con ning\u00fan programa.
connectionFailure=Pale Moon no pudo establecer una conexi\u00f3n con el servidor en %S.
netInterrupt=La conexi\u00f3n con %S se interrumpi\u00f3 mientras se cargaba la p\u00e1gina.
netTimeout=El servidor en %S est\u00e1 tomando mucho tiempo en responder.
redirectLoop=Pale Moon detect\u00f3 que el servidor est\u00e1 redirigiendo la solicitud para esta direcci\u00f3n en un modo que nunca se completar\u00e1.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Para mostrar esta p\u00e1gina, %S enviar\u00e1 informaci\u00f3n que repetir\u00e1 cualquier acci\u00f3n (como una b\u00fasqueda o una confirmaci\u00f3n de pedido o pago) ejecutada previamente.
resendButton.label=Reenviar
unknownSocketType=Pale Moon no sabe c\u00f3mo comunicarse con el servidor.
netReset=La conexi\u00f3n al servidor se reinici\u00f3 mientras se cargaba la p\u00e1gina.
notCached=Este documento ya no est\u00e1 disponible.
netOffline=Pale Moon est\u00e1 en modo sin conexi\u00f3n y no puede navegar en la web.
isprinting=El documento no se puede cambiar mientras se imprime o previsualiza.
deniedPortAccess=Esta direcci\u00f3n est\u00e1 usando un puerto de red normalmente usado para propositos diferentes a la navegaci\u00f3n web. Pale Moon cancel\u00f3 la solicitud para tu protecci\u00f3n.
proxyResolveFailure=Pale Moon est\u00e1 configurado para usar un servidor proxy que no puede encontrar.
proxyConnectFailure=Pale Moon est\u00e1 configurado para usar un servidor proxy que est\u00e1 rechazando las conexiones.
contentEncodingError=La p\u00e1gina que intentas ver no puede mostrarse porque usa una forma de compresi\u00f3n no v\u00e1lida o admitida.
unsafeContentType=La p\u00e1gina que intentas ver no se puede mostrar porque contiene un tipo de archivo que puede ser inseguro si se abre. Contacta a los propietarios del sitio web para informarles sobre este problema.
externalProtocolTitle=Solicitud de protocolo externo
externalProtocolPrompt=Debes ejecutar una aplicaci\u00f3n externa para manejar los enlaces %1$S\:.\n\n\nEnlace solicitado\:\n\n\n%2$S\n\nAplicaci\u00f3n\: %3$S\n\n\nSi no esperabas esta solicitud, podr\u00eda ser un intento para aprovechar una vulnerabilidad en ese programa. Cancela la solicitud a menos que est\u00e9s seguro que no es algo peligroso.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Desconocido>
externalProtocolChkMsg=Recuerda mi elecci\u00f3n para todos los enlaces de este tipo.
externalProtocolLaunchBtn=Ejecutar aplicaci\u00f3n
malwareBlocked=Este sitio web %S est\u00e1 reportado como peligroso y se bloque\u00f3 con base en tus preferencias de seguridad.
phishingBlocked=El sitio web %S est\u00e1 reportado como falso, dise\u00f1ado para enga\u00f1ar y obtener datos personales y/o financieros.
cspFrameAncestorBlocked=Esta p\u00e1gina tiene una pol\u00edtica de seguridad de contenido que previene embederla en esta forma.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=La p\u00e1gina que est\u00e1s tratando de ver no se puede mostrar porque un error en la transferencia de datos fue detectado.
remoteXUL=Esta p\u00e1gina usa una tecnolog\u00eda no admitida que ya no est\u00e1 disponible por defecto en Pale Moon.

