#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Nie mo\u017cna nawi\u0105za\u0107 bezpiecznego po\u0142\u0105czenia. Serwer nie obs\u0142uguje szyfrowania wysokiego poziomu.
SSL_ERROR_US_ONLY_SERVER=Nie mo\u017cna nawi\u0105za\u0107 bezpiecznego po\u0142\u0105czenia. Serwer wymaga szyfrowania wysokiego poziomu, kt\u00f3re nie jest obs\u0142ugiwane.
SSL_ERROR_NO_CYPHER_OVERLAP=Nie mo\u017cna nawi\u0105za\u0107 bezpiecznego po\u0142\u0105czenia\: brak wsp\u00f3lnych algorytm\u00f3w szyfrowania.
SSL_ERROR_NO_CERTIFICATE=Nie mo\u017cna znale\u017a\u0107 certyfikatu lub klucza wymaganego do uwierzytelnienia.
SSL_ERROR_BAD_CERTIFICATE=Nie mo\u017cna nawi\u0105za\u0107 bezpiecznego po\u0142\u0105czenia\: certyfikat serwera zosta\u0142 odrzucony.
SSL_ERROR_UNUSED_5=Nierozpoznany kod b\u0142\u0119du SSL.
SSL_ERROR_BAD_CLIENT=Serwer otrzyma\u0142 nieprawid\u0142owe dane od klienta.
SSL_ERROR_BAD_SERVER=Klient otrzyma\u0142 nieprawid\u0142owe dane od serwera.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Nieobs\u0142ugiwany rodzaj certyfikatu.
SSL_ERROR_UNSUPPORTED_VERSION=Serwer u\u017cywa nieobs\u0142ugiwanej wersji protoko\u0142u bezpiecze\u0144stwa.
SSL_ERROR_UNUSED_10=Nierozpoznany kod b\u0142\u0119du SSL.
SSL_ERROR_WRONG_CERTIFICATE=Uwierzytelnienie klienta si\u0119 nie powiod\u0142o\: klucz prywatny w bazie kluczy nie pasuje do klucza publicznego w bazie certyfikat\u00f3w.
SSL_ERROR_BAD_CERT_DOMAIN=Nie mo\u017cna nawi\u0105za\u0107 bezpiecznego po\u0142\u0105czenia\: \u017c\u0105dana nazwa domeny nie pasuje do certyfikatu serwera.
SSL_ERROR_POST_WARNING=Nierozpoznany kod b\u0142\u0119du SSL.
SSL_ERROR_SSL2_DISABLED=Serwer obs\u0142uguje tylko SSL w wersji 2, kt\u00f3ra lokalnie jest zablokowana.
SSL_ERROR_BAD_MAC_READ=SSL otrzyma\u0142 rekord z nieprawid\u0142owym kodem uwierzytelnienia wiadomo\u015bci.
SSL_ERROR_BAD_MAC_ALERT=Uczestnik komunikacji SSL zg\u0142asza nieprawid\u0142owy kod uwierzytelnienia wiadomo\u015bci.
SSL_ERROR_BAD_CERT_ALERT=Uczestnik komunikacji SSL nie mo\u017ce zweryfikowa\u0107 certyfikatu u\u017cytkownika.
SSL_ERROR_REVOKED_CERT_ALERT=Uczestnik komunikacji SSL odrzuci\u0142 certyfikat u\u017cytkownika jako odwo\u0142any.
SSL_ERROR_EXPIRED_CERT_ALERT=Uczestnik komunikacji SSL odrzuci\u0142 certyfikat u\u017cytkownika jako wygas\u0142y.
SSL_ERROR_SSL_DISABLED=Nie mo\u017cna si\u0119 po\u0142\u0105czy\u0107\: SSL jest zablokowany.
SSL_ERROR_FORTEZZA_PQG=Nie mo\u017cna si\u0119 po\u0142\u0105czy\u0107\: Uczestnik komunikacji SSL jest w innej domenie FORTEZZA.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Za\u017c\u0105dano nieznanego pakietu szyfr\u00f3w SSL.
SSL_ERROR_NO_CIPHERS_SUPPORTED=W tym programie nie ma \u017cadnych w\u0142\u0105czonych pakiet\u00f3w szyfr\u00f3w.
SSL_ERROR_BAD_BLOCK_PADDING=SSL otrzyma\u0142 rekord z nieprawid\u0142owym wype\u0142nieniem bloku.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL otrzyma\u0142 rekord przekraczaj\u0105cy najwi\u0119ksz\u0105 dozwolon\u0105 d\u0142ugo\u015b\u0107.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL pr\u00f3bowa\u0142 wys\u0142a\u0107 rekord przekraczaj\u0105cy najwi\u0119ksz\u0105 dozwolon\u0105 d\u0142ugo\u015b\u0107.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Hello Request handshake.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Client Hello handshake.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Server Hello handshake.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Certificate handshake.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Server Key Exchange handshake
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Certificate Request handshake.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Server Hello Done handshake.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Certificate Verify handshake.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Client Key Exchange handshake.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL otrzyma\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 Finished handshake.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL otrzyma\u0142 uszkodzony rekord Change Cipher Spec.
SSL_ERROR_RX_MALFORMED_ALERT=SSL otrzyma\u0142 uszkodzony rekord Alert.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL otrzyma\u0142 uszkodzony rekord Handshake.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL otrzyma\u0142 uszkodzony rekord Application Data.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Hello Request handshake.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Client Hello handshake.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Server Hello handshake.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Certificate handshake.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Server Key Exchange handshake.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Certificate Request handshake.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Server Hello Done handshake.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Certificate Verify handshake.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Client Key Exchange handshake.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL otrzyma\u0142 nieoczekiwan\u0105 wiadomo\u015b\u0107 Finished handshake.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL otrzyma\u0142 nieoczekiwany rekord Change Cipher Spec.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL otrzyma\u0142 nieoczekiwany rekord Alert.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL otrzyma\u0142 nieoczekiwany rekord Handshake.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL otrzyma\u0142 nieoczekiwany rekord Application Data.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL otrzyma\u0142 rekord z nieznanym typem zawarto\u015bci.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL otrzyma\u0142 wiadomo\u015b\u0107 handshake z nieznanym typem wiadomo\u015bci.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL otrzyma\u0142 rekord powiadomienia z nieznanym opisem powiadomienia.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Uczestnik komunikacji SSL zamkn\u0105\u0142 to po\u0142\u0105czenie.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Uczestnik komunikacji SSL nie oczekiwa\u0142 otrzymanej wiadomo\u015bci handshake.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=Uczestnik komunikacji SSL nie m\u00f3g\u0142 zdekompresowa\u0107 otrzymanego rekordu SSL.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=Uczestnik komunikacji SSL nie m\u00f3g\u0142 wynegocjowa\u0107 akceptowalnego zbioru parametr\u00f3w bezpiecze\u0144stwa.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Uczestnik komunikacji SSL odrzuci\u0142 wiadomo\u015b\u0107 handshake z powodu nieakceptowalnej zawarto\u015bci.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Uczestnik komunikacji SSL nie obs\u0142uguje certyfikat\u00f3w otrzymanego typu.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Uczestnik komunikacji SSL napotka\u0142 nieokre\u015blone problemy z otrzymanym certyfikatem.
SSL_ERROR_GENERATE_RANDOM_FAILURE=Wyst\u0105pi\u0142 b\u0142\u0105d generatora liczb losowych SSL.
SSL_ERROR_SIGN_HASHES_FAILURE=Nie mo\u017cna podpisa\u0107 cyfrowo danych wymaganych do weryfikacji certyfikatu u\u017cytkownika.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL nie m\u00f3g\u0142 wyodr\u0119bni\u0107 klucza publicznego z certyfikatu uczestnika komunikacji.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Nieokre\u015blony b\u0142\u0105d podczas przetwarzania SSL Server Key Exchange handshake.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Nieokre\u015blony b\u0142\u0105d podczas przetwarzania SSL Client Key Exchange handshake.
SSL_ERROR_ENCRYPTION_FAILURE=Algorytm masowego szyfrowania danych nie powi\u00f3d\u0142 si\u0119 w wybranym pakiecie szyfr\u00f3w.
SSL_ERROR_DECRYPTION_FAILURE=Algorytm masowego deszyfrowania danych nie powi\u00f3d\u0142 si\u0119 w wybranym pakiecie szyfr\u00f3w.
SSL_ERROR_SOCKET_WRITE_FAILURE=Pr\u00f3ba zapisu zaszyfrowanych danych do podstawowego gniazda si\u0119 nie powiod\u0142a.
SSL_ERROR_MD5_DIGEST_FAILURE=Funkcja skr\u00f3tu MD5 si\u0119 nie powiod\u0142a.
SSL_ERROR_SHA_DIGEST_FAILURE=Funkcja skr\u00f3tu SHA-1 si\u0119 nie powiod\u0142a.
SSL_ERROR_MAC_COMPUTATION_FAILURE=Obliczenie MAC si\u0119 nie powiod\u0142o.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Nie uda\u0142o si\u0119 utworzy\u0107 kontekstu klucza symetrycznego.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Nie uda\u0142o si\u0119 odpakowa\u0107 klucza symetrycznego w wiadomo\u015bci Client Key Exchange.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Serwer SSL pr\u00f3bowa\u0142 wykorzysta\u0107 klucz publiczny klasy krajowej z eksportowym zestawem szyfr\u00f3w.
SSL_ERROR_IV_PARAM_FAILURE=PKCS11 nie m\u00f3g\u0142 przet\u0142umaczy\u0107 IV do postaci parametru.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Nie uda\u0142o si\u0119 zainicjalizowa\u0107 wybranego zestawu szyfr\u00f3w.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Wygenerowanie przez klienta kluczy sesji dla sesji SSL si\u0119 nie powiod\u0142o.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Serwer nie ma klucza dla \u017c\u0105danego algorytmu wymiany kluczy.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=Token PKCS\#11 zosta\u0142 wsuni\u0119ty lub usuni\u0119ty w trakcie trwania operacji.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Nie odnaleziono tokenu PKCS\#11, kt\u00f3ry m\u00f3g\u0142by zosta\u0107 wykorzystany do \u017c\u0105danej operacji.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Nie mo\u017cna nawi\u0105za\u0107 bezpiecznego po\u0142\u0105czenia z uczestnikiem komunikacji\: brak wsp\u00f3lnych algorytm\u00f3w kompresji.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Nie mo\u017cna zainicjowa\u0107 kolejnej procedury SSL handshake, dop\u00f3ki bie\u017c\u0105ca procedura handshake si\u0119 nie zako\u0144czy.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Otrzymano nieprawid\u0142owe warto\u015bci funkcji skr\u00f3tu dla wiadomo\u015bci handshake od uczestnika komunikacji.
SSL_ERROR_CERT_KEA_MISMATCH=Dostarczony certyfikat nie mo\u017ce by\u0107 u\u017cywany z wybranym algorytmem wymiany kluczy.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Brak organ\u00f3w certyfikacji zaufanych dla uwierzytelniania klienta SSL.
SSL_ERROR_SESSION_NOT_FOUND=Identyfikator sesji klienta SSL nie odnaleziony w pami\u0119ci podr\u0119cznej sesji serwera.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Uczestnik komunikacji nie m\u00f3g\u0142 odszyfrowa\u0107 otrzymanego rekordu SSL.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Uczestnik komunikacji otrzyma\u0142 rekord SSL d\u0142u\u017cszy, ni\u017c jest to dozwolone.
SSL_ERROR_UNKNOWN_CA_ALERT=Uczestnik komunikacji nie rozpoznaje i/lub nie ufa organowi certyfikacji, kt\u00f3ry wyda\u0142 certyfikat u\u017cytkownika.
SSL_ERROR_ACCESS_DENIED_ALERT=Uczestnik komunikacji otrzyma\u0142 prawid\u0142owy certyfikat, ale dost\u0119p zosta\u0142 zabroniony.
SSL_ERROR_DECODE_ERROR_ALERT=Uczestnik komunikacji nie m\u00f3g\u0142 zdekodowa\u0107 wiadomo\u015bci SSL handshake.
SSL_ERROR_DECRYPT_ERROR_ALERT=Uczestnik komunikacji zg\u0142osi\u0142 b\u0142\u0105d weryfikacji podpisu lub wymiany kluczy.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Uczestnik komunikacji zg\u0142asza, \u017ce negocjacja nie jest zgodna z przepisami eksportowymi.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Uczestnik komunikacji zg\u0142asza niezgodn\u0105 lub nieobs\u0142ugiwan\u0105 wersj\u0119 protoko\u0142u.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Serwer wymaga bardziej bezpiecznych szyfr\u00f3w ni\u017c te obs\u0142ugiwane przez klienta.
SSL_ERROR_INTERNAL_ERROR_ALERT=Uczestnik komunikacji zg\u0142asza, \u017ce napotka\u0142 b\u0142\u0105d wewn\u0119trzny.
SSL_ERROR_USER_CANCELED_ALERT=Uczestnik komunikacji anulowa\u0142 procedur\u0119 handshake.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Uczestnik komunikacji nie zezwala na renegocjacj\u0119 parametr\u00f3w bezpiecze\u0144stwa SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Pami\u0119\u0107 podr\u0119czna serwera SSL nie jest skonfigurowana i nie jest wy\u0142\u0105czona dla tego gniazda.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Uczestnik komunikacji SSL nie obs\u0142uguje \u017c\u0105danego rozszerzenia TLS hello.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Uczestnik komunikacji SSL nie m\u00f3g\u0142 pobra\u0107 certyfikatu z dostarczonego adresu URL.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Uczestnik komunikacji SSL nie ma certyfikatu dla \u017c\u0105danej nazwy DNS.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Uczestnik komunikacji SSL nie dosta\u0142 odpowiedzi OCSP dla tego certyfikatu.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Uczestnik komunikacji SSL zg\u0142osi\u0142 nieprawid\u0142ow\u0105 warto\u015b\u0107 funkcji skr\u00f3tu certyfikatu.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL odebra\u0142 niespodziewan\u0105 wiadomo\u015b\u0107 typu handshake nowego biletu sesji.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL odebra\u0142 uszkodzon\u0105 wiadomo\u015b\u0107 typu handshake nowego biletu sesji.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL odebra\u0142 skompresowany rekord, kt\u00f3rego dekompresja si\u0119 nie powiod\u0142a.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Renegocjacja nie jest dozwolona w tym gnie\u017adzie SSL.
SSL_ERROR_UNSAFE_NEGOTIATION=Uczestnik komunikacji nades\u0142a\u0142 wiadomo\u015b\u0107 typu handshake starego typu (potencjalnie niebezpieczn\u0105).
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL odebra\u0142 nieoczekiwany rekord nieskompresowany.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL odebra\u0142 s\u0142aby kr\u00f3tkotrwa\u0142y klucz Diffiego-Hellmana w wiadomo\u015bci typu handshake wymiany klucza serwera.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL odebra\u0142 nieprawid\u0142owe dane rozszerzenia NPN.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=Funkcja SSL nie jest obs\u0142ugiwana dla po\u0142\u0105cze\u0144 SSL 2.0.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Funkcja SSL nie jest obs\u0142ugiwana dla serwer\u00f3w.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Funkcja SSL nie jest obs\u0142ugiwana dla klient\u00f3w.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=Podczas autoryzacji bezpiecze\u0144stwa wyst\u0105pi\u0142 b\u0142\u0105d wej\u015bcia/wyj\u015bcia.
SEC_ERROR_LIBRARY_FAILURE=b\u0142\u0105d biblioteki bezpiecze\u0144stwa.
SEC_ERROR_BAD_DATA=biblioteka bezpiecze\u0144stwa\: otrzymano niew\u0142a\u015bciwe dane.
SEC_ERROR_OUTPUT_LEN=biblioteka bezpiecze\u0144stwa\: b\u0142\u0105d d\u0142ugo\u015bci wyj\u015bcia.
SEC_ERROR_INPUT_LEN=biblioteka bezpiecze\u0144stwa\: b\u0142\u0105d d\u0142ugo\u015bci wej\u015bcia.
SEC_ERROR_INVALID_ARGS=biblioteka bezpiecze\u0144stwa\: nieprawid\u0142owe argumenty.
SEC_ERROR_INVALID_ALGORITHM=biblioteka bezpiecze\u0144stwa\: nieprawid\u0142owy algorytm.
SEC_ERROR_INVALID_AVA=biblioteka bezpiecze\u0144stwa\: nieprawid\u0142owe AVA.
SEC_ERROR_INVALID_TIME=Niew\u0142a\u015bciwie sformatowany ci\u0105g znak\u00f3w opisuj\u0105cy czas.
SEC_ERROR_BAD_DER=biblioteka bezpiecze\u0144stwa\: nieprawid\u0142owo sformatowana wiadomo\u015b\u0107 zaszyfrowana DER.
SEC_ERROR_BAD_SIGNATURE=Certyfikat uczestnika komunikacji ma nieprawid\u0142owy podpis.
SEC_ERROR_EXPIRED_CERTIFICATE=Certyfikat uczestnika komunikacji straci\u0142 wa\u017cno\u015b\u0107.
SEC_ERROR_REVOKED_CERTIFICATE=Certyfikat uczestnika komunikacji zosta\u0142 odwo\u0142any.
SEC_ERROR_UNKNOWN_ISSUER=Wystawca certyfikatu uczestnika komunikacji nie zosta\u0142 rozpoznany.
SEC_ERROR_BAD_KEY=Klucz publiczny uczestnika komunikacji jest nieprawid\u0142owy.
SEC_ERROR_BAD_PASSWORD=Wprowadzone has\u0142o bezpiecze\u0144stwa jest nieprawid\u0142owe.
SEC_ERROR_RETRY_PASSWORD=Nowe has\u0142o wprowadzone nieprawid\u0142owo. Nale\u017cy spr\u00f3bowa\u0107 ponownie.
SEC_ERROR_NO_NODELOCK=biblioteka bezpiecze\u0144stwa\: brak blokady w\u0119z\u0142a.
SEC_ERROR_BAD_DATABASE=biblioteka bezpiecze\u0144stwa\: niew\u0142a\u015bciwa baza danych.
SEC_ERROR_NO_MEMORY=biblioteka bezpiecze\u0144stwa\: b\u0142\u0105d alokacji pami\u0119ci.
SEC_ERROR_UNTRUSTED_ISSUER=Wystawca certyfikatu uczestnika komunikacji zosta\u0142 oznaczony jako niezaufany przez u\u017cytkownika.
SEC_ERROR_UNTRUSTED_CERT=Certyfikat uczestnika komunikacji zosta\u0142 oznaczony jako niezaufany przez u\u017cytkownika.
SEC_ERROR_DUPLICATE_CERT=Ten certyfikat istnieje ju\u017c w bazie danych.
SEC_ERROR_DUPLICATE_CERT_NAME=Nazwa pobranego certyfikatu jest taka sama jak nazwa certyfikatu istniej\u0105cego w bazie danych.
SEC_ERROR_ADDING_CERT=B\u0142\u0105d podczas dodawania certyfikatu do bazy danych.
SEC_ERROR_FILING_KEY=B\u0142\u0105d podczas ponownego do\u0142\u0105czania klucza dla tego certyfikatu.
SEC_ERROR_NO_KEY=Klucza publicznego tego certyfikatu nie mo\u017cna odnale\u017a\u0107 w bazie danych.
SEC_ERROR_CERT_VALID=Ten certyfikat jest prawid\u0142owy.
SEC_ERROR_CERT_NOT_VALID=Ten certyfikat jet nieprawid\u0142owy.
SEC_ERROR_CERT_NO_RESPONSE=Biblioteka certyfikat\u00f3w\: brak odpowiedzi.
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Certyfikat wystawcy certyfikatu utraci\u0142 wa\u017cno\u015b\u0107. Nale\u017cy sprawdzi\u0107 czas i dat\u0119 w systemie.
SEC_ERROR_CRL_EXPIRED=CRL wystawcy tego certyfikatu utraci\u0142a wa\u017cno\u015b\u0107. Nale\u017cy j\u0105 zaktualizowa\u0107 lub sprawdzi\u0107 czas i dat\u0119 w systemie.
SEC_ERROR_CRL_BAD_SIGNATURE=CRL tego wystawcy certyfikatu ma nieprawid\u0142owy podpis.
SEC_ERROR_CRL_INVALID=Nowa lista CRL ma nieprawid\u0142owy format.
SEC_ERROR_EXTENSION_VALUE_INVALID=Nieprawid\u0142owa warto\u015b\u0107 rozszerzenia certyfikatu.
SEC_ERROR_EXTENSION_NOT_FOUND=Nie znaleziono rozszerzenia certyfikatu.
SEC_ERROR_CA_CERT_INVALID=Certyfikat wystawcy jest nieprawid\u0142owy.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Ograniczenie d\u0142ugo\u015bci \u015bcie\u017cki certyfikatu jest nieprawid\u0142owe.
SEC_ERROR_CERT_USAGES_INVALID=Pole zastosowa\u0144 certyfikatu jest nieprawid\u0142owe.
SEC_INTERNAL_ONLY=**Modu\u0142 WY\u0141\u0104CZNIE wewn\u0119trzny**
SEC_ERROR_INVALID_KEY=Ten klucz nie obs\u0142uguje \u017c\u0105danej operacji.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Certyfikat zawiera nieznane krytyczne rozszerzenie.
SEC_ERROR_OLD_CRL=Nowa CRL nie jest p\u00f3\u017aniejsza od obecnej.
SEC_ERROR_NO_EMAIL_CERT=Niezaszyfrowane i niepodpisane\: u\u017cytkownik nie posiada certyfikatu e-mail.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Niezaszyfrowane\: u\u017cytkownik nie posiada certyfikat\u00f3w dla wszystkich odbiorc\u00f3w.
SEC_ERROR_NOT_A_RECIPIENT=Nie mo\u017cna odszyfrowa\u0107\: u\u017cytkownik nie jest odbiorc\u0105 albo nie znaleziono pasuj\u0105cego certyfikatu i klucza prywatnego.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Nie mo\u017cna odszyfrowa\u0107\: algorytm szyfrowania klucza nie pasuje do certyfikatu u\u017cytkownika.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Weryfikacja podpisu zako\u0144czona niepowodzeniem\: nie znaleziono podpisuj\u0105cego, znaleziono zbyt wielu podpisuj\u0105cych albo napotkano nieprawid\u0142owe lub uszkodzone dane.
SEC_ERROR_UNSUPPORTED_KEYALG=Nieobs\u0142ugiwany lub nieznany algorytm klucza.
SEC_ERROR_DECRYPTION_DISALLOWED=Nie mo\u017cna odszyfrowa\u0107\: zaszyfrowano przy u\u017cyciu niedozwolonego algorytmu lub rozmiaru klucza.
XP_SEC_FORTEZZA_BAD_CARD=Karta Fortezza nie zosta\u0142a poprawnie zainicjalizowana. Nale\u017cy j\u0105 usun\u0105\u0107 i zwr\u00f3ci\u0107 do wystawcy.
XP_SEC_FORTEZZA_NO_CARD=Nie odnaleziono kart Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=Nie wybrano karty Fortezza
XP_SEC_FORTEZZA_MORE_INFO=Nale\u017cy wybra\u0107 to\u017csamo\u015b\u0107, by uzyska\u0107 wi\u0119cej informacji na temat
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=To\u017csamo\u015b\u0107 nie zosta\u0142a odnaleziona
XP_SEC_FORTEZZA_NO_MORE_INFO=Nie ma wi\u0119cej informacji na temat tej to\u017csamo\u015bci
XP_SEC_FORTEZZA_BAD_PIN=Nieprawid\u0142owy PIN
XP_SEC_FORTEZZA_PERSON_ERROR=Nie mo\u017cna zainicjalizowa\u0107 to\u017csamo\u015bci Fortezza.
SEC_ERROR_NO_KRL=Dla certyfikatu tej witryny nie odnaleziono \u017cadnych KRL.
SEC_ERROR_KRL_EXPIRED=KRL dla certyfikatu tej witryny utraci\u0142a wa\u017cno\u015b\u0107.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL dla certyfikatu tej witryny zawiera nieprawid\u0142owy podpis.
SEC_ERROR_REVOKED_KEY=Klucz dla certyfikatu tej witryny zosta\u0142 odwo\u0142any.
SEC_ERROR_KRL_INVALID=Nowa KRL ma nieprawid\u0142owy format.
SEC_ERROR_NEED_RANDOM=biblioteka bezpiecze\u0144stwa\: potrzeba danych losowych.
SEC_ERROR_NO_MODULE=biblioteka bezpiecze\u0144stwa\: \u017caden modu\u0142 bezpiecze\u0144stwa nie mo\u017ce wykona\u0107\u00a0\u017c\u0105danej operacji.
SEC_ERROR_NO_TOKEN=Karta lub token bezpiecze\u0144stwa nie istnieje, musi zosta\u0107 zainicjalizowany lub zosta\u0142 usuni\u0119ty.
SEC_ERROR_READ_ONLY=biblioteka bezpiecze\u0144stwa\: baza danych tylko do odczytu.
SEC_ERROR_NO_SLOT_SELECTED=Nie wybrano slotu ani tokena.
SEC_ERROR_CERT_NICKNAME_COLLISION=Certyfikat o takiej przyjaznej nazwie ju\u017c istnieje.
SEC_ERROR_KEY_NICKNAME_COLLISION=Klucz o takiej samej przyjaznej nazwie ju\u017c istnieje.
SEC_ERROR_SAFE_NOT_CREATED=b\u0142\u0105d podczas tworzenia bezpiecznego obiektu
SEC_ERROR_BAGGAGE_NOT_CREATED=b\u0142\u0105d podczas tworzenia obiektu baga\u017cu
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Nie uda\u0142o si\u0119 usun\u0105\u0107 podmiotu zabezpiecze\u0144
XP_JAVA_DELETE_PRIVILEGE_ERROR=Nie uda\u0142o si\u0119 usun\u0105\u0107 uprawnienia
XP_JAVA_CERT_NOT_EXISTS_ERROR=Ten podmiot zabezpiecze\u0144 nie posiada certyfikatu
SEC_ERROR_BAD_EXPORT_ALGORITHM=Wymagany algorytm nie jest dozwolony.
SEC_ERROR_EXPORTING_CERTIFICATES=B\u0142\u0105d podczas pr\u00f3by eksportu certyfikat\u00f3w.
SEC_ERROR_IMPORTING_CERTIFICATES=B\u0142\u0105d podczas pr\u00f3by importu certyfikat\u00f3w.
SEC_ERROR_PKCS12_DECODING_PFX=Nie mo\u017cna dokona\u0107 importu. B\u0142\u0105d dekodowania, plik nieprawid\u0142owy.
SEC_ERROR_PKCS12_INVALID_MAC=Nie mo\u017cna dokona\u0107 importu. Nieprawid\u0142owy MAC, nieprawid\u0142owe has\u0142o lub uszkodzony plik.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Nie mo\u017cna dokona\u0107 importu. Nieobs\u0142ugiwany algorytm MAC.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Nie mo\u017cna dokona\u0107 importu. Obs\u0142ugiwane s\u0105 tylko tryby integralno\u015bci has\u0142a i prywatno\u015bci.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Nie mo\u017cna dokona\u0107 importu. Uszkodzona struktura pliku.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Nie mo\u017cna dokona\u0107 importu. Nieobs\u0142ugiwany algorytm szyfrowania.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Nie mo\u017cna dokona\u0107 importu. Nieobs\u0142ugiwana wersja pliku.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Nie mo\u017cna dokona\u0107 importu. Nieprawid\u0142owe has\u0142o prywatno\u015bci.
SEC_ERROR_PKCS12_CERT_COLLISION=Nie mo\u017cna dokona\u0107 importu. Taka przyjazna nazwa ju\u017c istnieje w bazie danych.
SEC_ERROR_USER_CANCELLED=U\u017cytkownik nacisn\u0105\u0142 \u201eAnuluj\u201d.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Nie dokonano importu, wpis jest ju\u017c w bazie danych.
SEC_ERROR_MESSAGE_SEND_ABORTED=Wiadomo\u015b\u0107 nie zosta\u0142a wys\u0142ana.
SEC_ERROR_INADEQUATE_KEY_USAGE=Nieadekwatne do \u017c\u0105danej operacji zastosowanie klucza certyfikatu.
SEC_ERROR_INADEQUATE_CERT_TYPE=Typ certyfikatu niedozwolony dla aplikacji.
SEC_ERROR_CERT_ADDR_MISMATCH=Adres w certyfikacie podpisywania nie pasuje do adresu w nag\u0142\u00f3wkach wiadomo\u015bci.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Nie uda\u0142o si\u0119 dokona\u0107 importu. B\u0142\u0105d podczas importowania klucza prywatnego.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Nie uda\u0142o si\u0119 dokona\u0107 importu. B\u0142\u0105d podczas pr\u00f3by importu \u0142a\u0144cucha certyfikat\u00f3w.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Nie uda\u0142o si\u0119 dokona\u0107 eksportu. Nie uda\u0142o si\u0119 odnale\u017a\u0107 certyfikatu wg klucza ani wg przyjaznej nazwy.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Nie uda\u0142o si\u0119 dokona\u0107 eksportu. Nie mo\u017cna odnale\u017a\u0107 ani wyeksportowa\u0107 klucza publicznego.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Nie uda\u0142o si\u0119 dokona\u0107 eksportu. Nie mo\u017cna zapisa\u0107 pliku eksportu.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Nie uda\u0142o si\u0119 dokona\u0107 importu. Nie mo\u017cna odczyta\u0107 pliku importu.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Nie uda\u0142o si\u0119 dokona\u0107 eksportu. Baza danych kluczy uszkodzona lub usuni\u0119ta.
SEC_ERROR_KEYGEN_FAIL=Nie uda\u0142o si\u0119 wygenerowa\u0107 pary kluczy (prywatnego i publicznego).
SEC_ERROR_INVALID_PASSWORD=Wprowadzone has\u0142o jest nieprawid\u0142owe. Nale\u017cy wybra\u0107 inne.
SEC_ERROR_RETRY_OLD_PASSWORD=Stare has\u0142o wprowadzone niepoprawnie. Nale\u017cy spr\u00f3bowa\u0107 ponownie.
SEC_ERROR_BAD_NICKNAME=Przyjazna nazwa certyfikatu jest ju\u017c u\u017cywana.
SEC_ERROR_NOT_FORTEZZA_ISSUER=\u0141a\u0144cuch FORTEZZA uczestnika komunikacji ma certyfikat innego typu ni\u017c FORTEZZA.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Czu\u0142y klucz nie mo\u017ce zosta\u0107 wsuni\u0119ty do w\u0142a\u015bciwego slotu.
SEC_ERROR_JS_INVALID_MODULE_NAME=Nieprawid\u0142owa nazwa modu\u0142u
SEC_ERROR_JS_INVALID_DLL=Nieprawid\u0142owa \u015bcie\u017cka/nazwa pliku modu\u0142u
SEC_ERROR_JS_ADD_MOD_FAILURE=Nie mo\u017cna doda\u0107 modu\u0142u
SEC_ERROR_JS_DEL_MOD_FAILURE=Nie mo\u017cna usun\u0105\u0107 modu\u0142u
SEC_ERROR_OLD_KRL=Nowa KRL nie jest p\u00f3\u017aniejsza ni\u017c obecna.
SEC_ERROR_CKL_CONFLICT=Nowa CKL ma innego wystawc\u0119 ni\u017c obecna CKL. Nale\u017cy usun\u0105\u0107 obecn\u0105 CKL.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Organ certyfikacji tego certyfikatu nie ma zezwolenia na wydawanie certyfikatu o tej nazwie.
SEC_ERROR_KRL_NOT_YET_VALID=Lista odwo\u0142ania kluczy dla tego certyfikatu nie jest jeszcze wa\u017cna.
SEC_ERROR_CRL_NOT_YET_VALID=Lista odwo\u0142ania certyfikat\u00f3w dla tego certyfikatu nie jest jeszcze wa\u017cna.
SEC_ERROR_UNKNOWN_CERT=Nie uda\u0142o si\u0119 odnale\u017a\u0107\u00a0\u017c\u0105danego certyfikatu.
SEC_ERROR_UNKNOWN_SIGNER=Nie mo\u017cna odnale\u017a\u0107 certyfikatu podmiotu podpisuj\u0105cego.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Nieprawid\u0142owy format adresu serwera statusu certyfikat\u00f3w.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Odpowied\u017a serwera OCSP nie mo\u017ce zosta\u0107 ca\u0142kowicie odkodowana, ma ona nieznany typ.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Serwer OCSP zwr\u00f3ci\u0142 nieoczekiwane/nieprawid\u0142owe dane HTTP.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Serwer OCSP uzna\u0142\u00a0\u017c\u0105danie za uszkodzone lub nieprawid\u0142owo uformowane.
SEC_ERROR_OCSP_SERVER_ERROR=Wyst\u0105pi\u0142 wewn\u0119trzny b\u0142\u0105d serwera OCSP.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Serwer OCSP zaleca dokonanie ponownej pr\u00f3by w terminie p\u00f3\u017aniejszym.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Serwer OCSP wymaga, by to \u017c\u0105danie zawiera\u0142o podpis.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Serwer OCSP odrzuci\u0142 to \u017c\u0105danie jako nieautoryzowane.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Serwer OCSP zwr\u00f3ci\u0142 nierozpoznawalny status.
SEC_ERROR_OCSP_UNKNOWN_CERT=Serwer OCSP nie ma statusu dla tego certyfikatu.
SEC_ERROR_OCSP_NOT_ENABLED=Przed wykonaniem tej operacji nale\u017cy w\u0142\u0105czy\u0107 OCSP.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Nale\u017cy ustawi\u0107 domy\u015blnego respondera OCSP przed wykonaniem tej operacji.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Odpowied\u017a serwera OCSP by\u0142a nieprawid\u0142owo uformowana lub uszkodzona.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Podmiot podpisuj\u0105cy t\u0119 odpowied\u017a OCSP nie ma autoryzacji do podawania statusu tego certyfikatu.
SEC_ERROR_OCSP_FUTURE_RESPONSE=Odpowied\u017a OCSP nie jest jeszcze wa\u017cna (zawiera dat\u0119 z przysz\u0142o\u015bci).
SEC_ERROR_OCSP_OLD_RESPONSE=Odpowied\u017a OCSP zawiera nieaktualne informacje.
SEC_ERROR_DIGEST_NOT_FOUND=W wiadomo\u015bci nie odnaleziono skr\u00f3tu CMS ani PKCS \#7.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Nieobs\u0142ugiwany typ wiadomo\u015bci CMS lub PKCS \#7.
SEC_ERROR_MODULE_STUCK=Modu\u0142 PKCS \#11 nie m\u00f3g\u0142 zosta\u0107 usuni\u0119ty, poniewa\u017c jest nadal u\u017cywany.
SEC_ERROR_BAD_TEMPLATE=Nie uda\u0142o si\u0119 zdekodowa\u0107 danych ASN.1. Okre\u015blony szablon by\u0142 nieprawid\u0142owy.
SEC_ERROR_CRL_NOT_FOUND=Nie odnaleziono pasuj\u0105cej CRL.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=U\u017cytkownik pr\u00f3bowa\u0142 zaimportowa\u0107 certyfikat z tym samym wystawc\u0105/numerem seryjnym, co istniej\u0105cy certyfikat, ale nie jest to ten sam certyfikat.
SEC_ERROR_BUSY=NSS nie mog\u0142a zako\u0144czy\u0107 pracy. Obiekty sa nadal u\u017cywane.
SEC_ERROR_EXTRA_INPUT=Wiadomo\u015b\u0107 zaszyfrowana DER zawiera\u0142a dodatkowe, nieu\u017cywane dane.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Nieobs\u0142ugiwana krzywa eliptyczna.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Nieobs\u0142ugiwana posta\u0107 punktowa krzywej eliptycznej.
SEC_ERROR_UNRECOGNIZED_OID=Nieznany identyfikator obiektu.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Nieprawid\u0142owy certyfikat podpisywania OCSP w odpowiedzi OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Certyfikat zosta\u0142 odwo\u0142any na li\u015bcie odwo\u0142ania certyfikat\u00f3w wystawcy.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Responder OCSP wystawcy zg\u0142asza odwo\u0142anie certyfikatu.
SEC_ERROR_CRL_INVALID_VERSION=Lista CRL wystawcy ma nieznany numer wersji.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Lista CRL V1 wystawcy zawiera rozszerzenie krytyczne.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Lista CRL V2 wystawcy zawiera nieznane rozszerzenie krytyczne.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Okre\u015blono nieznany typ obiektu.
SEC_ERROR_INCOMPATIBLE_PKCS11=Sterownik PKCS \#11 \u0142amie specyfikacj\u0119 w spos\u00f3b niekompatybilny.
SEC_ERROR_NO_EVENT=W tej chwili nie ma dost\u0119pnych \u017cadnych zdarze\u0144 szczelinowych.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL ju\u017c istnieje.
SEC_ERROR_NOT_INITIALIZED=NSS nie jest zainicjowany.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Operacja si\u0119 nie powiod\u0142a, poniewa\u017c token PKCS\#11 nie jest zalogowany.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Skonfigurowany certyfikat respondera OCSP jest nieprawid\u0142owy.
SEC_ERROR_OCSP_BAD_SIGNATURE=Odpowied\u017a OCSP ma nieprawid\u0142owy podpis.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Wyszukiwanie walidacji certyfikatu przekroczy\u0142o limit wyszukiwania.
SEC_ERROR_INVALID_POLICY_MAPPING=Mapowanie polityki zawiera anypolicy.
SEC_ERROR_POLICY_VALIDATION_FAILED=\u0141a\u0144cuch certyfikat\u00f3w nie przechodzi weryfikacji polityki.
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Nieznany typ po\u0142o\u017cenia w rozszerzeniu AIA certyfikatu.
SEC_ERROR_BAD_HTTP_RESPONSE=Serwer zwr\u00f3ci\u0142 nieprawid\u0142ow\u0105 odpowied\u017a HTTP
SEC_ERROR_BAD_LDAP_RESPONSE=Serwer zwr\u00f3ci\u0142 nieprawid\u0142ow\u0105 odpowied\u017a LDAP
SEC_ERROR_FAILED_TO_ENCODE_DATA=Nie uda\u0142o si\u0119 zakodowa\u0107 danych koderem ANS1.
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Nieprawid\u0142owe po\u0142o\u017cenie dost\u0119pu do informacji w rozszerzeniu certyfikatu
SEC_ERROR_LIBPKIX_INTERNAL=Podczas weryfikacji certyfikatu wyst\u0105pi\u0142 wewn\u0119trzny b\u0142\u0105d libpkix.
SEC_ERROR_PKCS11_GENERAL_ERROR=Modu\u0142 PKCS \#11 zwr\u00f3ci\u0142 CKR_GENERAL_ERROR, co wskazuje na wyst\u0105pienie nieodwracalnego b\u0142\u0119du.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Modu\u0142 PKCS \#11 zwr\u00f3ci\u0142 CKR_FUNCTION_FAILED, co wskazuje, \u017ce \u017c\u0105dana funkcja nie mog\u0142a zosta\u0107 wykonana. Ponowna pr\u00f3ba wykonania tej operacji mo\u017ce si\u0119 uda\u0107.
SEC_ERROR_PKCS11_DEVICE_ERROR=Modu\u0142 PKCS \#11 zwr\u00f3ci\u0142 CKR_DEVICE_ERROR, co wskazuje, \u017ce wyst\u0105pi\u0142 problem z tokenem lub slotem.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Nieznana metoda dost\u0119pu do informacji w rozszerzeniu certyfikatu.
SEC_ERROR_CRL_IMPORT_FAILED=B\u0142\u0105d podczas pr\u00f3by importu listy CRL.
SEC_ERROR_EXPIRED_PASSWORD=Has\u0142o wygas\u0142o.
SEC_ERROR_LOCKED_PASSWORD=Has\u0142o jest zablokowane.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Nieznany b\u0142\u0105d PKCS \#11.
SEC_ERROR_BAD_CRL_DP_URL=Nieprawid\u0142owy lub nieobs\u0142ugiwany URL w nazwie punktu dystrybucji CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Certyfikat zosta\u0142 podpisany przy u\u017cyciu algorytmu, kt\u00f3ry zosta\u0142 wy\u0142\u0105czony jako niebezpieczny.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

