#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=Adresa URL je neplatn\u00e1 a nem\u016f\u017ee b\u00fdt na\u010dtena.
fileNotFound=Pale Moon nem\u016f\u017ee nal\u00e9zt soubor %S.
dnsNotFound=Pale Moon nem\u016f\u017ee nal\u00e9zt server %S.
protocolNotFound=Pale Moon nem\u016f\u017ee otev\u0159\u00edt tuto adresu, proto\u017ee k protokolu (%S) nen\u00ed p\u0159i\u0159azena \u017e\u00e1dn\u00e1 aplikace.
connectionFailure=Pale Moon nem\u016f\u017ee nav\u00e1zat spojen\u00ed se serverem %S.
netInterrupt=Spojen\u00ed se serverem %S bylo v pr\u016fb\u011bhu na\u010d\u00edt\u00e1n\u00ed str\u00e1nky ukon\u010deno.
netTimeout=P\u0159i pokusu kontaktovat server %S vypr\u0161el \u010dasov\u00fd limit.
redirectLoop=Server p\u0159esm\u011brov\u00e1v\u00e1 po\u017eadavky na tuto adresu s\u00e1m na sebe, a to takov\u00fdm zp\u016fsobem, kter\u00fd zabra\u0148uje jejich dokon\u010den\u00ed.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Pro zobrazen\u00ed t\u00e9to str\u00e1nky mus\u00ed %S znovu odeslat po\u017eadavek, kter\u00fd zopakuje akci (jako nap\u0159. hled\u00e1n\u00ed nebo potvrzen\u00ed objedn\u00e1vky), kter\u00e1 byla provedena ji\u017e d\u0159\u00edve.
resendButton.label=Znovu odeslat
unknownSocketType=Pale Moon nev\u00ed, jak m\u00e1 komunikovat s t\u00edmto serverem.
netReset=Spojen\u00ed se serverem bylo v pr\u016fb\u011bhu na\u010d\u00edt\u00e1n\u00ed str\u00e1nky ukon\u010deno.
notCached=Tento dokument ji\u017e nen\u00ed dostupn\u00fd.
netOffline=Webov\u00e1 str\u00e1nka je nedostupn\u00e1, proto\u017ee Pale Moon je nyn\u00ed v re\u017eimu offline.
isprinting=Dokument nelze m\u011bnit p\u0159i tisku nebo p\u0159i n\u00e1hledu tisku.
deniedPortAccess=Tato adresa obsahuje \u010d\u00edslo portu, kter\u00e9 je obvykle pou\u017e\u00edv\u00e1no k jin\u00fdm \u00fa\u010del\u016fm ne\u017e prohl\u00ed\u017een\u00ed webov\u00fdch str\u00e1nek. Z bezpe\u010dnostn\u00edch d\u016fvod\u016f Pale Moon tento po\u017eadavek zru\u0161il.
proxyResolveFailure=Pale Moon je nastaven, aby pou\u017e\u00edval proxy server, kter\u00fd nelze nal\u00e9zt.
proxyConnectFailure=Pale Moon je nastaven, aby pou\u017e\u00edval proxy server, kter\u00fd odm\u00edt\u00e1 spojen\u00ed.
contentEncodingError=Str\u00e1nka, kterou se sna\u017e\u00edte na\u010d\u00edst, nem\u016f\u017ee b\u00fdt zobrazena, proto\u017ee server pou\u017e\u00edv\u00e1 neplatn\u00fd \u010di nepodporovan\u00fd zp\u016fsob komprimace dat.
unsafeContentType=Str\u00e1nka, kterou se sna\u017e\u00edte na\u010d\u00edst, nem\u016f\u017ee b\u00fdt zobrazena, proto\u017ee je obsa\u017eena v typu souboru, kter\u00fd nen\u00ed bezpe\u010dn\u00e9 otev\u00edrat. Kontaktujte pros\u00edm vlastn\u00edka str\u00e1nky a informujte ho o tomto probl\u00e9mu.
externalProtocolTitle=Po\u017eadavek extern\u00edho protokolu
externalProtocolPrompt=Pro obsluhu odkazu %1$S mus\u00ed b\u00fdt spu\u0161t\u011bna extern\u00ed aplikace. Po\u017eadovan\u00fd odkaz\:\n\n\n%2$S\nAplikace\: %3$S\n\n\nPokud jste tento po\u017eadavek neo\u010dek\u00e1vali, jedn\u00e1 se mo\u017en\u00e1 o pokus o zneu\u017eit\u00ed slabin extern\u00ed aplikace. Pokud si nejste jisti, jestli tento po\u017eadavek nen\u00ed z\u00e1ke\u0159n\u00fd, doporu\u010dujeme ho zru\u0161it.
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Nezn\u00e1m\u00e1 aplikace>
externalProtocolChkMsg=Zapamatovat si tuto volbu pro v\u0161echny odkazy stejn\u00e9ho typu.
externalProtocolLaunchBtn=Spustit aplikaci
malwareBlocked=Str\u00e1nka %S byla nahl\u00e1\u0161ena jako \u00fato\u010dn\u00e1 str\u00e1nka a tak byla na z\u00e1klad\u011b va\u0161eho nastaven\u00ed zablokov\u00e1na.
phishingBlocked=Str\u00e1nka %S byla nahl\u00e1\u0161ena jako podvodn\u00e1 str\u00e1nka, jej\u00edm\u017e \u00fa\u010delem je vyl\u00e1kat z u\u017eivatel\u016f jejich osobn\u00ed \u010di finan\u010dn\u00ed informace.
cspFrameAncestorBlocked=Bezpe\u010dnostn\u00ed pravidla t\u00e9to str\u00e1nky j\u00ed nedovol\u00ed, aby byla vlo\u017eena t\u00edmto zp\u016fsobem.
xssBlockMode=Tato str\u00e1nka obsahuje zranitelnost na XSS \u00fatok, a z bezpe\u010dnostn\u00edch d\u016fvod\u016f byla zablokov\u00e1na.
corruptedContentError=Str\u00e1nka, kterou se sna\u017e\u00edte na\u010d\u00edst, nem\u016f\u017ee b\u00fdt zobrazena, proto\u017ee p\u0159enesen\u00e1 data jsou chybn\u00e1.
remoteXUL=Tato str\u00e1nka vyu\u017e\u00edv\u00e1 nepodporovanou technologii, kter\u00e1 nen\u00ed ve v\u00fdchoz\u00edm nastaven\u00ed Pale Moon povolena.

