#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=A URL n\u00e3o \u00e9 v\u00e1lida e n\u00e3o pode ser carregada.
fileNotFound=O Pale Moon n\u00e3o consegue encontrar o ficheiro em %S.
dnsNotFound=O Pale Moon n\u00e3o consegue encontrar o servidor em %S.
protocolNotFound=O Pale Moon n\u00e3o sabe como abrir este endere\u00e7o, por causa do protocolo (%S) n\u00e3o estar associado a nenhum programa.
connectionFailure=O Pale Moon n\u00e3o consegue estabelecer uma liga\u00e7\u00e3o para o servidor em %S.
netInterrupt=A liga\u00e7\u00e3o para %S foi interrompida enquanto a p\u00e1gina carregava.
netTimeout=O servidor %S est\u00e1 a demorar demasiado tempo a responder.
redirectLoop=O Pale Moon detectou que o servidor est\u00e1 a redireccionar o pedido para este endere\u00e7o de modo a que o processo nunca esteja conclu\u00eddo.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=Para mostrar esta p\u00e1gina o %S tem de reenviar informa\u00e7\u00e3o que ir\u00e1 repetir ac\u00e7\u00f5es realizadas anteriormente (como uma procura ou a confirma\u00e7\u00e3o de uma encomenda).
resendButton.label=Reenviar
unknownSocketType=O Pale Moon n\u00e3o sabe como comunicar com o servidor.
netReset=A liga\u00e7\u00e3o para o servidor foi reposta enquanto a p\u00e1gina estava a ser carregada.
notCached=Este documento j\u00e1 n\u00e3o est\u00e1 dispon\u00edvel.
netOffline=O Pale Moon est\u00e1 actualmente no modo desligado e n\u00e3o pode navegar na Web.
isprinting=O documento n\u00e3o pode ser alterado enquanto estiver a ser impresso ou no modo de pr\u00e9-visualiza\u00e7\u00e3o.
deniedPortAccess=Este endere\u00e7o utiliza uma porta de rede que \u00e9 normalmente utilizada para outros fins para al\u00e9m da navega\u00e7\u00e3o Web. Para sua protec\u00e7\u00e3o o Pale Moon cancelou o pedido.
proxyResolveFailure=O Pale Moon est\u00e1 configurado para utilizar um servidor de proxy que n\u00e3o pode ser encontrado.
proxyConnectFailure=O Pale Moon est\u00e1 configurado para utilizar um servidor de proxy que est\u00e1 a recusar liga\u00e7\u00f5es.
contentEncodingError=A p\u00e1gina que est\u00e1 a tentar ver n\u00e3o pode ser mostrada porque cont\u00e9m uma forma de compress\u00e3o inv\u00e1lida ou n\u00e3o suportada. Por favor contacte os donos do s\u00edtio web para os informar deste problema.
unsafeContentType=A p\u00e1gina que est\u00e1 a tentar ver n\u00e3o pode ser mostrada porque tem um tipo de ficheiros que pode n\u00e3o ser seguro abrir. Por favor contacte os donos do s\u00edtio web e informe-os deste problema.
externalProtocolTitle=Pedido de protocolo externo
externalProtocolPrompt=\u00c9 necess\u00e1rio executar uma aplica\u00e7\u00e3o externa para operar %1$S\: liga\u00e7\u00f5es. Liga\u00e7\u00e3o requerida\:\n\n\n%2$S\nAplica\u00e7\u00e3o\: %3$S\n\n\nSe n\u00e3o estava \u00e0 espera deste pedido, ele pode ser uma tentativa para explorar uma falha de seguran\u00e7a no outro programa. Cancele este pedido a menos que tenha a certeza de que n\u00e3o \u00e9 malicioso.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Desconhecido>
externalProtocolChkMsg=Relembrar a minha escolha para todas as liga\u00e7\u00f5es deste tipo.
externalProtocolLaunchBtn=Executar a aplica\u00e7\u00e3o
malwareBlocked=O s\u00edtio web em %S foi reportado como um s\u00edtio de ataque e foi bloqueado com base nas suas prefer\u00eancias de seguran\u00e7a.
phishingBlocked=O s\u00edtio web em %S foi reportado como uma falsifica\u00e7\u00e3o web desenhada para enganar os utilizadores e faz\u00ea-los partilhar informa\u00e7\u00e3o pessoal ou financeira.
cspFrameAncestorBlocked=Esta p\u00e1gina tem uma pol\u00edtica de conte\u00fados que previne que seja embutida desta maneira.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=A p\u00e1gina que est\u00e1 a tentar visualizar n\u00e3o pode ser apresentada porque foi detectado um erro na transmiss\u00e3o de dados.
remoteXUL=Esta p\u00e1gina utiliza uma tecnologia que j\u00e1 n\u00e3o \u00e9 suportada por defeito.

