#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=G\u00fcvenli ileti\u015fim kurulamad\u0131. Kar\u015f\u0131 taraf y\u00fcksek d\u00fczeyde \u015fifrelemeyi desteklemiyor.
SSL_ERROR_US_ONLY_SERVER=G\u00fcvenli ileti\u015fim kurulamad\u0131. Kar\u015f\u0131 taraf \u015fu an desteklenmeyen y\u00fcksek d\u00fczey \u015fifreleme istiyor.
SSL_ERROR_NO_CYPHER_OVERLAP=Kar\u015f\u0131 tarafla g\u00fcvenli ileti\u015fim kurulamad\u0131\: Ortak bir \u015fifreleme \u00e7\u00f6z\u00fcm yolu yok.
SSL_ERROR_NO_CERTIFICATE=Do\u011frulama i\u00e7in gereken onay belgesi ya da anahtar bulunamad\u0131.
SSL_ERROR_BAD_CERTIFICATE=Kar\u015f\u0131 tarafla g\u00fcvenli ileti\u015fim kurulamad\u0131\: Kar\u015f\u0131 taraf\u0131n onay belgesi reddedildi.
SSL_ERROR_UNUSED_5=Tan\u0131nmayan SSL hata kodu.
SSL_ERROR_BAD_CLIENT=Sunucu istemcide k\u00f6t\u00fc veri ile kar\u015f\u0131la\u015ft\u0131.
SSL_ERROR_BAD_SERVER=\u0130stemci sunucuda k\u00f6t\u00fc veri ile kar\u015f\u0131la\u015ft\u0131.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Desteklenmeyen onay belgesi t\u00fcr\u00fc.
SSL_ERROR_UNSUPPORTED_VERSION=Kar\u015f\u0131 taraf desteklenmeyen bir g\u00fcvenlik ileti\u015fim kural\u0131 kullan\u0131yor.
SSL_ERROR_UNUSED_10=Tan\u0131nmayan SSL hata kodu.
SSL_ERROR_WRONG_CERTIFICATE=\u0130stemci do\u011frulamas\u0131 ba\u015far\u0131s\u0131z oldu\: Anahtar veritaban\u0131ndaki \u00f6zel anahtar, onay belgesi veritaban\u0131ndaki genel anahtarla e\u015fle\u015fmiyor.
SSL_ERROR_BAD_CERT_DOMAIN=Kar\u015f\u0131 tarafla g\u00fcvenli ileti\u015fim kurulamad\u0131\: \u00c7a\u011fr\u0131lan alan ad\u0131 ile sunucunun onay belgesi e\u015fle\u015fmiyor.
SSL_ERROR_POST_WARNING=Tan\u0131nmayan SSL hata kodu.
SSL_ERROR_SSL2_DISABLED=Kar\u015f\u0131 taraf sadece, yerel olarak devre d\u0131\u015f\u0131 olan SSL 2 s\u00fcr\u00fcm\u00fcn\u00fc destekliyor.
SSL_ERROR_BAD_MAC_READ=SSL ge\u00e7ersiz ileti do\u011frulama kodu i\u00e7eren bir kay\u0131t ald\u0131.
SSL_ERROR_BAD_MAC_ALERT=SSL e\u015fi, ge\u00e7ersiz bir ileti do\u011frulama kodu bildiriyor.
SSL_ERROR_BAD_CERT_ALERT=SSL e\u015fi onay belgenizin do\u011frulu\u011funu kan\u0131tlayam\u0131yor.
SSL_ERROR_REVOKED_CERT_ALERT=SSL e\u015fi onay belgenizi h\u00fck\u00fcms\u00fcz oldu\u011fu gerek\u00e7esiyle geri \u00e7evirdi.
SSL_ERROR_EXPIRED_CERT_ALERT=SSL e\u015fi onay belgenizi s\u00fcresinin doldu\u011fu gerek\u00e7esiyle geri \u00e7evirdi.
SSL_ERROR_SSL_DISABLED=Ba\u011flan\u0131lam\u0131yor\: SSL devre d\u0131\u015f\u0131.
SSL_ERROR_FORTEZZA_PQG=Ba\u011flan\u0131lam\u0131yor\: SSL e\u015fi di\u011fer bir FORTEZZA alan ad\u0131nda.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Bilinmeyen bir SSL \u015fifreleme tak\u0131m\u0131 istendi.
SSL_ERROR_NO_CIPHERS_SUPPORTED=Bu programda hi\u00e7bir \u015fifreleme tak\u0131m\u0131 yok ve devrede de\u011fil.
SSL_ERROR_BAD_BLOCK_PADDING=SSL yanl\u0131\u015f blok dolgusu olan bir kay\u0131t ald\u0131.
SSL_ERROR_RX_RECORD_TOO_LONG=SSL izin verilen uzunlu\u011fu a\u015fan bir kay\u0131t ald\u0131.
SSL_ERROR_TX_RECORD_TOO_LONG=SSL izin verilen uzunlu\u011fu a\u015fan bir kay\u0131t g\u00f6ndermeye kalkt\u0131.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=SSL kusurlu bir kar\u015f\u0131la\u015fama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=SSL kusurlu bir istemci kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=SSL kusurlu bir sunucu kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=SSL kusurlu bir onay belgesi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=SSL kusurlu bir sunucu anahtar de\u011fi\u015fimi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=SSL kusurlu bir onay belgesi iste\u011fi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=SSL kusurlu bir sunucuyu ba\u015far\u0131l\u0131 kar\u015f\u0131la\u015fama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=SSL kusurlu bir onay belgesi do\u011frulamas\u0131 kar\u015f\u0131la\u015fama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=SSL kusurlu bir istemci anahtar de\u011fi\u015fimi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_FINISHED=SSL kusurlu bir biti\u015f kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=SSL kusurlu bir \u015fifreleme de\u011fi\u015fim kayd\u0131 ald\u0131.
SSL_ERROR_RX_MALFORMED_ALERT=SSL kusurlu bir uyar\u0131 kayd\u0131 ald\u0131.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=SSL kusurlu bir kar\u015f\u0131lama kayd\u0131 ald\u0131.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=SSL kusurlu bir uygulama veri kayd\u0131 ald\u0131.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=SSL beklenmeyen bir kar\u015f\u0131lama iste\u011fi iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=SSL beklenmeyen bir istemci kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=SSL beklenmeyen bir sunucu kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=SSL beklenmeyen bir onay belgesi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=SSL beklenmeyen bir sunucu anahtar de\u011fi\u015fimi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=SSL beklenmeyen bir onay belgesi iste\u011fi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=SSL beklenmeyen bir sunucuyu ba\u015far\u0131l\u0131 kar\u015f\u0131la\u015fama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=SSL beklenmeyen bir onay belgesi do\u011frulamas\u0131 kar\u015f\u0131la\u015fama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=SSL beklenmeyen bir sunucu anahtar de\u011fi\u015fimi kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_FINISHED=SSL beklenmeyen bir biti\u015f kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=SSL beklenmeyen bir \u015fifreleme de\u011fi\u015fim kayd\u0131 ald\u0131.
SSL_ERROR_RX_UNEXPECTED_ALERT=SSL beklenmeyen bir uyar\u0131 kayd\u0131 ald\u0131.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=SSL beklenmeyen bir kar\u015f\u0131lama kayd\u0131 ald\u0131.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=SSL beklenmeyen bir uygulama veri kayd\u0131 ald\u0131.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=SSL bilinmeyen bir i\u00e7erik t\u00fcr\u00fcyle ilgili kay\u0131t ald\u0131.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=SSL bilinmeyen bir t\u00fcrde kar\u015f\u0131lama iletisi ald\u0131.
SSL_ERROR_RX_UNKNOWN_ALERT=SSL bilinmeyen tan\u0131m ta\u015f\u0131yan bir uyar\u0131 kayd\u0131 ald\u0131.
SSL_ERROR_CLOSE_NOTIFY_ALERT=SSL e\u015fi bu ba\u011flant\u0131y\u0131 kesti.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=SSL e\u015fi ald\u0131\u011f\u0131 kar\u015f\u0131lama iletisini beklemiyordu.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=SSL e\u015fi ald\u0131\u011f\u0131 SSL kayd\u0131n\u0131 a\u00e7may\u0131 ba\u015faramad\u0131.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=SSL e\u015fi kabul edilebilir say\u0131da g\u00fcvenlik de\u011fi\u015fkeniyle kar\u015f\u0131l\u0131kl\u0131 g\u00f6r\u00fc\u015fmeyi sa\u011flayamad\u0131.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=SSL e\u015fi kabul edilemez i\u00e7erik y\u00fcz\u00fcnden kar\u015f\u0131lama iletisini geri \u00e7evirdi.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=SSL e\u015fi ald\u0131\u011f\u0131 t\u00fcrdeki onay belgelerini desteklemiyor.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=SSL e\u015fi ald\u0131\u011f\u0131 onay belgeleriyle belirlenemeyen t\u00fcrde sorunlar ya\u015fad\u0131.
SSL_ERROR_GENERATE_RANDOM_FAILURE=SSL rastlant\u0131sal numara \u00fcretecinde bir sorun ya\u015fad\u0131.
SSL_ERROR_SIGN_HASHES_FAILURE=Onay belgenizin do\u011frulu\u011funu kan\u0131tlayacak veri, say\u0131sal olarak imzalanamad\u0131.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=SSL kar\u015f\u0131 taraf\u0131n onay belgesinden genel anahtar\u0131 \u00e7\u0131karamad\u0131.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=SSL sunucusu anahtar de\u011fi\u015ftirme kar\u015f\u0131lamas\u0131 s\u0131ras\u0131nda belirtilmemi\u015f bir hatayla kar\u015f\u0131la\u015ft\u0131.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=SSL istemcisi anahtar de\u011fi\u015ftirme kar\u015f\u0131lamas\u0131 s\u0131ras\u0131nda belirtilmemi\u015f bir hatayla kar\u015f\u0131la\u015ft\u0131.
SSL_ERROR_ENCRYPTION_FAILURE=Se\u00e7ili \u015fifreleme tak\u0131m\u0131ndaki toplu veri \u015fifreleme \u00e7\u00f6z\u00fcm yolu ba\u015far\u0131s\u0131z oldu.
SSL_ERROR_DECRYPTION_FAILURE=Se\u00e7ili \u015fifreleme tak\u0131m\u0131ndaki toplu veri \u015fifre \u00e7\u00f6zme \u00e7\u00f6z\u00fcm yolu ba\u015far\u0131s\u0131z oldu.
SSL_ERROR_SOCKET_WRITE_FAILURE=Temeli olu\u015fturan yuvaya \u015fifreli veri yazmaya \u00e7al\u0131\u015fma giri\u015fimi ba\u015far\u0131s\u0131z oldu.
SSL_ERROR_MD5_DIGEST_FAILURE=MD5 derleme i\u015flevi \u00e7al\u0131\u015fmad\u0131.
SSL_ERROR_SHA_DIGEST_FAILURE=SHA-1 derleme i\u015flevi \u00e7al\u0131\u015fmad\u0131.
SSL_ERROR_MAC_COMPUTATION_FAILURE=MAC hesaplamas\u0131 ba\u015far\u0131s\u0131z oldu.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Simetrik anahtar i\u00e7eri\u011fi \u00fcretimi ba\u015far\u0131s\u0131z oldu.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=\u0130stemci anahtar de\u011fi\u015fim iletisindeki simetrik anahtar \u00e7\u00f6z\u00fclemedi.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=SSL sunucusu yerel d\u00fczeydeki genel anahtarla d\u0131\u015fa aktar\u0131lan \u015fifreleme tak\u0131m\u0131n\u0131 kullanmay\u0131 denedi.
SSL_ERROR_IV_PARAM_FAILURE=PKCS11 kodu, bir IV'yi bir de\u011fi\u015fkene \u00e7eviremedi.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Se\u00e7ilen \u015fifreleme tak\u0131m\u0131 \u00e7al\u0131\u015ft\u0131r\u0131lamad\u0131.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=\u0130stemci, SSL oturumu i\u00e7in anahtar \u00fcretmeyi beceremedi.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Sunucu, \u00fczerinde \u00e7al\u0131\u015f\u0131lan de\u011fi\u015fim \u00e7\u00f6z\u00fcm yolu i\u00e7in hi\u00e7bir anahtara sahip de\u011fil.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=\u0130\u015flem s\u00fcrerken PKCS\#11 i\u015fareti eklendi ya da kald\u0131r\u0131ld\u0131.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Gerekli bir i\u015flemi yapmak \u00fczere aranan PKCS\#11 i\u015fareti bulunamad\u0131.
SSL_ERROR_NO_COMPRESSION_OVERLAP=Kar\u015f\u0131 tarafla g\u00fcvenli ileti\u015fim kurulamad\u0131\: Ortak bir s\u0131k\u0131\u015ft\u0131rma \u00e7\u00f6z\u00fcm yolu yok.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=H\u00e2lihaz\u0131rdaki SSL kar\u015f\u0131lamas\u0131 bitmeden ba\u015fka bir kar\u015f\u0131lamaya giri\u015filemez.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=E\u015ften yanl\u0131\u015f kar\u015f\u0131lama \u00f6zeti de\u011ferleri al\u0131nd\u0131.
SSL_ERROR_CERT_KEA_MISMATCH=Sunulan onay belgesi se\u00e7ilen anahtar de\u011fi\u015ftirme \u00e7\u00f6z\u00fcm yoluyla kullan\u0131lamaz.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=SSL istemci do\u011frulamas\u0131 konusunda hi\u00e7bir onay belgesi yetkilisine g\u00fcvenilmiyor.
SSL_ERROR_SESSION_NOT_FOUND=\u0130stemcinin SLL oturum kimli\u011fi sunucunun oturum \u00f6n belle\u011finde bulunamad\u0131.
SSL_ERROR_DECRYPTION_FAILED_ALERT=E\u015f, ald\u0131\u011f\u0131 bir SSL kayd\u0131n\u0131n \u015fifresini \u00e7\u00f6zemedi.
SSL_ERROR_RECORD_OVERFLOW_ALERT=E\u015f izin verilenden daha uzun olan bir SSL kayd\u0131 ald\u0131.
SSL_ERROR_UNKNOWN_CA_ALERT=E\u015f, onay belgenizi da\u011f\u0131tan yetkiliyi tan\u0131m\u0131yor ve ona g\u00fcvenmiyor.
SSL_ERROR_ACCESS_DENIED_ALERT=E\u015f ge\u00e7erli bir onay belgesi ald\u0131, ancak eri\u015fim engellendi.
SSL_ERROR_DECODE_ERROR_ALERT=E\u015f bir SSL kar\u015f\u0131lama iletisini \u00e7\u00f6zemedi.
SSL_ERROR_DECRYPT_ERROR_ALERT=E\u015f imza do\u011frulama ya da anahtar de\u011fi\u015fim hatas\u0131 oldu\u011funu bildiriyor.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=E\u015f g\u00f6r\u00fc\u015fmenin ihracat d\u00fczenlemeleriyle uyumlu olmad\u0131\u011f\u0131n\u0131 bildiriyor.
SSL_ERROR_PROTOCOL_VERSION_ALERT=E\u015f uyumsuz ya da desteklenmeyen ileti\u015fim kural\u0131 s\u00fcr\u00fcm\u00fc oldu\u011funu bildiriyor.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Sunucu i\u00e7in \u015fifrelerin istemcinin destekledi\u011finden daha g\u00fcvenli olmas\u0131 gerekiyor.
SSL_ERROR_INTERNAL_ERROR_ALERT=E\u015f bir i\u00e7 hata ya\u015fad\u0131\u011f\u0131n\u0131 bildiriyor.
SSL_ERROR_USER_CANCELED_ALERT=E\u015f kullan\u0131c\u0131 kar\u015f\u0131lamay\u0131 iptal etti.
SSL_ERROR_NO_RENEGOTIATION_ALERT=E\u015f SSL g\u00fcvenlik de\u011fi\u015fkenlerinin yeniden g\u00f6r\u00fc\u015f\u00fclmesine izin vermiyor.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=SSL sunucusu bu yuva i\u00e7in ayarlanmad\u0131 ve devre d\u0131\u015f\u0131 b\u0131rak\u0131lmad\u0131.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=SSL e\u015fi istenen TLS eklentisini desteklemiyor.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=SSL e\u015fi verdi\u011finiz URL'den onay belgenize ula\u015famad\u0131.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=SSL e\u015fi istenen DNS i\u00e7in onay belgesine sahip de\u011fil.
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=SSL e\u015fi onay belgesi i\u00e7in OCSP yan\u0131t\u0131 almay\u0131 beceremedi.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=SSL e\u015fi bozulmu\u015f onay belgesi \u00f6zeti oldu\u011funu bildirdi.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=SSL beklenmeyen bir Yeni Oturum Talebi el s\u0131k\u0131\u015fma iletisi ald\u0131.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=SSL kusurlu bir Yeni Oturum Talebi el s\u0131k\u0131\u015fma iletisi ald\u0131.
SSL_ERROR_DECOMPRESSION_FAILURE=SSL \u00e7\u00f6z\u00fclemeyen bir s\u0131k\u0131\u015ft\u0131r\u0131lm\u0131\u015f kay\u0131t ald\u0131.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Bu SSL soketinde yeniden i\u015fleme izin verilmiyor.
SSL_ERROR_UNSAFE_NEGOTIATION=E\u015f, eski nesil (potansiyel olarak g\u00fcvensiz) el s\u0131k\u0131\u015fmas\u0131 talebinde bulundu.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=SSL beklenmeyen bir s\u0131k\u0131\u015ft\u0131r\u0131lm\u0131\u015f kay\u0131t ald\u0131.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=SSL, Sunucu Anahtar\u0131 De\u011fi\u015fimi el s\u0131k\u0131\u015fma iletisinde zay\u0131f bir ge\u00e7ici Diffie-Hellman anahtar\u0131 ald\u0131.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=SSL, ge\u00e7ersiz NPN uzant\u0131 verisi ald\u0131.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=SSL 2.0 ba\u011flant\u0131lar\u0131 i\u00e7in SSL \u00f6zelli\u011fi desteklenmiyor.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Sunucular i\u00e7in SSL \u00f6zelli\u011fi desteklenmiyor.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=\u0130stemciler i\u00e7in SSL \u00f6zelli\u011fi desteklenmiyor.
SSL_ERROR_INVALID_VERSION_RANGE=SSL version range is not valid.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=SSL peer selected a cipher suite disallowed for the selected protocol version.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=SSL received a malformed Hello Verify Request handshake message.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=SSL received an unexpected Hello Verify Request handshake message.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=SSL feature not supported for the protocol version.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=SSL received an unexpected Certificate Status handshake message.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Unsupported hash algorithm used by TLS peer.
SSL_ERROR_DIGEST_FAILURE=Digest function failed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=Incorrect signature algorithm specified in a digitally-signed element.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=The server supports no protocols that the client advertises in the ALPN extension.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
SEC_ERROR_IO=G\u00fcvenlik do\u011frulamas\u0131 s\u0131ras\u0131nda giri\u015f-\u00e7\u0131k\u0131\u015f hatas\u0131 meydana geldi.
SEC_ERROR_LIBRARY_FAILURE=G\u00fcvenlik kitapl\u0131\u011f\u0131 hatas\u0131.
SEC_ERROR_BAD_DATA=G\u00fcvenlik kitapl\u0131\u011f\u0131\: K\u00f6t\u00fc veri al\u0131nd\u0131.
SEC_ERROR_OUTPUT_LEN=G\u00fcvenlik kitapl\u0131\u011f\u0131\: \u00c7\u0131kt\u0131 uzunlu\u011fu hatas\u0131.
SEC_ERROR_INPUT_LEN=G\u00fcvenlik kitapl\u0131\u011f\u0131 girdi uzunlu\u011fu hatas\u0131 ya\u015fad\u0131.
SEC_ERROR_INVALID_ARGS=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Ge\u00e7ersiz ba\u011f\u0131ms\u0131z de\u011fi\u015fkenler.
SEC_ERROR_INVALID_ALGORITHM=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Ge\u00e7ersiz \u00e7\u00f6z\u00fcm yolu.
SEC_ERROR_INVALID_AVA=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Ge\u00e7ersiz AVA.
SEC_ERROR_INVALID_TIME=D\u00fczg\u00fcn bi\u00e7imlendirilmemi\u015f tarih dizgisi.
SEC_ERROR_BAD_DER=G\u00fcvenlik kitapl\u0131\u011f\u0131\: D\u00fczg\u00fcn bi\u00e7imlendirilmemi\u015f DER \u015fifreli ileti.
SEC_ERROR_BAD_SIGNATURE=E\u015fin onay belgesi ge\u00e7ersiz bir imzaya sahip.
SEC_ERROR_EXPIRED_CERTIFICATE=E\u015fin onay belgesinin s\u00fcresi doldu.
SEC_ERROR_REVOKED_CERTIFICATE=E\u015fin onay belgesi h\u00fck\u00fcms\u00fcz olmu\u015f.
SEC_ERROR_UNKNOWN_ISSUER=E\u015fin onay belgesini da\u011f\u0131tan tan\u0131nm\u0131yor.
SEC_ERROR_BAD_KEY=E\u015fin genel anahtar\u0131 ge\u00e7ersiz.
SEC_ERROR_BAD_PASSWORD=Girilen g\u00fcvenlik parolas\u0131 yanl\u0131\u015f.
SEC_ERROR_RETRY_PASSWORD=Yeni parola yanl\u0131\u015f girildi. L\u00fctfen yeniden deneyin.
SEC_ERROR_NO_NODELOCK=G\u00fcvenlik kitapl\u0131\u011f\u0131\: D\u00fc\u011f\u00fcm kilidi yok.
SEC_ERROR_BAD_DATABASE=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Bozuk veritaban\u0131.
SEC_ERROR_NO_MEMORY=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Bellek payla\u015f\u0131m hatas\u0131.
SEC_ERROR_UNTRUSTED_ISSUER=E\u015fin onay belgesi da\u011f\u0131t\u0131c\u0131s\u0131, kullan\u0131c\u0131 taraf\u0131ndan g\u00fcvenilmez olarak i\u015faretlendi.
SEC_ERROR_UNTRUSTED_CERT=E\u015fin onay belgesi, kullan\u0131c\u0131 taraf\u0131ndan g\u00fcvenilmez olarak i\u015faretlendi.
SEC_ERROR_DUPLICATE_CERT=Onay belgesi zaten veritaban\u0131n\u0131zda var.
SEC_ERROR_DUPLICATE_CERT_NAME=Onay belgesinin ismi veritaban\u0131n\u0131zdakiyle ayn\u0131.
SEC_ERROR_ADDING_CERT=Onay belgesini veritaban\u0131na eklerken hata meydana geldi.
SEC_ERROR_FILING_KEY=Onay belgesinin anahtar\u0131 yeniden doldurulurken hata meydana geldi.
SEC_ERROR_NO_KEY=Bu onay belgesinin \u00f6zel anahtar\u0131 veritaban\u0131nda bulunam\u0131yor.
SEC_ERROR_CERT_VALID=Bu onay belgesi ge\u00e7erli.
SEC_ERROR_CERT_NOT_VALID=Bu onay belgesi ge\u00e7erli de\u011fil.
SEC_ERROR_CERT_NO_RESPONSE=Onay belgesi kitapl\u0131\u011f\u0131\: Yan\u0131t yok.
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Onay belgesi da\u011f\u0131t\u0131c\u0131s\u0131n\u0131n onay belgesinin s\u00fcresi dolmu\u015f. Sistem tarihi ve saatini g\u00f6zden ge\u00e7irin.
SEC_ERROR_CRL_EXPIRED=Onay belgesi da\u011f\u0131t\u0131c\u0131s\u0131n\u0131n h\u00fck\u00fcms\u00fczler listesinin s\u00fcresi dolmu\u015f. Listeyi g\u00fcncelleyin ya da sistem tarihi ve saatini g\u00f6zden ge\u00e7irin.
SEC_ERROR_CRL_BAD_SIGNATURE=Onay belgesi da\u011f\u0131t\u0131c\u0131s\u0131n\u0131n h\u00fck\u00fcms\u00fczler listesinin ge\u00e7ersiz imzas\u0131 var.
SEC_ERROR_CRL_INVALID=Yeni h\u00fck\u00fcms\u00fczler listesi ge\u00e7ersiz bi\u00e7ime sahip.
SEC_ERROR_EXTENSION_VALUE_INVALID=Onay belgesi uzant\u0131 de\u011feri ge\u00e7ersiz.
SEC_ERROR_EXTENSION_NOT_FOUND=Onay belgesi uzant\u0131s\u0131 bulunamad\u0131.
SEC_ERROR_CA_CERT_INVALID=Da\u011f\u0131t\u0131c\u0131n\u0131n onay belgesi ge\u00e7ersiz.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Onay belgesi konum uzunlu\u011fu s\u0131n\u0131r\u0131 ge\u00e7ersiz.
SEC_ERROR_CERT_USAGES_INVALID=Onay belgesi kullan\u0131m alan\u0131 ge\u00e7ersiz.
SEC_INTERNAL_ONLY=**SADECE i\u00e7 birim**
SEC_ERROR_INVALID_KEY=Anahtar istenen i\u015flemi desteklemiyor.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Onay belgesi bilinmeyen kritik uzant\u0131lar i\u00e7eriyor.
SEC_ERROR_OLD_CRL=Yeni h\u00fck\u00fcms\u00fczler listesinin tarihi h\u00e2lihaz\u0131rdakinden daha yeni de\u011fil.
SEC_ERROR_NO_EMAIL_CERT=\u015eifrelenmemi\u015f ya da imzalanmam\u0131\u015f\: Hen\u00fcz e-posta onay belgeniz yok.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=\u015eifrelenmemi\u015f\: Her bir al\u0131c\u0131 i\u00e7in onay belgeniz yok.
SEC_ERROR_NOT_A_RECIPIENT=\u015eifre \u00e7\u00f6z\u00fclemiyor\: Al\u0131c\u0131 siz de\u011filsiniz ya da birbiriyle e\u015fle\u015fen onay belgesi ya da \u00f6zel anahtar bulunamad\u0131.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=\u015eifre \u00e7\u00f6z\u00fclemiyor\: Anahtar \u015fifreleme \u00e7\u00f6z\u00fcm yolu onay belgenizle e\u015fle\u015fmiyor.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Anahtar do\u011frulamas\u0131 ba\u015far\u0131s\u0131z oldu\: \u0130mzac\u0131 bulunamam\u0131\u015f, \u00e7ok fazla imzac\u0131 bulunmu\u015f ya da d\u00fczg\u00fcn olmayan veya eksik veri ile i\u015flem yap\u0131lm\u0131\u015f olabilir.
SEC_ERROR_UNSUPPORTED_KEYALG=Desteklenmeyen ya da bilinmeyen anahtar \u00e7\u00f6z\u00fcm yolu.
SEC_ERROR_DECRYPTION_DISALLOWED=\u015eifre \u00e7\u00f6z\u00fclemiyor\: \u0130zin verilmeyen bir \u00e7\u00f6z\u00fcm yoluyla ya da anahtar boyutunda \u015fifrelenmi\u015f.
XP_SEC_FORTEZZA_BAD_CARD=Fortezza kart\u0131 d\u00fczg\u00fcn olarak \u00e7al\u0131\u015ft\u0131r\u0131lamad\u0131. L\u00fctfen \u00e7\u0131kar\u0131p da\u011f\u0131t\u0131c\u0131n\u0131za geri g\u00f6t\u00fcr\u00fcn.
XP_SEC_FORTEZZA_NO_CARD=Fortezza kart\u0131 bulunamad\u0131
XP_SEC_FORTEZZA_NONE_SELECTED=Fortezza kart\u0131 se\u00e7ilmedi
XP_SEC_FORTEZZA_MORE_INFO=L\u00fctfen daha fazla bilgi almak \u00fczere bir ki\u015filik se\u00e7in
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Ki\u015filik bulunamad\u0131
XP_SEC_FORTEZZA_NO_MORE_INFO=Bu ki\u015filikle ilgili daha fazla bilgi yok
XP_SEC_FORTEZZA_BAD_PIN=Ge\u00e7ersiz ki\u015fisel tan\u0131mlama numaras\u0131
XP_SEC_FORTEZZA_PERSON_ERROR=Fortezza ki\u015filiklerine ula\u015f\u0131lamad\u0131.
SEC_ERROR_NO_KRL=Bu siteyle ilgili herhangi bir ge\u00e7ersiz anahtar listesi bulunamad\u0131.
SEC_ERROR_KRL_EXPIRED=Bu sitenin ge\u00e7ersiz anahtar listesinin s\u00fcresi dolmu\u015f.
SEC_ERROR_KRL_BAD_SIGNATURE=Bu sitenin ge\u00e7ersiz anahtar listesinin anahtar\u0131 ge\u00e7ersiz.
SEC_ERROR_REVOKED_KEY=Bu sitenin onay belgesi anahtar\u0131 h\u00fck\u00fcms\u00fczle\u015fmi\u015f.
SEC_ERROR_KRL_INVALID=Yeni ge\u00e7ersiz anahtar listesinin bi\u00e7imi ge\u00e7ersiz.
SEC_ERROR_NEED_RANDOM=G\u00fcvenlik kitapl\u0131\u011f\u0131\: rastgele veri gerekiyor.
SEC_ERROR_NO_MODULE=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Hi\u00e7bir g\u00fcvenlik birimi istenen i\u015flemi ger\u00e7ekle\u015ftiremiyor.
SEC_ERROR_NO_TOKEN=G\u00fcvenlik kart\u0131 ya da i\u015fareti yok, ba\u015flat\u0131lmas\u0131 gerek ya da silinmi\u015f olabilir.
SEC_ERROR_READ_ONLY=G\u00fcvenlik kitapl\u0131\u011f\u0131\: Veritaban\u0131 salt okunur.
SEC_ERROR_NO_SLOT_SELECTED=Yuva ya da i\u015faret se\u00e7ilmedi.
SEC_ERROR_CERT_NICKNAME_COLLISION=Ayn\u0131 takma ad\u0131 ta\u015f\u0131yan bir onay belgesi zaten var.
SEC_ERROR_KEY_NICKNAME_COLLISION=Ayn\u0131 takma ad\u0131 ta\u015f\u0131yan bir anahtar zaten var.
SEC_ERROR_SAFE_NOT_CREATED=G\u00fcvenli nesne olu\u015fturulurken hata meydana geldi.
SEC_ERROR_BAGGAGE_NOT_CREATED=Bagaj nesnesi olu\u015fturulurken hata meydana geldi.
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Ba\u015f b\u00f6l\u00fcm kald\u0131r\u0131lamad\u0131.
XP_JAVA_DELETE_PRIVILEGE_ERROR=Ayr\u0131cal\u0131k ortadan kald\u0131r\u0131lamad\u0131
XP_JAVA_CERT_NOT_EXISTS_ERROR=Bu ba\u015f b\u00f6l\u00fcm\u00fcn onay belgesi yok
SEC_ERROR_BAD_EXPORT_ALGORITHM=\u0130stenen \u00e7\u00f6z\u00fcm yoluna izin verilmiyor.
SEC_ERROR_EXPORTING_CERTIFICATES=Onay belgeleri d\u0131\u015fa aktar\u0131l\u0131rken hata meydana geldi.
SEC_ERROR_IMPORTING_CERTIFICATES=Onay belgeleri i\u00e7e aktar\u0131l\u0131rken hata meydana geldi.
SEC_ERROR_PKCS12_DECODING_PFX=\u0130\u00e7e aktar\u0131lam\u0131yor. \u00c7\u00f6z\u00fcm hatas\u0131. Dosya ge\u00e7ersiz.
SEC_ERROR_PKCS12_INVALID_MAC=\u0130\u00e7e aktar\u0131lam\u0131yor. Ge\u00e7ersiz MAC. Ge\u00e7ersiz parola ya da eksik dosya s\u00f6z konusu.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=\u0130\u00e7e aktar\u0131lam\u0131yor. MAC \u00e7\u00f6z\u00fcm yolu desteklenmiyor.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=\u0130\u00e7e aktar\u0131lam\u0131yor. Sadece parola b\u00fct\u00fcnle\u015fmesi ve gizlilik kipleri destekleniyor.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=\u0130\u00e7e aktar\u0131lam\u0131yor. Dosya yap\u0131s\u0131 eksik.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=\u0130\u00e7e aktar\u0131lam\u0131yor. \u015eifreleme \u00e7\u00f6z\u00fcm yolu desteklenmiyor.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=\u0130\u00e7e aktar\u0131lam\u0131yor. Dosya s\u00fcr\u00fcm\u00fc desteklenmiyor.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=\u0130\u00e7e aktar\u0131lam\u0131yor. Ge\u00e7ersiz gizlilik parolas\u0131.
SEC_ERROR_PKCS12_CERT_COLLISION=\u0130\u00e7e aktar\u0131lam\u0131yor. Veritaban\u0131nda ayn\u0131 takma ad var.
SEC_ERROR_USER_CANCELLED=Kullan\u0131c\u0131 vazge\u00e7 d\u00fc\u011fmesine bast\u0131.
SEC_ERROR_PKCS12_DUPLICATE_DATA=\u0130\u00e7e aktar\u0131lamad\u0131; veritaban\u0131nda zaten var.
SEC_ERROR_MESSAGE_SEND_ABORTED=\u0130leti g\u00f6nderilmedi.
SEC_ERROR_INADEQUATE_KEY_USAGE=Onay belgesi anahtar kullan\u0131m\u0131 yap\u0131lmaya kalk\u0131\u015f\u0131lan i\u015flem i\u00e7in yetersiz.
SEC_ERROR_INADEQUATE_CERT_TYPE=Onay belgesi t\u00fcr\u00fc uygulama i\u00e7in onaylanm\u0131\u015f de\u011fil.
SEC_ERROR_CERT_ADDR_MISMATCH=\u0130mzalanan onay belgesindeki adres \u00fcst bilgideki adresle uyu\u015fmad\u0131.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=\u0130\u00e7e aktar\u0131lamad\u0131. \u00d6zel anahtar\u0131n i\u00e7e aktar\u0131lmas\u0131 s\u0131ras\u0131nda sorun ya\u015fand\u0131.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=\u0130\u00e7e aktar\u0131lamad\u0131. Onay belgesi zincirinin aktar\u0131lmas\u0131 s\u0131ras\u0131nda hata meydana geldi.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=D\u0131\u015fa aktar\u0131lamad\u0131. Onay belgesine ya da anahtara takma ad kullan\u0131larak ula\u015f\u0131lamad\u0131.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=D\u0131\u015fa aktar\u0131lamad\u0131. \u00d6zel anahtar bulunamad\u0131 ve d\u0131\u015fa aktar\u0131lamad\u0131.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=D\u0131\u015fa aktar\u0131lamad\u0131. D\u0131\u015fa aktarma dosyas\u0131na yaz\u0131lamad\u0131.
SEC_ERROR_PKCS12_UNABLE_TO_READ=D\u0131\u015fa aktar\u0131lamad\u0131. \u0130\u00e7e aktarma dosyas\u0131 okunamad\u0131.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=D\u0131\u015fa aktar\u0131lamad\u0131. Anahtar veritaban\u0131 bozuk ya da silinmi\u015f.
SEC_ERROR_KEYGEN_FAIL=\u00d6zel ve genel anahtar ikilisi \u00fcretilemiyor.
SEC_ERROR_INVALID_PASSWORD=Girilen parola ge\u00e7ersiz. L\u00fctfen farkl\u0131 bir tane se\u00e7in.
SEC_ERROR_RETRY_OLD_PASSWORD=Eski parola yanl\u0131\u015f girildi. L\u00fctfen yeniden deneyin.
SEC_ERROR_BAD_NICKNAME=Onay belgesi takma ad\u0131 h\u00e2lihaz\u0131rda kullan\u0131l\u0131yor.
SEC_ERROR_NOT_FORTEZZA_ISSUER=E\u015fin FORTEZZA zinciri has FORTEZZA olmayan onay belgesi i\u00e7eriyor.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Duyarl\u0131 bir anahtar ihtiya\u00e7 duyulan yuvaya ta\u015f\u0131nam\u0131yor.
SEC_ERROR_JS_INVALID_MODULE_NAME=Ge\u00e7ersiz birim ad\u0131.
SEC_ERROR_JS_INVALID_DLL=Ge\u00e7ersiz birim yolu veya dosya ad\u0131
SEC_ERROR_JS_ADD_MOD_FAILURE=Birim eklenemiyor
SEC_ERROR_JS_DEL_MOD_FAILURE=Birim silinemiyor
SEC_ERROR_OLD_KRL=Yeni h\u00fck\u00fcms\u00fcz anahtar listesinin tarihi h\u00e2lihaz\u0131rdakinden daha yeni de\u011fil.
SEC_ERROR_CKL_CONFLICT=Yeni uyumsuz anahtar listesinin da\u011f\u0131t\u0131c\u0131s\u0131 \u015fu anki listenin da\u011f\u0131t\u0131c\u0131s\u0131ndan farkl\u0131. Ge\u00e7erli listeyi silin.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Bu onay belgesinin yetkilisine bu isimle da\u011f\u0131t\u0131m yapma izin verilmiyor.
SEC_ERROR_KRL_NOT_YET_VALID=Bu onay belgesinin h\u00fck\u00fcms\u00fcz anahtar listesi hen\u00fcz ge\u00e7erli de\u011fil.
SEC_ERROR_CRL_NOT_YET_VALID=Bu onay belgesinin h\u00fck\u00fcms\u00fcz onay belgesi listesi hen\u00fcz ge\u00e7erli de\u011fil.
SEC_ERROR_UNKNOWN_CERT=\u0130stenen onay belgesi bulunamad\u0131.
SEC_ERROR_UNKNOWN_SIGNER=Da\u011f\u0131t\u0131c\u0131n\u0131n onay belgesi bulunamad\u0131.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Onay belgesi durum sunucusunun konumu ge\u00e7ersiz bi\u00e7imde.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=OCSP yan\u0131t\u0131 tamamen \u00e7\u00f6z\u00fclemiyor; bilinmeyen bir t\u00fcrde.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=OCSP sunucusu beklenmeyen ya da ge\u00e7ersiz HTTP verisi ald\u0131.
SEC_ERROR_OCSP_MALFORMED_REQUEST=OCSP sunucusu iste\u011fin yar\u0131da kesilmi\u015f ya da d\u00fczg\u00fcn olmayan bi\u00e7imde oldu\u011funu fark etti.
SEC_ERROR_OCSP_SERVER_ERROR=OCSP sunucusu i\u00e7 hata ya\u015fad\u0131.
SEC_ERROR_OCSP_TRY_SERVER_LATER=OCSP sunucusu daha sonra denenmesini \u00f6neriyor.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=OCSP sunucusu bu istekte imza gerekti\u011fini s\u00f6yl\u00fcyor.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=OCSP sunucusu yetkisiz oldu\u011fu gerek\u00e7esiyle bu iste\u011fi geri \u00e7evirdi.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=OCSP sunucusu alg\u0131lanamayan bir durumla kar\u015f\u0131la\u015ft\u0131.
SEC_ERROR_OCSP_UNKNOWN_CERT=OCSP sunucusu onay belgesiyle ilgili herhangi bir durum bildiriminde bulunam\u0131yor.
SEC_ERROR_OCSP_NOT_ENABLED=Bu i\u015flemi ger\u00e7ekle\u015ftirmeden \u00f6nce OCSP'yi devreye sokmal\u0131s\u0131n\u0131z.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=Bu i\u015flemi ger\u00e7ekle\u015ftirmeden \u00f6nce OCSP'yi varsay\u0131lan yan\u0131t verici olarak ayarlamal\u0131s\u0131n\u0131z.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=OCSP sunucusunun yan\u0131t\u0131 bozuk ya da d\u00fczg\u00fcn olmayan bi\u00e7imde.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=OCSP yan\u0131t\u0131n\u0131n da\u011f\u0131t\u0131c\u0131s\u0131 bu onay belgesiyle ilgili durum bildirmeye yetkili de\u011fil.
SEC_ERROR_OCSP_FUTURE_RESPONSE=OCSP yan\u0131t\u0131 hen\u00fcz ge\u00e7erli de\u011fil (gelecekteki bir tarihe ait).
SEC_ERROR_OCSP_OLD_RESPONSE=OCSP yan\u0131t\u0131 zaman\u0131 ge\u00e7mi\u015f bilgi i\u00e7eriyor.
SEC_ERROR_DIGEST_NOT_FOUND=\u0130mzalanan iletide CMS ya da PKCS \#7 \u00f6zeti bulunamad\u0131.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=CMS ya da PKCS \#7 ileti t\u00fcr\u00fc desteklenmiyor.
SEC_ERROR_MODULE_STUCK=PKCS \#11 birimi kald\u0131r\u0131lam\u0131yor \u00e7\u00fcnk\u00fc h\u00e2len kullan\u0131mda.
SEC_ERROR_BAD_TEMPLATE=ASN.1 verisi \u00e7\u00f6z\u00fclemiyor. Belirtilen kal\u0131p ge\u00e7ersizdi.
SEC_ERROR_CRL_NOT_FOUND=E\u015fle\u015fen h\u00fck\u00fcms\u00fcz onay belgesi listesi bulunamad\u0131.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Var olan bir onay belgesiyle ayn\u0131 da\u011f\u0131t\u0131c\u0131 ya da seri numaras\u0131na sahip bir onay belgesini i\u00e7e aktarmaya \u00e7al\u0131\u015f\u0131yorsunuz, ancak bunlar ayn\u0131 onay belgeleri de\u011fil.
SEC_ERROR_BUSY=NSS kapat\u0131lamad\u0131. Nesneler h\u00e2l\u00e2 kullan\u0131mda.
SEC_ERROR_EXTRA_INPUT=DER \u015fifreli ileti kullan\u0131lmayan fazladan veri i\u00e7eriyor.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Desteklenmeyen oval e\u011fri.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Desteklenmeyen oval e\u011fri noktas\u0131 \u015fekli.
SEC_ERROR_UNRECOGNIZED_OID=Tan\u0131nmayan Nesne Tan\u0131mlay\u0131c\u0131s\u0131.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=OCSP yan\u0131t\u0131nda ge\u00e7ersiz OCSP onay belgesi imzas\u0131 var.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Onay belgesi, da\u011f\u0131t\u0131c\u0131n\u0131n h\u00fck\u00fcms\u00fcz onay belgeleri listesinde yer al\u0131yor.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Da\u011f\u0131t\u0131c\u0131n\u0131n OCSP yan\u0131t\u00e7\u0131s\u0131, onay belgesinin h\u00fck\u00fcms\u00fcz oldu\u011funu bildiriyor.
SEC_ERROR_CRL_INVALID_VERSION=Da\u011f\u0131t\u0131c\u0131n\u0131n h\u00fck\u00fcms\u00fcz onay belgeleri listesi bilinmeyen bir s\u00fcr\u00fcm numaras\u0131na sahip.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Da\u011f\u0131t\u0131c\u0131n\u0131n V1 h\u00fck\u00fcms\u00fcz onay belgesi listesi kritik bir uzant\u0131ya sahip.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Da\u011f\u0131t\u0131c\u0131n\u0131n V2 h\u00fck\u00fcms\u00fcz onay belgesi listesi bilinmeyen kritik bir uzant\u0131ya sahip.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Bilinmeyen nesne t\u00fcr\u00fc belirtildi.
SEC_ERROR_INCOMPATIBLE_PKCS11=PKCS \#11 s\u00fcr\u00fcc\u00fcs\u00fc tan\u0131mlamay\u0131 uygunsuz yolla ihl\u00e2l ediyor.
SEC_ERROR_NO_EVENT=\u015eu an yeni bir yuva hareketi yok.
SEC_ERROR_CRL_ALREADY_EXISTS=H\u00fck\u00fcms\u00fcz onay belgesi listesi kullan\u0131mda.
SEC_ERROR_NOT_INITIALIZED=NSS ba\u015flat\u0131lmad\u0131.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=\u0130\u015flem ba\u015far\u0131s\u0131zl\u0131kla sonu\u00e7land\u0131, \u00e7\u00fcnk\u00fc PKCS\#11 belirkesi giri\u015f yapm\u0131\u015f de\u011fil.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Ayarlanan OCSP yan\u0131t\u00e7\u0131s\u0131n\u0131n onay belgesi ge\u00e7ersiz.
SEC_ERROR_OCSP_BAD_SIGNATURE=OCSP yan\u0131t\u0131 ge\u00e7ersiz imzaya sahip.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Belge do\u011frulama aramas\u0131 arama s\u0131n\u0131rlar\u0131n\u0131n d\u0131\u015f\u0131nda
SEC_ERROR_INVALID_POLICY_MAPPING=\u0130lke haritalamas\u0131 anypolicy i\u00e7eriyor
SEC_ERROR_POLICY_VALIDATION_FAILED=Onay belgesi zinciri ilke do\u011frulamas\u0131ndan ge\u00e7emedi
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Onay belgesi AIA uzant\u0131s\u0131nda bilinmeyen konum t\u00fcr\u00fc
SEC_ERROR_BAD_HTTP_RESPONSE=Sunucu hatal\u0131 HTTP yan\u0131t\u0131 d\u00f6nd\u00fcrd\u00fc
SEC_ERROR_BAD_LDAP_RESPONSE=Sunucu hatal\u0131 LDAP yan\u0131t\u0131 d\u00f6nd\u00fcrd\u00fc
SEC_ERROR_FAILED_TO_ENCODE_DATA=Veri ASN1 \u015fifreleyiciyle \u015fifrelenemedi
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Onay belgesi uzant\u0131s\u0131nda hatal\u0131 bilgiye eri\u015fim konumu
SEC_ERROR_LIBPKIX_INTERNAL=Onay belgesi do\u011frulamas\u0131 s\u0131ras\u0131nda dahili Libpkix hatas\u0131 olu\u015ftu.
SEC_ERROR_PKCS11_GENERAL_ERROR=Bir PKCS \#11 mod\u00fcl\u00fc kurtar\u0131lamayan bir hatay\u0131 ifade eden CKR_GENERAL_ERROR d\u00f6nd\u00fcrd\u00fc.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Bir PKCS \#11 mod\u00fcl\u00fc istenen i\u015flevin ger\u00e7ekle\u015ftirilemedi\u011fini ifade eden CKR_FUNCTION_FAILED d\u00f6nd\u00fcrd\u00fc.  Ayn\u0131 i\u015flemin tekrar denenmesi i\u015fe yarayabilir.
SEC_ERROR_PKCS11_DEVICE_ERROR=Bir PKCS \#11 mod\u00fcl\u00fc bilet veya slotta hata olu\u015ftu\u011funu ifade eden CKR_DEVICE_ERROR d\u00f6nd\u00fcrd\u00fc.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Onay belgesi uzant\u0131s\u0131nda bilinmeyen bilgiye eri\u015fime y\u00f6ntemi.
SEC_ERROR_CRL_IMPORT_FAILED=H\u00fck\u00fcms\u00fcz onay belgesi i\u00e7e al\u0131n\u0131rken hata olu\u015ftu.
SEC_ERROR_EXPIRED_PASSWORD=Parola zaman a\u015f\u0131m\u0131na u\u011frad\u0131.
SEC_ERROR_LOCKED_PASSWORD=Parola kilitli.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Bilinmeyen PKCS \#11 hatas\u0131.
SEC_ERROR_BAD_CRL_DP_URL=CRL da\u011f\u0131t\u0131m noktas\u0131 isminde ge\u00e7ersiz veya desteklenmeyen URL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Onay belgesi, g\u00fcvenli olmad\u0131\u011f\u0131 i\u00e7in devre d\u0131\u015f\u0131 b\u0131rak\u0131lan bir imza algoritmas\u0131yla imzaland\u0131.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=The server presented a certificate with a key size that is too small to establish a secure connection.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=An X.509 version 1 certificate that is not a trust anchor was used to issue the server's certificate. X.509 version 1 certificates are deprecated and should not be used to sign other certificates.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=The server presented a certificate that is not yet valid.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=A certificate that is not yet valid was used to issue the server's certificate.

