#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

SSL_ERROR_EXPORT_ONLY_SERVER=Bezpe\u010dn\u00e1 komunikace nen\u00ed mo\u017en\u00e1. Partner nepodporuje vysok\u00fd stupe\u0148 \u0161ifrov\u00e1n\u00ed.
SSL_ERROR_US_ONLY_SERVER=Bezpe\u010dn\u00e1 komunikace nen\u00ed mo\u017en\u00e1. Partner vy\u017eaduje vysok\u00fd stupe\u0148 \u0161ifrov\u00e1n\u00ed, kter\u00fd nen\u00ed podporov\u00e1n.
SSL_ERROR_NO_CYPHER_OVERLAP=Bezpe\u010dn\u00e1 komunikace s partnerem nen\u00ed mo\u017en\u00e1\: Nenalezen \u017e\u00e1dn\u00fd spole\u010dn\u00fd \u0161ifrovac\u00ed algoritmus.
SSL_ERROR_NO_CERTIFICATE=Nepoda\u0159ilo se naj\u00edt certifik\u00e1t nebo kl\u00ed\u010d pot\u0159ebn\u00fd k autentizaci.
SSL_ERROR_BAD_CERTIFICATE=Bezpe\u010dn\u00e1 komunikace s partnerem nen\u00ed mo\u017en\u00e1\: Certifik\u00e1t partnera byl odm\u00edtnut.
SSL_ERROR_UNUSED_5=Nerozpoznan\u00fd k\u00f3d chyby SSL.
SSL_ERROR_BAD_CLIENT=Server obdr\u017eel od klienta nespr\u00e1vn\u00e1 data.
SSL_ERROR_BAD_SERVER=Klient obdr\u017eel od serveru nespr\u00e1vn\u00e1 data.
SSL_ERROR_UNSUPPORTED_CERTIFICATE_TYPE=Nepodporovan\u00fd typ certifik\u00e1tu.
SSL_ERROR_UNSUPPORTED_VERSION=Partner pou\u017e\u00edv\u00e1 nepodporovanou verzi bezpe\u010dnostn\u00edho protokolu.
SSL_ERROR_UNUSED_10=Nerozpoznan\u00fd k\u00f3d chyby SSL.
SSL_ERROR_WRONG_CERTIFICATE=Autentizace klienta selhala\: Soukrom\u00fd kl\u00ed\u010d v datab\u00e1zi kl\u00ed\u010d\u016f nesouhlas\u00ed s ve\u0159ejn\u00fdm kl\u00ed\u010dem v datab\u00e1zi certifik\u00e1t\u016f.
SSL_ERROR_BAD_CERT_DOMAIN=Bezpe\u010dn\u00e1 komunikace s partnerem nen\u00ed mo\u017en\u00e1\: Po\u017eadovan\u00e9 dom\u00e9nov\u00e9 jm\u00e9no nesouhlas\u00ed s certifik\u00e1tem serveru.
SSL_ERROR_POST_WARNING=Nerozpoznan\u00fd k\u00f3d chyby SSL.
SSL_ERROR_SSL2_DISABLED=Partner podporuje pouze protokol SSL verze 2, kter\u00fd je m\u00edstn\u011b zak\u00e1z\u00e1n.
SSL_ERROR_BAD_MAC_READ=P\u0159i komunikaci pomoc\u00ed protokolu SSL byl obdr\u017een z\u00e1znam s chybn\u00fdm ov\u011b\u0159ovac\u00edm k\u00f3dem zpr\u00e1vy.
SSL_ERROR_BAD_MAC_ALERT=Partner hl\u00e1s\u00ed z\u00e1znam s chybn\u00fdm ov\u011b\u0159ovac\u00edm k\u00f3dem zpr\u00e1vy.
SSL_ERROR_BAD_CERT_ALERT=Partner nem\u016f\u017ee ov\u011b\u0159it v\u00e1\u0161 certifik\u00e1t.
SSL_ERROR_REVOKED_CERT_ALERT=Partner odm\u00edtl v\u00e1\u0161 certifik\u00e1t jako zneplatn\u011bn\u00fd.
SSL_ERROR_EXPIRED_CERT_ALERT=Partner odm\u00edtl v\u00e1\u0161 certifik\u00e1t z d\u016fvod\u016f ukon\u010den\u00ed jeho doby platnosti.
SSL_ERROR_SSL_DISABLED=Nen\u00ed mo\u017en\u00e9 se p\u0159ipojit\: Protokol SSL je zak\u00e1z\u00e1n.
SSL_ERROR_FORTEZZA_PQG=Nen\u00ed mo\u017en\u00e9 se p\u0159ipojit\: Partner protokolu SSL je dal\u0161\u00ed dom\u00e9na typu Fortezza.
SSL_ERROR_UNKNOWN_CIPHER_SUITE=Byla vy\u017eadov\u00e1na nezn\u00e1m\u00e1 sada \u0161ifer protokolu SSL.
SSL_ERROR_NO_CIPHERS_SUPPORTED=V t\u00e9to aplikaci nejsou p\u0159\u00edtomny a povoleny \u017e\u00e1dn\u00e9 sady \u0161ifer.
SSL_ERROR_BAD_BLOCK_PADDING=P\u0159i komunikaci protokolem SSL byl obdr\u017een z\u00e1znam s chybn\u011b odsazen\u00fdm blokem.
SSL_ERROR_RX_RECORD_TOO_LONG=P\u0159i komunikaci protokolem SSL byl obdr\u017een z\u00e1znam p\u0159esahuj\u00edc\u00ed maxim\u00e1ln\u00ed povolenou d\u00e9lku.
SSL_ERROR_TX_RECORD_TOO_LONG=P\u0159i komunikaci protokolem SSL je snaha odeslat z\u00e1znam p\u0159esahuj\u00edc\u00ed maxim\u00e1ln\u00ed povolenou d\u00e9lku.
SSL_ERROR_RX_MALFORMED_HELLO_REQUEST=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Hello Request.
SSL_ERROR_RX_MALFORMED_CLIENT_HELLO=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Client Hello.
SSL_ERROR_RX_MALFORMED_SERVER_HELLO=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Server Hello.
SSL_ERROR_RX_MALFORMED_CERTIFICATE=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Certificate.
SSL_ERROR_RX_MALFORMED_SERVER_KEY_EXCH=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Server Key Exchange.
SSL_ERROR_RX_MALFORMED_CERT_REQUEST=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Certificate Request.
SSL_ERROR_RX_MALFORMED_HELLO_DONE=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Server Hello Done.
SSL_ERROR_RX_MALFORMED_CERT_VERIFY=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Certificate Verify.
SSL_ERROR_RX_MALFORMED_CLIENT_KEY_EXCH=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Client Key Exchange.
SSL_ERROR_RX_MALFORMED_FINISHED=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Finished.
SSL_ERROR_RX_MALFORMED_CHANGE_CIPHER=P\u0159i komunikaci protokolem SSL byl obdr\u017een chybn\u00fd z\u00e1znam typu Change Cipher Spec.
SSL_ERROR_RX_MALFORMED_ALERT=P\u0159i komunikaci protokolem SSL byl obdr\u017een chybn\u00fd z\u00e1znam typu Alert.
SSL_ERROR_RX_MALFORMED_HANDSHAKE=P\u0159i komunikaci protokolem SSL byl obdr\u017een chybn\u00fd z\u00e1znam typu Handshake.
SSL_ERROR_RX_MALFORMED_APPLICATION_DATA=P\u0159i komunikaci protokolem SSL byl obdr\u017een chybn\u00fd z\u00e1znam typu Application Data.
SSL_ERROR_RX_UNEXPECTED_HELLO_REQUEST=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Hello Request.
SSL_ERROR_RX_UNEXPECTED_CLIENT_HELLO=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Client Hello.
SSL_ERROR_RX_UNEXPECTED_SERVER_HELLO=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Server Hello.
SSL_ERROR_RX_UNEXPECTED_CERTIFICATE=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Certificate.
SSL_ERROR_RX_UNEXPECTED_SERVER_KEY_EXCH=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Server Key Exchange.
SSL_ERROR_RX_UNEXPECTED_CERT_REQUEST=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Certificate Request.
SSL_ERROR_RX_UNEXPECTED_HELLO_DONE=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Server Hello Done.
SSL_ERROR_RX_UNEXPECTED_CERT_VERIFY=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Certificate Verify.
SSL_ERROR_RX_UNEXPECTED_CLIENT_KEY_EXCH=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Client Key Exchange.
SSL_ERROR_RX_UNEXPECTED_FINISHED=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu Finished.
SSL_ERROR_RX_UNEXPECTED_CHANGE_CIPHER=P\u0159i komunikaci protokolem SSL byl obdr\u017een neo\u010dek\u00e1van\u00fd z\u00e1znam typu Change Cipher Spec.
SSL_ERROR_RX_UNEXPECTED_ALERT=P\u0159i komunikaci protokolem SSL byl obdr\u017een neo\u010dek\u00e1van\u00fd z\u00e1znam typu Alert.
SSL_ERROR_RX_UNEXPECTED_HANDSHAKE=P\u0159i komunikaci protokolem SSL byl obdr\u017een neo\u010dek\u00e1van\u00fd z\u00e1znam typu Handshake.
SSL_ERROR_RX_UNEXPECTED_APPLICATION_DATA=P\u0159i komunikaci protokolem SSL byl obdr\u017een neo\u010dek\u00e1van\u00fd z\u00e1znam typu Application Data Record.
SSL_ERROR_RX_UNKNOWN_RECORD_TYPE=P\u0159i komunikaci protokolem SSL byl obdr\u017een z\u00e1znam s nezn\u00e1m\u00fdm typem obsahu.
SSL_ERROR_RX_UNKNOWN_HANDSHAKE=P\u0159i komunikaci protokolem SSL byla obdr\u017eena inicializa\u010dn\u00ed zpr\u00e1va s nezn\u00e1m\u00fdm typem zpr\u00e1vy.
SSL_ERROR_RX_UNKNOWN_ALERT=P\u0159i komunikaci protokolem SSL byl obdr\u017een v\u00fdstra\u017en\u00fd z\u00e1znam s nezn\u00e1m\u00fdm popisem v\u00fdstrahy.
SSL_ERROR_CLOSE_NOTIFY_ALERT=Partner protokolu SSL uzav\u0159el neo\u010dek\u00e1van\u011b spojen\u00ed.
SSL_ERROR_HANDSHAKE_UNEXPECTED_ALERT=Partner protokolu SSL neo\u010dek\u00e1val obdr\u017een\u00ed inicializa\u010dn\u00ed zpr\u00e1vy.
SSL_ERROR_DECOMPRESSION_FAILURE_ALERT=Partner protokolu SSL nebyl schopen \u00fasp\u011b\u0161n\u011b dekomprimovat obdr\u017een\u00fd SSL z\u00e1znam.
SSL_ERROR_HANDSHAKE_FAILURE_ALERT=S partnerem protokolu SSL se nepoda\u0159ilo domluvit akceptovatelnou mno\u017einu bezpe\u010dnostn\u00edch parametr\u016f.
SSL_ERROR_ILLEGAL_PARAMETER_ALERT=Partner protokolu SSL zam\u00edtl inicializa\u010dn\u00ed zpr\u00e1vu z d\u016fvodu neakceptovateln\u00e9ho obsahu.
SSL_ERROR_UNSUPPORTED_CERT_ALERT=Partner protokolu SSL nepodporuje typ obdr\u017een\u00e9ho certifik\u00e1tu.
SSL_ERROR_CERTIFICATE_UNKNOWN_ALERT=Partner protokolu SSL m\u011bl s obdr\u017een\u00fdm certifik\u00e1tem nezn\u00e1m\u00e9 probl\u00e9my.
SSL_ERROR_GENERATE_RANDOM_FAILURE=Nastala chyba v gener\u00e1toru n\u00e1hodn\u00fdch \u010d\u00edsel.
SSL_ERROR_SIGN_HASHES_FAILURE=Nepoda\u0159ilo se elektronicky podepsat data pot\u0159ebn\u00e1 k ov\u011b\u0159en\u00ed va\u0161eho certifik\u00e1tu.
SSL_ERROR_EXTRACT_PUBLIC_KEY_FAILURE=Protokolu SSL se nepoda\u0159ilo z certifik\u00e1tu partnera extrahovat ve\u0159ejn\u00fd kl\u00ed\u010d.
SSL_ERROR_SERVER_KEY_EXCHANGE_FAILURE=Nezn\u00e1m\u00e1 chyba b\u011bhem zpracov\u00e1n\u00ed inicializace SSL Server Key Exchange.
SSL_ERROR_CLIENT_KEY_EXCHANGE_FAILURE=Nezn\u00e1m\u00e1 chyba b\u011bhem zpracov\u00e1n\u00ed inicializace SSL Client Key Exchange.
SSL_ERROR_ENCRYPTION_FAILURE=Chyba algoritmu pro \u0161ifrov\u00e1n\u00ed hromadn\u00fdch dat ve vybran\u00e9m bal\u00edku \u0161ifer.
SSL_ERROR_DECRYPTION_FAILURE=Chyba algoritmu pro de\u0161ifrov\u00e1n\u00ed hromadn\u00fdch dat ve vybran\u00e9m bal\u00edku \u0161ifer.
SSL_ERROR_SOCKET_WRITE_FAILURE=Chyba p\u0159i z\u00e1pisu \u0161ifrovan\u00fdch dat do n\u00edzko\u00farov\u0148ov\u00e9ho socketu.
SSL_ERROR_MD5_DIGEST_FAILURE=Chyba funkce pro hashov\u00e1n\u00ed MD5.
SSL_ERROR_SHA_DIGEST_FAILURE=Chyba funkce pro hashov\u00e1n\u00ed SHA-1.
SSL_ERROR_MAC_COMPUTATION_FAILURE=Chyba p\u0159i ur\u010den\u00ed MAC.
SSL_ERROR_SYM_KEY_CONTEXT_FAILURE=Chyba p\u0159i vytvo\u0159en\u00ed kontextu symetrick\u00e9ho kl\u00ed\u010de.
SSL_ERROR_SYM_KEY_UNWRAP_FAILURE=Chyba p\u0159i rozbalen\u00ed symetrick\u00e9ho kl\u00ed\u010de ve zpr\u00e1v\u011b typu Client Key Exchange.
SSL_ERROR_PUB_KEY_SIZE_LIMIT_EXCEEDED=Server SSL se pokusil pou\u017e\u00edt dom\u00e1c\u00ed ve\u0159ejn\u00fd kl\u00ed\u010d s exportn\u00edm bal\u00edkem \u0161ifer.
SSL_ERROR_IV_PARAM_FAILURE=K\u00f3du PKCS \#11 se nepoda\u0159ilo p\u0159elo\u017eit IV na parametr.
SSL_ERROR_INIT_CIPHER_SUITE_FAILURE=Chyba inicializace ve vybran\u00e9m bal\u00edku \u0161ifer.
SSL_ERROR_SESSION_KEY_GEN_FAILURE=Klientovi se nepoda\u0159ilo vygenerovat kl\u00ed\u010de relace SSL.
SSL_ERROR_NO_SERVER_KEY_FOR_ALG=Server nem\u00e1 \u017e\u00e1dn\u00fd kl\u00ed\u010d pro algoritmus v\u00fdm\u011bny kl\u00ed\u010d\u016f.
SSL_ERROR_TOKEN_INSERTION_REMOVAL=V pr\u016fb\u011bhu operace byl vlo\u017een nebo vyjmut token PKCS \#11.
SSL_ERROR_TOKEN_SLOT_NOT_FOUND=Pro vykon\u00e1n\u00ed po\u017eadovan\u00e9 operace nebyl nalezen \u017e\u00e1dn\u00fd token PKCS \#11.
SSL_ERROR_NO_COMPRESSION_OVERLAP=S partnerem nen\u00ed mo\u017en\u00e9 bezpe\u010dn\u011b komunikovat\: nebyl nalezen spole\u010dn\u00fd kompresn\u00ed algoritmus.
SSL_ERROR_HANDSHAKE_NOT_COMPLETED=Nen\u00ed mo\u017en\u00e9 inicializovat dal\u0161\u00ed spojen\u00ed protokolu SSL, dokud nebude ukon\u010dena aktu\u00e1ln\u00ed inicializace.
SSL_ERROR_BAD_HANDSHAKE_HASH_VALUE=Od partnera byly p\u0159ijaty nespr\u00e1vn\u00e9 hodnoty inicializa\u010dn\u00edho hashe.
SSL_ERROR_CERT_KEA_MISMATCH=Poskytnut\u00fd certifik\u00e1t nen\u00ed mo\u017en\u00e9 pou\u017e\u00edt s vybran\u00fdm algoritmem pro v\u00fdm\u011bnu kl\u00ed\u010de.
SSL_ERROR_NO_TRUSTED_SSL_CLIENT_CA=Pro autentizaci klienta pomoc\u00ed protokolu SSL nen\u00ed dostupn\u00e1 \u017e\u00e1dn\u00e1 certifika\u010dn\u00ed autorita.
SSL_ERROR_SESSION_NOT_FOUND=Identifikace klientovi relace protokolu SSL nebyla nalezena v mezipam\u011bti serveru.
SSL_ERROR_DECRYPTION_FAILED_ALERT=Partner nemohl de\u0161ifrovat p\u0159ijat\u00fd z\u00e1znam protokolu SSL.
SSL_ERROR_RECORD_OVERFLOW_ALERT=Partner obdr\u017eel z\u00e1znam protokolu SSL, kter\u00fd byl del\u0161\u00ed ne\u017e je povoleno.
SSL_ERROR_UNKNOWN_CA_ALERT=Partner nerozpoznal a ned\u016fv\u011b\u0159uje CA, kter\u00e1 vydala v\u00e1\u0161 certifik\u00e1t.
SSL_ERROR_ACCESS_DENIED_ALERT=Partner obdr\u017eel platn\u00fd certifik\u00e1t, ale p\u0159\u00edstup byl odm\u00edtnut.
SSL_ERROR_DECODE_ERROR_ALERT=Partner nemohl dek\u00f3dovat inicializa\u010dn\u00ed zpr\u00e1vu protokolu SSL.
SSL_ERROR_DECRYPT_ERROR_ALERT=Partner hl\u00e1s\u00ed chybu ov\u011b\u0159en\u00ed podpisu nebo v\u00fdm\u011bny kl\u00ed\u010de.
SSL_ERROR_EXPORT_RESTRICTION_ALERT=Partner hl\u00e1s\u00ed nesoulad vyjedn\u00e1v\u00e1n\u00ed s exportn\u00edmi p\u0159edpisy.
SSL_ERROR_PROTOCOL_VERSION_ALERT=Partner hl\u00e1s\u00ed nekompatibiln\u00ed nebo nepodporovanou verzi protokolu.
SSL_ERROR_INSUFFICIENT_SECURITY_ALERT=Server po\u017eaduje bezpe\u010dn\u011bj\u0161\u00ed \u0161ifru, ne\u017e kter\u00e9 jsou podporov\u00e1ny klientem.
SSL_ERROR_INTERNAL_ERROR_ALERT=Partner hl\u00e1s\u00ed, \u017ee do\u0161lo k intern\u00ed chyb\u011b.
SSL_ERROR_USER_CANCELED_ALERT=Partner zru\u0161il inicializaci.
SSL_ERROR_NO_RENEGOTIATION_ALERT=Partner nepovolil rozpozn\u00e1n\u00ed bezpe\u010dnostn\u00edch parametr\u016f protokolu SSL.
SSL_ERROR_SERVER_CACHE_NOT_CONFIGURED=Mezipam\u011b\u0165 serveru SSL nen\u00ed nakonfigurov\u00e1na ani zak\u00e1z\u00e1na pro tento socket.
SSL_ERROR_UNSUPPORTED_EXTENSION_ALERT=Partner protokolu SSL nepodporuje po\u017eadovan\u00e9 roz\u0161\u00ed\u0159en\u00ed TLS hello.
SSL_ERROR_CERTIFICATE_UNOBTAINABLE_ALERT=Partner protokolu SSL nemohl z poskytnut\u00e9 adresy URL z\u00edskat v\u00e1\u0161 certifik\u00e1t.
SSL_ERROR_UNRECOGNIZED_NAME_ALERT=Partner protokolu SSL nem\u00e1 pro po\u017eadovan\u00fd n\u00e1zev DNS \u017e\u00e1dn\u00fd certifik\u00e1t .
SSL_ERROR_BAD_CERT_STATUS_RESPONSE_ALERT=Partner protokolu SSL nemohl z\u00edskat odezvu OCSP pro sv\u016fj certifik\u00e1t.
SSL_ERROR_BAD_CERT_HASH_VALUE_ALERT=Partner protokolu SSL hl\u00e1s\u00ed chybnou hodnotu hashe certifik\u00e1tu.
SSL_ERROR_RX_UNEXPECTED_NEW_SESSION_TICKET=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neo\u010dek\u00e1van\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu New Session Ticket.
SSL_ERROR_RX_MALFORMED_NEW_SESSION_TICKET=P\u0159i komunikaci protokolem SSL byla obdr\u017eena chybn\u00e1 inicializa\u010dn\u00ed zpr\u00e1va typu New Session Ticket.
SSL_ERROR_DECOMPRESSION_FAILURE=P\u0159i komunikaci protokolem SSL byl obdr\u017een z\u00e1znam, kter\u00fd se nepoda\u0159ilo dekomprimovat.
SSL_ERROR_RENEGOTIATION_NOT_ALLOWED=Tento SSL socket nepovoluje vyjedn\u00e1v\u00e1n\u00ed.
SSL_ERROR_UNSAFE_NEGOTIATION=Partner protokolu SSL se pokusil o inicializaci star\u00e9ho (potenci\u00e1ln\u011b napadnuteln\u00e9ho) typu.
SSL_ERROR_RX_UNEXPECTED_UNCOMPRESSED_RECORD=P\u0159i komunikaci protokolem SSL byl obdr\u017een neo\u010dek\u00e1van\u00fd dekomprimovan\u00fd z\u00e1znam.
SSL_ERROR_WEAK_SERVER_EPHEMERAL_DH_KEY=P\u0159i komunikaci protokolem SSL byl v inicializa\u010dn\u00ed zpr\u00e1v\u011b typu Server Key Exchange obdr\u017een slab\u00fd kl\u00ed\u010d typu Diffie-Hellman.
SSL_ERROR_NEXT_PROTOCOL_DATA_INVALID=P\u0159i komunikaci protokolem SSL byla obdr\u017eena neplatn\u00e1 data roz\u0161\u00ed\u0159en\u00ed NPN.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SSL2=SSL vlastnost nen\u00ed podporov\u00e1na pro spojen\u00ed pomoc\u00ed SSL 2.0
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_SERVERS=Vlastnost protokolu SSL nen\u00ed podporov\u00e1na na serverech.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_CLIENTS=Vlastnost protokolu SSL nen\u00ed podporov\u00e1na na klientech.
SSL_ERROR_INVALID_VERSION_RANGE=Rozsah verz\u00ed SSL nen\u00ed platn\u00fd.
SSL_ERROR_CIPHER_DISALLOWED_FOR_VERSION=Partner protokolu SSL zvolil \u0161ifrovac\u00ed bal\u00edk, kter\u00fd nen\u00ed pro danou verzi protokolu povolen\u00fd.
SSL_ERROR_RX_MALFORMED_HELLO_VERIFY_REQUEST=Protokol SSL p\u0159ijal po\u0161kozenou inicializa\u010dn\u00ed zpr\u00e1vu Hello Verify Request.
SSL_ERROR_RX_UNEXPECTED_HELLO_VERIFY_REQUEST=Protokol SSL p\u0159ijal neo\u010dek\u00e1vanou zpr\u00e1vu p\u0159i Hello Verify Request.
SSL_ERROR_FEATURE_NOT_SUPPORTED_FOR_VERSION=Vlastnost SSL nen\u00ed podporov\u00e1na pro danou verzi protokolu.
SSL_ERROR_RX_UNEXPECTED_CERT_STATUS=Protokol SSL p\u0159ijal neo\u010dek\u00e1vanou inicializa\u010dn\u00ed zpr\u00e1vu Certificate Status.
SSL_ERROR_UNSUPPORTED_HASH_ALGORITHM=Partner TLS pou\u017eil neplatn\u00e1 hashovac\u00ed algoritmus.
SSL_ERROR_DIGEST_FAILURE=Chyba funkce pro hashov\u00e1n\u00ed.
SSL_ERROR_INCORRECT_SIGNATURE_ALGORITHM=V digit\u00e1ln\u00edm podepsan\u00e9m prvku je ur\u010den\u00fd nespr\u00e1vn\u00fd podpisov\u00fd algoritmus.
SSL_ERROR_NEXT_PROTOCOL_NO_CALLBACK=Roz\u0161\u00ed\u0159en\u00ed vyjedn\u00e1v\u00e1n\u00ed o dal\u0161\u00edm protokolu bylo povolen\u00e9, ale fronta byla vy\u010di\u0161t\u011bn\u00e1 je\u0161t\u011b p\u0159edt\u00edm ne\u017e to bylo pot\u0159eba.
SSL_ERROR_NEXT_PROTOCOL_NO_PROTOCOL=Server nepodporuje \u017e\u00e1dn\u00fd z protokol\u016f uveden\u00fdch v klientovo roz\u0161\u00ed\u0159en\u00ed ALPN.
SSL_ERROR_INAPPROPRIATE_FALLBACK_ALERT=Server odm\u00edtl inicializovat spojen\u00ed, proto\u017ee klient za\u010dal pou\u017e\u00edvat verzi TLS, kter\u00e1 je ni\u017e\u0161\u00ed ne\u017e ta, kter\u00e1 je podporovan\u00e1 serverem.
SEC_ERROR_IO=B\u011bhem bezpe\u010dnostn\u00ed autorizace nastala chyba I/O.
SEC_ERROR_LIBRARY_FAILURE=Chyba bezpe\u010dnostn\u00ed knihovny.
SEC_ERROR_BAD_DATA=Bezpe\u010dnostn\u00ed knihovna\: p\u0159ijaty nespr\u00e1vn\u00e9 \u00fadaje.
SEC_ERROR_OUTPUT_LEN=Bezpe\u010dnostn\u00ed knihovna\: chyba d\u00e9lky v\u00fdstupu.
SEC_ERROR_INPUT_LEN=Bezpe\u010dnostn\u00ed knihovna\: chyba d\u00e9lky vstupu.
SEC_ERROR_INVALID_ARGS=Bezpe\u010dnostn\u00ed knihovna\: neplatn\u00e9 argumenty.
SEC_ERROR_INVALID_ALGORITHM=Bezpe\u010dnostn\u00ed knihovna\: neplatn\u00fd algoritmus.
SEC_ERROR_INVALID_AVA=Bezpe\u010dnostn\u00ed knihovna\: neplatn\u00e9 AVA.
SEC_ERROR_INVALID_TIME=Neplatn\u00fd form\u00e1t \u010dasov\u00e9ho \u0159et\u011bzce.
SEC_ERROR_BAD_DER=Bezpe\u010dnostn\u00ed knihovna\: neplatn\u00fd form\u00e1t zpr\u00e1vy s k\u00f3dov\u00e1n\u00edm typu DER.
SEC_ERROR_BAD_SIGNATURE=Certifik\u00e1t partnera obsahuje neplatn\u00fd podpis.
SEC_ERROR_EXPIRED_CERTIFICATE=Platnost certifik\u00e1tu partnera ji\u017e vypr\u0161ela.
SEC_ERROR_REVOKED_CERTIFICATE=Certifik\u00e1t partnera byl zneplatn\u011bn\u00fd.
SEC_ERROR_UNKNOWN_ISSUER=Vydavatel certifik\u00e1tu partnera nebyl rozpoznan\u00fd.
SEC_ERROR_BAD_KEY=Ve\u0159ejn\u00fd kl\u00ed\u010d partnera nen\u00ed platn\u00fd.
SEC_ERROR_BAD_PASSWORD=Zadan\u00e9 bezpe\u010dnostn\u00ed heslo nen\u00ed spr\u00e1vn\u00e9.
SEC_ERROR_RETRY_PASSWORD=Nov\u00e9 heslo bylo zad\u00e1no nespr\u00e1vn\u011b. Zkuste to pros\u00edm znovu.
SEC_ERROR_NO_NODELOCK=Bezpe\u010dnostn\u00ed knihovna\: \u017e\u00e1dn\u00fd z\u00e1mek uzlu.
SEC_ERROR_BAD_DATABASE=Bezpe\u010dnostn\u00ed knihovna\: chybn\u00e1 datab\u00e1ze.
SEC_ERROR_NO_MEMORY=Bezpe\u010dnostn\u00ed knihovna\: chyba alokace pam\u011bti.
SEC_ERROR_UNTRUSTED_ISSUER=Vydavatel certifik\u00e1tu partnera byl u\u017eivatelem ozna\u010den jako ned\u016fv\u011bryhodn\u00fd.
SEC_ERROR_UNTRUSTED_CERT=Certifik\u00e1t partnera byl u\u017eivatelem ozna\u010den jako ned\u016fv\u011bryhodn\u00fd.
SEC_ERROR_DUPLICATE_CERT=Certifik\u00e1t ji\u017e v datab\u00e1zi existuje.
SEC_ERROR_DUPLICATE_CERT_NAME=Jm\u00e9no st\u00e1hnut\u00e9ho certifik\u00e1tu je duplicitn\u00ed s jin\u00fdm certifik\u00e1tem v datab\u00e1zi.
SEC_ERROR_ADDING_CERT=Chyba p\u0159i p\u0159id\u00e1v\u00e1n\u00ed certifik\u00e1tu do datab\u00e1ze.
SEC_ERROR_FILING_KEY=Chyba p\u0159i vypl\u0148ov\u00e1n\u00ed kl\u00ed\u010de k certifik\u00e1tu.
SEC_ERROR_NO_KEY=Soukrom\u00fd kl\u00ed\u010d k certifik\u00e1tu nebyl v datab\u00e1zi nalezen
SEC_ERROR_CERT_VALID=Tento certifik\u00e1t je platn\u00fd.
SEC_ERROR_CERT_NOT_VALID=Tento certifik\u00e1t nen\u00ed platn\u00fd.
SEC_ERROR_CERT_NO_RESPONSE=Knihovna certifik\u00e1t\u016f\: bez odpov\u011bdi
SEC_ERROR_EXPIRED_ISSUER_CERTIFICATE=Platnost certifik\u00e1tu vydavatele certifik\u00e1tu ji\u017e uplynula. Zkontrolujte datum a \u010das va\u0161eho syst\u00e9mu.
SEC_ERROR_CRL_EXPIRED=Platnost CRL vydavatele certifik\u00e1tu ji\u017e uplynula. Aktualizujte ho a zkontrolujte datum a \u010das va\u0161eho syst\u00e9mu.
SEC_ERROR_CRL_BAD_SIGNATURE=CRL vydavatele certifik\u00e1tu m\u00e1 neplatn\u00fd podpis.
SEC_ERROR_CRL_INVALID=Nov\u00e9 CRL m\u00e1 neplatn\u00fd form\u00e1t.
SEC_ERROR_EXTENSION_VALUE_INVALID=Hodnota roz\u0161\u00ed\u0159en\u00ed certifik\u00e1tu je neplatn\u00e1.
SEC_ERROR_EXTENSION_NOT_FOUND=Roz\u0161\u00ed\u0159en\u00ed certifik\u00e1tu nenalezeno.
SEC_ERROR_CA_CERT_INVALID=Vydavatel certifik\u00e1tu je neplatn\u00fd.
SEC_ERROR_PATH_LEN_CONSTRAINT_INVALID=Omezen\u00ed d\u00e9lky cesty certifik\u00e1tu je neplatn\u00e9.
SEC_ERROR_CERT_USAGES_INVALID=Pole u\u017eit\u00ed certifik\u00e1tu je neplatn\u00e9.
SEC_INTERNAL_ONLY=**Pouze intern\u00ed modul**
SEC_ERROR_INVALID_KEY=Kl\u00ed\u010d nepodporuje po\u017eadovanou operaci.
SEC_ERROR_UNKNOWN_CRITICAL_EXTENSION=Certifik\u00e1t obsahuje nezn\u00e1m\u00e9 kritick\u00e9 roz\u0161\u00ed\u0159en\u00ed.
SEC_ERROR_OLD_CRL=Nov\u00fd CRL nen\u00ed nov\u011bj\u0161\u00ed ne\u017e aktu\u00e1ln\u00ed.
SEC_ERROR_NO_EMAIL_CERT=Nen\u00ed za\u0161ifrov\u00e1no nebo podeps\u00e1no\: nem\u00e1te \u017e\u00e1dn\u00fd e-mailov\u00fd certifik\u00e1t.
SEC_ERROR_NO_RECIPIENT_CERTS_QUERY=Neza\u0161ifrov\u00e1no\: nem\u00e1te certifik\u00e1ty pro ka\u017ed\u00e9ho p\u0159\u00edjemce.
SEC_ERROR_NOT_A_RECIPIENT=Nelze de\u0161ifrovat\: nejste p\u0159\u00edjemce nebo nebyl nalezen odpov\u00eddaj\u00edc\u00ed certifik\u00e1t a soukrom\u00fd kl\u00ed\u010d.
SEC_ERROR_PKCS7_KEYALG_MISMATCH=Nelze de\u0161ifrovat\: algoritmus \u0161ifrovac\u00edho kl\u00ed\u010de neodpov\u00edd\u00e1 va\u0161emu certifik\u00e1tu.
SEC_ERROR_PKCS7_BAD_SIGNATURE=Ov\u011b\u0159en\u00ed podpisu se nezda\u0159ilo\: nenalezen podpisuj\u00edc\u00ed, nalezeno p\u0159\u00edli\u0161 mnoho podpisuj\u00edc\u00edch, nebo nespr\u00e1vn\u00e9 \u010di po\u0161kozen\u00e9 \u00fadaje.
SEC_ERROR_UNSUPPORTED_KEYALG=Nepodporovan\u00fd nebo nezn\u00e1m\u00fd algoritmus kl\u00ed\u010de.
SEC_ERROR_DECRYPTION_DISALLOWED=Nelze de\u0161ifrovat\: za\u0161ifrov\u00e1no nepovolen\u00fdm algoritmem nebo velikost\u00ed kl\u00ed\u010de.
XP_SEC_FORTEZZA_BAD_CARD=Karta typu Fortezza nebyla spr\u00e1vn\u011b inicializov\u00e1na. Vyjm\u011bte ji pros\u00edm a vra\u0165te ji vydavateli.
XP_SEC_FORTEZZA_NO_CARD=Nenalezena \u017e\u00e1dn\u00e1 karta typu Fortezza
XP_SEC_FORTEZZA_NONE_SELECTED=Karta typu Fortezza nebyla zvolena
XP_SEC_FORTEZZA_MORE_INFO=Zvolte pros\u00edm osobu, o kter\u00e9 chcete z\u00edskat informace
XP_SEC_FORTEZZA_PERSON_NOT_FOUND=Osoba nenalezena
XP_SEC_FORTEZZA_NO_MORE_INFO=Nedostupn\u00e9 informace o osob\u011b
XP_SEC_FORTEZZA_BAD_PIN=Neplatn\u00fd PIN
XP_SEC_FORTEZZA_PERSON_ERROR=Nepoda\u0159ilo se inicializovat osoby typu Fortezza.
SEC_ERROR_NO_KRL=Nebyl nalezen \u017e\u00e1dn\u00fd KRL certifik\u00e1tu tohoto serveru
SEC_ERROR_KRL_EXPIRED=Platnost KRL certifik\u00e1tu tohoto serveru ji\u017e uplynula.
SEC_ERROR_KRL_BAD_SIGNATURE=KRL certifik\u00e1tu tohoto serveru m\u00e1 neplatn\u00fd podpis.
SEC_ERROR_REVOKED_KEY=Kl\u00ed\u010d certifik\u00e1tu tohoto serveru byl zneplatn\u011bn.
SEC_ERROR_KRL_INVALID=Nov\u00fd KRL m\u00e1 neplatn\u00fd form\u00e1t.
SEC_ERROR_NEED_RANDOM=Bezpe\u010dnostn\u00ed knihovna\: jsou vy\u017eadov\u00e1na n\u00e1hodn\u00e1 data.
SEC_ERROR_NO_MODULE=Bezpe\u010dnostn\u00ed knihovna\: \u017e\u00e1dn\u00fd z bezpe\u010dnostn\u00edch modul\u016f nem\u016f\u017ee prov\u00e9st po\u017eadovanou operaci.
SEC_ERROR_NO_TOKEN=Bezpe\u010dnostn\u00ed karta nebo token neexistuj\u00ed, nejsou inicializov\u00e1ny, nebo byly odstran\u011bny.
SEC_ERROR_READ_ONLY=Bezpe\u010dnostn\u00ed knihovna\: datab\u00e1ze je pouze pro \u010dten\u00ed.
SEC_ERROR_NO_SLOT_SELECTED=Nebyl zvolen \u017e\u00e1dn\u00fd slot ani token.
SEC_ERROR_CERT_NICKNAME_COLLISION=Certifik\u00e1t se stejn\u00fdm n\u00e1zvem ji\u017e existuje.
SEC_ERROR_KEY_NICKNAME_COLLISION=Kl\u00ed\u010d se stejn\u00fdm n\u00e1zvem ji\u017e existuje.
SEC_ERROR_SAFE_NOT_CREATED=Chyba p\u0159i vytv\u00e1\u0159en\u00ed bezpe\u010dn\u00e9ho objektu
SEC_ERROR_BAGGAGE_NOT_CREATED=Chyba p\u0159i vytv\u00e1\u0159en\u00ed objektu za\u0159\u00edzen\u00ed
XP_JAVA_REMOVE_PRINCIPAL_ERROR=Tohoto p\u0159edstavitele nelze odstranit
XP_JAVA_DELETE_PRIVILEGE_ERROR=Toto opr\u00e1vn\u011bn\u00ed nelze odstranit
XP_JAVA_CERT_NOT_EXISTS_ERROR=Tento p\u0159edstavitel nem\u00e1 certifik\u00e1t
SEC_ERROR_BAD_EXPORT_ALGORITHM=Po\u017eadovan\u00fd algoritmus nen\u00ed povolen.
SEC_ERROR_EXPORTING_CERTIFICATES=Chyba p\u0159i pokusu o exportov\u00e1n\u00ed certifik\u00e1tu.
SEC_ERROR_IMPORTING_CERTIFICATES=Chyba p\u0159i pokusu o importov\u00e1n\u00ed certifik\u00e1tu.
SEC_ERROR_PKCS12_DECODING_PFX=Nen\u00ed mo\u017en\u00e9 importovat. Chyba de\u0161ifrov\u00e1n\u00ed. Soubor nen\u00ed platn\u00fd.
SEC_ERROR_PKCS12_INVALID_MAC=Nen\u00ed mo\u017en\u00e9 importovat. Neplatn\u00fd MAC. Nespr\u00e1vn\u00e9 heslo nebo poru\u0161en\u00fd soubor.
SEC_ERROR_PKCS12_UNSUPPORTED_MAC_ALGORITHM=Nen\u00ed mo\u017en\u00e9 importovat. Algoritmus MAC nen\u00ed podporov\u00e1n.
SEC_ERROR_PKCS12_UNSUPPORTED_TRANSPORT_MODE=Nen\u00ed mo\u017en\u00e9 importovat. Podporov\u00e1ny jsou pouze m\u00f3dy integrity hesla a soukrom\u00ed.
SEC_ERROR_PKCS12_CORRUPT_PFX_STRUCTURE=Nen\u00ed mo\u017en\u00e9 importovat. Struktura souboru je poru\u0161en\u00e1.
SEC_ERROR_PKCS12_UNSUPPORTED_PBE_ALGORITHM=Nen\u00ed mo\u017en\u00e9 importovat. \u0160ifrovac\u00ed algoritmus nen\u00ed podporov\u00e1n.
SEC_ERROR_PKCS12_UNSUPPORTED_VERSION=Nen\u00ed mo\u017en\u00e9 importovat. Verze souboru nen\u00ed podporov\u00e1na.
SEC_ERROR_PKCS12_PRIVACY_PASSWORD_INCORRECT=Nen\u00ed mo\u017en\u00e9 importovat. Nespr\u00e1vn\u00e9 soukrom\u00e9 heslo.
SEC_ERROR_PKCS12_CERT_COLLISION=Nen\u00ed mo\u017en\u00e9 importovat. Stejn\u00e1 p\u0159ezd\u00edvka ji\u017e v datab\u00e1zi existuje.
SEC_ERROR_USER_CANCELLED=Zru\u0161eno na \u017e\u00e1dost u\u017eivatele.
SEC_ERROR_PKCS12_DUPLICATE_DATA=Nenaimportov\u00e1no, proto\u017ee je ji\u017e v datab\u00e1zi.
SEC_ERROR_MESSAGE_SEND_ABORTED=Zpr\u00e1va neodesl\u00e1na.
SEC_ERROR_INADEQUATE_KEY_USAGE=Kl\u00ed\u010d certifik\u00e1tu nen\u00ed dostate\u010dn\u00fd pro po\u017eadovanou operaci.
SEC_ERROR_INADEQUATE_CERT_TYPE=Typ certifik\u00e1tu nebyl schv\u00e1len pro aplikace.
SEC_ERROR_CERT_ADDR_MISMATCH=Adresa v podpisuj\u00edc\u00edm certifik\u00e1tu nesouhlas\u00ed s adresou v hlavi\u010dce zpr\u00e1vy.
SEC_ERROR_PKCS12_UNABLE_TO_IMPORT_KEY=Nen\u00ed mo\u017en\u00e9 importovat. Chyba p\u0159i pokusu o import soukrom\u00e9ho kl\u00ed\u010de.
SEC_ERROR_PKCS12_IMPORTING_CERT_CHAIN=Nen\u00ed mo\u017en\u00e9 importovat. Chyba p\u0159i pokusu o import \u0159et\u011bzce certifik\u00e1t\u016f.
SEC_ERROR_PKCS12_UNABLE_TO_LOCATE_OBJECT_BY_NAME=Nen\u00ed mo\u017en\u00e9 exportovat. Nepoda\u0159ilo se podle p\u0159ezd\u00edvky nal\u00e9zt certifik\u00e1t nebo kl\u00ed\u010d.
SEC_ERROR_PKCS12_UNABLE_TO_EXPORT_KEY=Nen\u00ed mo\u017en\u00e9 exportovat. Nepoda\u0159ilo se nal\u00e9zt a exportovat soukrom\u00fd kl\u00ed\u010d.
SEC_ERROR_PKCS12_UNABLE_TO_WRITE=Nen\u00ed mo\u017en\u00e9 exportovat. Nepoda\u0159ilo se zapsat do exportn\u00edho souboru.
SEC_ERROR_PKCS12_UNABLE_TO_READ=Nen\u00ed mo\u017en\u00e9 importovat. Nepoda\u0159ilo se \u010d\u00edst z importn\u00edho souboru.
SEC_ERROR_PKCS12_KEY_DATABASE_NOT_INITIALIZED=Nen\u00ed mo\u017en\u00e9 exportovat. Datab\u00e1ze kl\u00ed\u010d\u016f je poru\u0161ena nebo odstran\u011bna.
SEC_ERROR_KEYGEN_FAIL=Nepoda\u0159ilo se vygenerovat dvojici soukrom\u00fd/ve\u0159ejn\u00fd kl\u00ed\u010d.
SEC_ERROR_INVALID_PASSWORD=Zadan\u00e9 heslo je neplatn\u00e9. Zvolte pros\u00edm jin\u00e9.
SEC_ERROR_RETRY_OLD_PASSWORD=Zadan\u00e9 p\u016fvodn\u00ed heslo je nespr\u00e1vn\u00e9. Zkuste to pros\u00edm znovu.
SEC_ERROR_BAD_NICKNAME=P\u0159ezd\u00edvka certifik\u00e1tu je ji\u017e pou\u017e\u00edv\u00e1na.
SEC_ERROR_NOT_FORTEZZA_ISSUER=Partner\u016fv \u0159et\u011bzec typu Fortezza nem\u00e1 certifik\u00e1t typu Fortezza.
SEC_ERROR_CANNOT_MOVE_SENSITIVE_KEY=Citliv\u00fd kl\u00ed\u010d nen\u00ed mo\u017en\u00e9 p\u0159esunout do pozice, kde je vy\u017eadov\u00e1n.
SEC_ERROR_JS_INVALID_MODULE_NAME=Neplatn\u00e9 jm\u00e9no modulu.
SEC_ERROR_JS_INVALID_DLL=Neplatn\u00e1 cesta/soubor modulu
SEC_ERROR_JS_ADD_MOD_FAILURE=Nepoda\u0159ilo se p\u0159idat modul
SEC_ERROR_JS_DEL_MOD_FAILURE=Nepoda\u0159ilo se odstranit modul
SEC_ERROR_OLD_KRL=Nov\u00fd KRL nen\u00ed nov\u011bj\u0161\u00ed ne\u017e sou\u010dasn\u00fd.
SEC_ERROR_CKL_CONFLICT=Nov\u00fd CKL m\u00e1 jin\u00e9ho vydavatele ne\u017e sou\u010dasn\u00fd CKL. Odstra\u0148te sou\u010dasn\u00fd CKL.
SEC_ERROR_CERT_NOT_IN_NAME_SPACE=Certifika\u010dn\u00ed autorita pro tento certifik\u00e1t nem\u00e1 povoleno vydat certifik\u00e1t s t\u00edmto jm\u00e9nem.
SEC_ERROR_KRL_NOT_YET_VALID=Seznam zneplatn\u011bn\u00fdch kl\u00ed\u010d\u016f pro tento certifik\u00e1t nen\u00ed je\u0161t\u011b platn\u00fd.
SEC_ERROR_CRL_NOT_YET_VALID=Seznam zneplatn\u011bn\u00fdch certifik\u00e1t\u016f pro tento certifik\u00e1t nen\u00ed je\u0161t\u011b platn\u00fd.
SEC_ERROR_UNKNOWN_CERT=Po\u017eadovan\u00fd certifik\u00e1t nemohl b\u00fdt nalezen.
SEC_ERROR_UNKNOWN_SIGNER=Nepoda\u0159ilo se nal\u00e9zt certifik\u00e1t podpisovatele.
SEC_ERROR_CERT_BAD_ACCESS_LOCATION=Adresa serveru pro ov\u011b\u0159en\u00ed stavu certifik\u00e1t\u016f m\u00e1 nespr\u00e1vn\u00fd form\u00e1t.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_TYPE=Nepoda\u0159ilo se pln\u011b de\u0161ifrovat odpov\u011b\u010f OCSP. Je nezn\u00e1m\u00e9ho typu.
SEC_ERROR_OCSP_BAD_HTTP_RESPONSE=Server OCSP vr\u00e1til neo\u010dek\u00e1van\u00e1/neplatn\u00e1 data HTTP.
SEC_ERROR_OCSP_MALFORMED_REQUEST=Server OCSP ozna\u010dil po\u017eadavek za poru\u0161en\u00fd nebo nespr\u00e1vn\u011b form\u00e1tovan\u00fd.
SEC_ERROR_OCSP_SERVER_ERROR=Server OCSP ozn\u00e1mil intern\u00ed chybu.
SEC_ERROR_OCSP_TRY_SERVER_LATER=Server OCSP doporu\u010dil zkusit to znovu pozd\u011bji.
SEC_ERROR_OCSP_REQUEST_NEEDS_SIG=Server OCSP po\u017eaduje podepsan\u00fd po\u017eadavek.
SEC_ERROR_OCSP_UNAUTHORIZED_REQUEST=Server OCSP odm\u00edtl po\u017eadavek jako neautorizovan\u00fd.
SEC_ERROR_OCSP_UNKNOWN_RESPONSE_STATUS=Server OCSP vr\u00e1til nerozpoznateln\u00fd k\u00f3d stavu.
SEC_ERROR_OCSP_UNKNOWN_CERT=Server OCSP nem\u00e1 pro certifik\u00e1t \u017e\u00e1dn\u00fd k\u00f3d stavu.
SEC_ERROR_OCSP_NOT_ENABLED=P\u0159ed proveden\u00edm t\u00e9to akce mus\u00edte nejd\u0159\u00edve povolit OCSP.
SEC_ERROR_OCSP_NO_DEFAULT_RESPONDER=P\u0159ed proveden\u00edm t\u00e9to akce mus\u00edte nejd\u0159\u00edve nastavit v\u00fdchoz\u00edho respondenta OCSP.
SEC_ERROR_OCSP_MALFORMED_RESPONSE=Odpov\u011b\u010f ze serveru OCSP byla poru\u0161en\u00e1 nebo nespr\u00e1vn\u011b form\u00e1tovan\u00e1.
SEC_ERROR_OCSP_UNAUTHORIZED_RESPONSE=Podpisovatel odpov\u011bdi OCSP nen\u00ed autorizovan\u00fd vracet k\u00f3d stavu pro tento certifik\u00e1t.
SEC_ERROR_OCSP_FUTURE_RESPONSE=Odpov\u011b\u010f ze serveru OCSP nen\u00ed je\u0161t\u011b platn\u00e1, proto\u017ee obsahuje datum v budoucnosti.
SEC_ERROR_OCSP_OLD_RESPONSE=Odpov\u011b\u010f ze serveru OCSP obsahuje zastaral\u00e9 informace.
SEC_ERROR_DIGEST_NOT_FOUND=V podepsan\u00e9 odpov\u011bdi nebylo nalezeno shrnut\u00ed typu CMS nebo PKCS \#7.
SEC_ERROR_UNSUPPORTED_MESSAGE_TYPE=Zpr\u00e1va typu CMS nebo PKCS \#7 nen\u00ed podporov\u00e1na.
SEC_ERROR_MODULE_STUCK=Modul PKCS \#11 se nepoda\u0159ilo odstranit, proto\u017ee je st\u00e1le pou\u017e\u00edv\u00e1n.
SEC_ERROR_BAD_TEMPLATE=Nepoda\u0159ilo se de\u0161ifrovat data ASN.1. Specifikovan\u00e1 \u0161ablona byla neplatn\u00e1.
SEC_ERROR_CRL_NOT_FOUND=Nebyl nalezen \u017e\u00e1dn\u00fd seznam CRL.
SEC_ERROR_REUSED_ISSUER_AND_SERIAL=Pokou\u0161\u00edte se importovat certifik\u00e1t se stejn\u00fdm vydavatelem/s\u00e9riov\u00fdm \u010d\u00edslem jako m\u00e1 ji\u017e existuj\u00edc\u00ed certifik\u00e1t, kter\u00fd ale nen\u00ed stejn\u00fd.
SEC_ERROR_BUSY=Nepoda\u0159ilo se ukon\u010dit NSS. Objekty se st\u00e1le pou\u017e\u00edvaj\u00ed.
SEC_ERROR_EXTRA_INPUT=Zpr\u00e1va za\u0161ifrovan\u00e1 metodou DER obsahuje nepou\u017eit\u00e1 extra data.
SEC_ERROR_UNSUPPORTED_ELLIPTIC_CURVE=Nepodporovan\u00e1 eliptick\u00e1 k\u0159ivka.
SEC_ERROR_UNSUPPORTED_EC_POINT_FORM=Nepodporovan\u00e1 forma bodu eliptick\u00e9 k\u0159ivky.
SEC_ERROR_UNRECOGNIZED_OID=Nerozpoznan\u00fd identifik\u00e1tor objektu.
SEC_ERROR_OCSP_INVALID_SIGNING_CERT=Neplatn\u00fd podpisuj\u00edc\u00ed certifik\u00e1t OCSP v odpov\u011bdi OCSP.
SEC_ERROR_REVOKED_CERTIFICATE_CRL=Certifik\u00e1t je zneplatn\u011bn v seznamu zneplatn\u011bn\u00fdch certifik\u00e1t\u016f vydavatele.
SEC_ERROR_REVOKED_CERTIFICATE_OCSP=Respondenta OCSP vydavatele nahl\u00e1sil certifik\u00e1t jako zneplatn\u011bn\u00fd.
SEC_ERROR_CRL_INVALID_VERSION=Seznam zneplatn\u011bn\u00fdch certifik\u00e1t\u016f vydavatele m\u00e1 nezn\u00e1m\u00e9 \u010d\u00edslo verze.
SEC_ERROR_CRL_V1_CRITICAL_EXTENSION=Seznam zneplatn\u011bn\u00fdch certifik\u00e1t\u016f vydavatele typu V1 m\u00e1 kritick\u00e9 roz\u0161\u00ed\u0159en\u00ed.
SEC_ERROR_CRL_UNKNOWN_CRITICAL_EXTENSION=Seznam zneplatn\u011bn\u00fdch certifik\u00e1t\u016f vydavatele typu V1 m\u00e1 nezn\u00e1m\u00e9 kritick\u00e9 roz\u0161\u00ed\u0159en\u00ed.
SEC_ERROR_UNKNOWN_OBJECT_TYPE=Specifikov\u00e1n nezn\u00e1m\u00fd typ objektu.
SEC_ERROR_INCOMPATIBLE_PKCS11=Ovlada\u010d PKCS \#11 poru\u0161uje specifikaci neslu\u010diteln\u00fdm zp\u016fsobem.
SEC_ERROR_NO_EVENT=Moment\u00e1ln\u011b nen\u00ed dostupn\u00fd \u017e\u00e1dn\u00fd slot pro ud\u00e1losti.
SEC_ERROR_CRL_ALREADY_EXISTS=CRL ji\u017e existuje.
SEC_ERROR_NOT_INITIALIZED=NSS nen\u00ed inicializov\u00e1no.
SEC_ERROR_TOKEN_NOT_LOGGED_IN=Operace skon\u010dila s chybou, proto\u017ee token PKCS \#11 nen\u00ed p\u0159ihl\u00e1\u0161en.
SEC_ERROR_OCSP_RESPONDER_CERT_INVALID=Nastaven\u00fd server OCSP m\u00e1 neplatn\u00fd certifik\u00e1t.
SEC_ERROR_OCSP_BAD_SIGNATURE=Odpov\u011b\u010f OCSP m\u00e1 neplatn\u00fd podpis.
SEC_ERROR_OUT_OF_SEARCH_LIMITS=Zji\u0161\u0165ov\u00e1n\u00ed ov\u011b\u0159en\u00ed platnosti certifik\u00e1tu je mimo limity hled\u00e1n\u00ed
SEC_ERROR_INVALID_POLICY_MAPPING=Mapov\u00e1n\u00ed z\u00e1sad neobsahuje \u017e\u00e1dn\u00e9 z\u00e1sady
SEC_ERROR_POLICY_VALIDATION_FAILED=\u0158et\u011bzec certifik\u00e1t\u016f neodpov\u00edd\u00e1 z\u00e1sad\u00e1m ov\u011b\u0159en\u00ed platnosti
SEC_ERROR_UNKNOWN_AIA_LOCATION_TYPE=Nezn\u00e1m\u00fd typ um\u00edst\u011bn\u00ed v roz\u0161\u00ed\u0159en\u00ed AIA certifik\u00e1tu
SEC_ERROR_BAD_HTTP_RESPONSE=Server vr\u00e1til chybnou odpov\u011b\u010f HTTP
SEC_ERROR_BAD_LDAP_RESPONSE=Server vr\u00e1til chybnou odpov\u011b\u010f LDAP
SEC_ERROR_FAILED_TO_ENCODE_DATA=Zak\u00f3dov\u00e1n\u00ed dat pomoc\u00ed ASN1 kod\u00e9ru se nezda\u0159ilo
SEC_ERROR_BAD_INFO_ACCESS_LOCATION=Chybn\u00e9 um\u00edst\u011bn\u00ed p\u0159\u00edstupu k informaci v roz\u0161\u00ed\u0159en\u00ed certifik\u00e1tu.
SEC_ERROR_LIBPKIX_INTERNAL=P\u0159i ov\u011b\u0159en\u00ed platnosti certifik\u00e1tu nastala intern\u00ed chyba libpkix.
SEC_ERROR_PKCS11_GENERAL_ERROR=Modul PKCS \#11 vr\u00e1til chybu CKR_GENERAL_ERROR. Nastala neopraviteln\u00e1 chyba.
SEC_ERROR_PKCS11_FUNCTION_FAILED=Modul PKCS \#11 vr\u00e1til chybu CKR_FUNCTION_FAILED. Po\u017eadovan\u00e1 funkce nemohla b\u00fdt provedena. Opakov\u00e1n\u00ed stejn\u00e9 operace znovu m\u016f\u017ee usp\u011bt.
SEC_ERROR_PKCS11_DEVICE_ERROR=Modul PKCS \#11 vr\u00e1til chybu CKR_DEVICE_ERROR. Nastal probl\u00e9m s tokenem nebo slotem.
SEC_ERROR_BAD_INFO_ACCESS_METHOD=Nezn\u00e1m\u00e1 metoda p\u0159\u00edstupu k informaci v roz\u0161\u00ed\u0159en\u00ed certifik\u00e1tu.
SEC_ERROR_CRL_IMPORT_FAILED=Chyba p\u0159i pokusu o import CRL.
SEC_ERROR_EXPIRED_PASSWORD=Platnost hesla vypr\u0161ela.
SEC_ERROR_LOCKED_PASSWORD=Heslo je zam\u010den\u00e9.
SEC_ERROR_UNKNOWN_PKCS11_ERROR=Nezn\u00e1m\u00e1 chyba PKCS \#11.
SEC_ERROR_BAD_CRL_DP_URL=Neplatn\u00e1 nebo nepodporovan\u00e1 adresa URL v n\u00e1zvu distribu\u010dn\u00edho bodu CRL.
SEC_ERROR_CERT_SIGNATURE_ALGORITHM_DISABLED=Certifik\u00e1t byl podeps\u00e1n algoritmem, kter\u00fd je z bezpe\u010dnostn\u00edch d\u016fvod\u016f zak\u00e1z\u00e1n.
MOZILLA_PKIX_ERROR_KEY_PINNING_FAILURE=Server pou\u017e\u00edv\u00e1 key pinning (HPKP), ale nebyl slo\u017een vhodn\u00fd \u0159et\u011bzec d\u016fv\u011bryhodn\u00fdch certifik\u00e1t\u016f, kter\u00e9 se shoduj\u00ed s dan\u00fdm pinsetem. Poru\u0161en\u00ed key pinning nen\u00ed mo\u017en\u00e9 ignorovat.
MOZILLA_PKIX_ERROR_CA_CERT_USED_AS_END_ENTITY=Server pou\u017e\u00edv\u00e1 certifik\u00e1t s roz\u0161\u00ed\u0159en\u00fdm z\u00e1kladn\u00edch vymezen\u00ed, kter\u00e9 ho identifikuj\u00ed jako certifika\u010dn\u00ed autoritu. Pro korektn\u011b vydan\u00fd certifik\u00e1t by toto nem\u011blo nastat.
MOZILLA_PKIX_ERROR_INADEQUATE_KEY_SIZE=Server poskytl certifik\u00e1t s velikost\u00ed kl\u00ed\u010de, kter\u00e1 je p\u0159\u00edli\u0161 mal\u00e1 na sestaven\u00ed bezpe\u010dn\u00e9ho spojen\u00ed.
MOZILLA_PKIX_ERROR_V1_CERT_USED_AS_CA=P\u0159i vyd\u00e1n\u00ed certifik\u00e1tu serveru byl pou\u017eit certifik\u00e1t X.509 verze 1, kter\u00fd nen\u00ed d\u016fv\u011bryhodn\u00fdm certifik\u00e1tem. Certifik\u00e1ty X.509 verze 1 jsou zastaral\u00e9 a nem\u011bly by se pou\u017e\u00edvat na podepisov\u00e1n\u00ed jin\u00fdch certifik\u00e1t\u016f.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_CERTIFICATE=Server poskytl certifik\u00e1t, kter\u00fd zat\u00edm nen\u00ed platn\u00fd.
MOZILLA_PKIX_ERROR_NOT_YET_VALID_ISSUER_CERTIFICATE=Na vyd\u00e1n\u00ed certifik\u00e1tu byl pou\u017eit certifik\u00e1t, kter\u00fd zat\u00edm nen\u00ed platn\u00fd.

