#X-Generator: crowdin.com
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

malformedURI=URL\uc774 \uc720\ud6a8\ud558\uc9c0 \uc54a\uc544 \ud398\uc774\uc9c0\ub97c \uc5f4 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
fileNotFound=%S\uc5d0\uc11c \ud30c\uc77c\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
dnsNotFound=%S \uc11c\ubc84\ub97c \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
protocolNotFound=\ud504\ub85c\ud1a0\ucf5c %S\ub294 \uc5b4\ub5a4 \ud504\ub85c\uadf8\ub7a8\uacfc\ub3c4 \uc5f0\uacb0\ub418\uc5b4 \uc788\uc9c0 \uc54a\uc73c\ubbc0\ub85c, \uc8fc\uc18c\ub97c \uc5f4 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
connectionFailure=%S \uc11c\ubc84\uc640 \uc5f0\uacb0\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
netInterrupt=%S\uc640(\uacfc)\uc758 \uc5f0\uacb0\uc774 \ub85c\ub529 \uc911\uc5d0 \ub04a\uc5b4\uc84c\uc2b5\ub2c8\ub2e4.
netTimeout=%S \uc11c\ubc84\uc758 \uc751\ub2f5\uc774 \ub108\ubb34 \ub2a6\uc2b5\ub2c8\ub2e4.
redirectLoop=\uc774 \uc8fc\uc18c\uc5d0 \ub300\ud558\uc5ec \uc644\uc804\ud558\uc9c0 \ubabb\ud55c \ubc29\ubc95\uc758 \uc5f0\uacb0 \uc774\ub3d9 \uc694\uccad\uc774 \uac10\uc9c0\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
## LOCALIZATION NOTE (confirmRepostPrompt): In this item, don't translate "%S"
confirmRepostPrompt=\ud604\uc7ac \ud398\uc774\uc9c0\ub97c \ud45c\uc2dc\ud558\ub824\uba74, %S\uac00 \uc774\uc804\uc5d0 \uc218\ud589\ud588\ub358 \uc815\ubcf4\uac00 \ud544\uc694\ud569\ub2c8\ub2e4. \uc774\uc804\uc5d0 \uc218\ud589\ud588\ub358 \uc791\uc5c5(\uac80\uc0c9 \ud639\uc740 \uc785\ub825 \uc591\uc2dd \uc81c\ucd9c)\uc744 \ub2e4\uc2dc \ubc18\ubcf5 \ud569\ub2c8\ub2e4.
resendButton.label=\ub2e4\uc2dc \ubcf4\ub0b4\uae30
unknownSocketType=\uc774 \uc11c\ubc84\uc640\uc758 \ud1b5\uc2e0 \ubc29\ubc95\uc744 \uc54c \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
netReset=\ud398\uc774\uc9c0 \ub85c\ub529 \uc911 \uc11c\ubc84\uc640\uc758 \uc5f0\uacb0\uc774 \ucd08\uae30\ud654 \ub418\uc5c8\uc2b5\ub2c8\ub2e4.
notCached=\ud604\uc7ac \ud398\uc774\uc9c0\ub294 \ub354 \uc774\uc0c1 \uc81c\uacf5\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
netOffline=\uc624\ud504\ub77c\uc778 \uc0c1\ud0dc\uc5d0\uc11c\ub294 \uc6f9\uc5d0 \uc5f0\uacb0\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
isprinting=\uc778\uc1c4 \uc911 \ub610\ub294 \ubbf8\ub9ac \ubcf4\uae30\uc5d0\uc11c\ub294 \ubb38\uc11c\ub97c \uc218\uc815\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
deniedPortAccess=\uc774 \uc8fc\uc18c\uac00 \uc77c\ubc18\uc801\uc73c\ub85c \uc6f9\uc774 \uc544\ub2cc \ub2e4\ub978 \ubaa9\uc801\uc73c\ub85c \uc0ac\uc6a9\ub418\ub294 \ud3ec\ud2b8\uc5d0 \uc5f0\uacb0\ud558\ub824\uace0 \ud569\ub2c8\ub2e4. \ubcf4\uc548\uc0c1\uc758 \uc774\uc720\ub85c \uc5f0\uacb0\uc744 \ucde8\uc18c\ud569\ub2c8\ub2e4.
proxyResolveFailure=\uc124\uc815\ub41c \ud504\ub85d\uc2dc \uc11c\ubc84\ub97c \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
proxyConnectFailure=\ud504\ub85d\uc2dc \uc11c\ubc84\uc5d0\uc11c \uc5f0\uacb0\uc744 \uac70\ubd80\ud558\ub3c4\ub85d \uc124\uc815\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
contentEncodingError=\uc720\ud6a8\ud558\uc9c0 \uc54a\uac70\ub098 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\ub294 \uc555\ucd95 \ud615\uc2dd\uc744 \uc0ac\uc6a9\ud558\ubbc0\ub85c \ud604\uc7ac \ud398\uc774\uc9c0\ub97c \ud45c\uc2dc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
unsafeContentType=\ud604\uc7ac \uc811\uc18d\ud558\uace0\uc790 \ud558\ub294 \ud398\uc774\uc9c0\ub294 \uc548\uc804\ud558\uc9c0 \uc54a\ub294 \ud615\uc2dd\uc758 \ud30c\uc77c\uc744 \ud3ec\ud568 \ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4. \ud604\uc7ac \ubb38\uc81c\uc5d0 \ub300\ud574 \uc6f9 \uc0ac\uc774\ud2b8 \uad00\ub9ac\uc790\uc5d0\uac8c \uc54c\ub824 \uc8fc\uc2ed\uc2dc\uc624.
externalProtocolTitle=\uc678\ubd80 \ud504\ub85c\ud1a0\ucf5c \uc694\uccad
externalProtocolPrompt=\uc678\ubd80 \ud504\ub85c\uadf8\ub7a8\uc740 %1$S\: \ub9c1\ud06c\uc5d0 \uc758\ud574 \uc2e4\ud589\ub429\ub2c8\ub2e4. \n\n\n\uc694\uccad \ub9c1\ud06c\: %2$S\n\ud504\ub85c\uadf8\ub7a8\: %3$S\n\n\n\ub9cc\uc57d \uc774 \uc694\uccad\uc774 \uc0ac\uc6a9\uc790\uac00 \uae30\ub300\ud55c \uc2e4\ud589\uc774 \uc544\ub2c8\ub77c\uba74 \ub2e4\ub978 \ud504\ub85c\uadf8\ub7a8\uc758 \ucde8\uc57d\uc810\uc744 \uacf5\uaca9\ud558\uae30 \uc704\ud55c \uc2dc\ub3c4\uc77c \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \uc815\uc0c1\uc801\uc778 \uc694\uccad\uc73c\ub85c \ud310\ub2e8\uc774 \ub418\uc9c0 \uc54a\uc73c\uba74 \ucde8\uc18c\ub97c \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\uc54c \uc218 \uc5c6\uc74c>
externalProtocolChkMsg=\uc774 \ud615\uc2dd\uc758 \ubaa8\ub4e0 \ub9c1\ud06c\ub97c \uae30\ub85d
externalProtocolLaunchBtn=\ud504\ub85c\uadf8\ub7a8 \uc2e4\ud589
malwareBlocked=%S\uc5d0\uc11c \ud604\uc7ac \uc6f9 \uc0ac\uc774\ud2b8\ub97c \uacf5\uaca9 \uc0ac\uc774\ud2b8\ub85c \ud310\ub2e8\ud558\uc5ec \ubcf4\uc548 \uc124\uc815\uc5d0 \ub530\ub77c \ucc28\ub2e8\ud569\ub2c8\ub2e4.
phishingBlocked=%S\uc5d0\uc11c \ud604\uc7ac \uc6f9 \uc0ac\uc774\ud2b8\ub97c  \uac1c\uc778 \ubc0f \uae08\uc735 \uc815\ubcf4\ub97c \uac08\ucde8\ud560 \uc218 \uc788\ub294 \ud53c\uc2f1 \uc758\uc2ec \uc0ac\uc774\ud2b8\ub85c \ud310\ub2e8 \ud558\uc600\uc2b5\ub2c8\ub2e4.
cspFrameAncestorBlocked=\uc774 \ud398\uc774\uc9c0\ub294 \uc774 \ubc29\ubc95\uc73c\ub85c \uc784\ubca0\ub4dc \ub418\uc5b4 \uc788\ub294 \uac83\uc744 \ub9c9\ub294 \ucee8\ud150\uce20 \ubcf4\uc548 \uc815\ucc45\uc744 \uac00\uc9c0\uace0 \uc788\uc2b5\ub2c8\ub2e4.
xssBlockMode=This page contains an XSS attack that has been blocked for your security.
corruptedContentError=\uc774 \ud398\uc774\uc9c0\ub294 \uc804\uc1a1 \ub370\uc774\ud130\uc5d0 \uc624\ub958\uac00 \uac10\uc9c0\ub418\uc5b4\uc11c \ud45c\uc2dc\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
remoteXUL=\uc774 \ud398\uc774\uc9c0\ub294 Pale Moon\uc5d0\uc11c \uc544\uc9c1 \uc9c0\uc6d0\ud558\uc9c0 \uc54a\ub294 \uae30\uc220\uc744 \uc0ac\uc6a9\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.

